#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AbilityFunctions

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function AbilityFunctions.AbilityFunctions_C.DoNOTUse-BuildArrayOfHitActors
// 0x005C (0x005C - 0x0000)
struct AbilityFunctions_C_DoNOTUse_BuildArrayOfHitActors final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0014)(Parm)
	class UObject*                                __WorldContext;                                    // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<class AActor*>                         HitActors;                                         // 0x0018(0x000C)(Parm, OutParm, ZeroConstructor)
	int32                                         CallFunc_GetDataCountFromTargetData_ReturnValue;   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Variable;                                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<class AActor*>                         CallFunc_GetActorsFromTargetData_ReturnValue;      // 0x0034(0x000C)(ZeroConstructor, ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         LocalHitActors;                                    // 0x0050(0x000C)(Edit, ZeroConstructor, DisableEditOnTemplate)
};
static_assert(alignof(AbilityFunctions_C_DoNOTUse_BuildArrayOfHitActors) == 0x000004, "Wrong alignment on AbilityFunctions_C_DoNOTUse_BuildArrayOfHitActors");
static_assert(sizeof(AbilityFunctions_C_DoNOTUse_BuildArrayOfHitActors) == 0x00005C, "Wrong size on AbilityFunctions_C_DoNOTUse_BuildArrayOfHitActors");
static_assert(offsetof(AbilityFunctions_C_DoNOTUse_BuildArrayOfHitActors, TargetData) == 0x000000, "Member 'AbilityFunctions_C_DoNOTUse_BuildArrayOfHitActors::TargetData' has a wrong offset!");
static_assert(offsetof(AbilityFunctions_C_DoNOTUse_BuildArrayOfHitActors, __WorldContext) == 0x000014, "Member 'AbilityFunctions_C_DoNOTUse_BuildArrayOfHitActors::__WorldContext' has a wrong offset!");
static_assert(offsetof(AbilityFunctions_C_DoNOTUse_BuildArrayOfHitActors, HitActors) == 0x000018, "Member 'AbilityFunctions_C_DoNOTUse_BuildArrayOfHitActors::HitActors' has a wrong offset!");
static_assert(offsetof(AbilityFunctions_C_DoNOTUse_BuildArrayOfHitActors, CallFunc_GetDataCountFromTargetData_ReturnValue) == 0x000024, "Member 'AbilityFunctions_C_DoNOTUse_BuildArrayOfHitActors::CallFunc_GetDataCountFromTargetData_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilityFunctions_C_DoNOTUse_BuildArrayOfHitActors, CallFunc_Subtract_IntInt_ReturnValue) == 0x000028, "Member 'AbilityFunctions_C_DoNOTUse_BuildArrayOfHitActors::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilityFunctions_C_DoNOTUse_BuildArrayOfHitActors, Temp_int_Variable) == 0x00002C, "Member 'AbilityFunctions_C_DoNOTUse_BuildArrayOfHitActors::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(AbilityFunctions_C_DoNOTUse_BuildArrayOfHitActors, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'AbilityFunctions_C_DoNOTUse_BuildArrayOfHitActors::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilityFunctions_C_DoNOTUse_BuildArrayOfHitActors, CallFunc_GetActorsFromTargetData_ReturnValue) == 0x000034, "Member 'AbilityFunctions_C_DoNOTUse_BuildArrayOfHitActors::CallFunc_GetActorsFromTargetData_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilityFunctions_C_DoNOTUse_BuildArrayOfHitActors, CallFunc_Array_Get_Item) == 0x000040, "Member 'AbilityFunctions_C_DoNOTUse_BuildArrayOfHitActors::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AbilityFunctions_C_DoNOTUse_BuildArrayOfHitActors, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000044, "Member 'AbilityFunctions_C_DoNOTUse_BuildArrayOfHitActors::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilityFunctions_C_DoNOTUse_BuildArrayOfHitActors, CallFunc_Array_Add_ReturnValue) == 0x000048, "Member 'AbilityFunctions_C_DoNOTUse_BuildArrayOfHitActors::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilityFunctions_C_DoNOTUse_BuildArrayOfHitActors, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00004C, "Member 'AbilityFunctions_C_DoNOTUse_BuildArrayOfHitActors::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilityFunctions_C_DoNOTUse_BuildArrayOfHitActors, LocalHitActors) == 0x000050, "Member 'AbilityFunctions_C_DoNOTUse_BuildArrayOfHitActors::LocalHitActors' has a wrong offset!");

// Function AbilityFunctions.AbilityFunctions_C.SetArrayOfHitActors
// 0x0050 (0x0050 - 0x0000)
struct AbilityFunctions_C_SetArrayOfHitActors final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0014)(Parm)
	TArray<class AActor*>                         ArrayToSet;                                        // 0x0014(0x000C)(Parm, OutParm, ZeroConstructor, ReferenceParm)
	class UObject*                                __WorldContext;                                    // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetDataCountFromTargetData_ReturnValue;   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Variable;                                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<class AActor*>                         CallFunc_GetActorsFromTargetData_ReturnValue;      // 0x0030(0x000C)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AbilityFunctions_C_SetArrayOfHitActors) == 0x000004, "Wrong alignment on AbilityFunctions_C_SetArrayOfHitActors");
static_assert(sizeof(AbilityFunctions_C_SetArrayOfHitActors) == 0x000050, "Wrong size on AbilityFunctions_C_SetArrayOfHitActors");
static_assert(offsetof(AbilityFunctions_C_SetArrayOfHitActors, TargetData) == 0x000000, "Member 'AbilityFunctions_C_SetArrayOfHitActors::TargetData' has a wrong offset!");
static_assert(offsetof(AbilityFunctions_C_SetArrayOfHitActors, ArrayToSet) == 0x000014, "Member 'AbilityFunctions_C_SetArrayOfHitActors::ArrayToSet' has a wrong offset!");
static_assert(offsetof(AbilityFunctions_C_SetArrayOfHitActors, __WorldContext) == 0x000020, "Member 'AbilityFunctions_C_SetArrayOfHitActors::__WorldContext' has a wrong offset!");
static_assert(offsetof(AbilityFunctions_C_SetArrayOfHitActors, CallFunc_GetDataCountFromTargetData_ReturnValue) == 0x000024, "Member 'AbilityFunctions_C_SetArrayOfHitActors::CallFunc_GetDataCountFromTargetData_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilityFunctions_C_SetArrayOfHitActors, Temp_int_Variable) == 0x000028, "Member 'AbilityFunctions_C_SetArrayOfHitActors::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(AbilityFunctions_C_SetArrayOfHitActors, CallFunc_Subtract_IntInt_ReturnValue) == 0x00002C, "Member 'AbilityFunctions_C_SetArrayOfHitActors::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilityFunctions_C_SetArrayOfHitActors, CallFunc_GetActorsFromTargetData_ReturnValue) == 0x000030, "Member 'AbilityFunctions_C_SetArrayOfHitActors::CallFunc_GetActorsFromTargetData_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilityFunctions_C_SetArrayOfHitActors, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00003C, "Member 'AbilityFunctions_C_SetArrayOfHitActors::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilityFunctions_C_SetArrayOfHitActors, CallFunc_Array_Get_Item) == 0x000040, "Member 'AbilityFunctions_C_SetArrayOfHitActors::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AbilityFunctions_C_SetArrayOfHitActors, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000044, "Member 'AbilityFunctions_C_SetArrayOfHitActors::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilityFunctions_C_SetArrayOfHitActors, CallFunc_Array_Add_ReturnValue) == 0x000048, "Member 'AbilityFunctions_C_SetArrayOfHitActors::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilityFunctions_C_SetArrayOfHitActors, CallFunc_Add_IntInt_ReturnValue) == 0x00004C, "Member 'AbilityFunctions_C_SetArrayOfHitActors::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

}

#pragma pack(pop)
