#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Assault_Raygun_Auto

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "B_Assault_Generic_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass B_Assault_Raygun_Auto.B_Assault_Raygun_Auto_C
// 0x0044 (0x07B8 - 0x0774)
class AB_Assault_Raygun_Auto_C final : public AB_Assault_Generic_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_B_Assault_Raygun_Auto_C;            // 0x0774(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        Power_Loop_AudioComponent;                         // 0x0778(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	float                                         KnobSpeedup_Speed_3FE69DBE4BA3AC82D00932A40FE91D70; // 0x077C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ETimelineDirection                            KnobSpeedup__Direction_3FE69DBE4BA3AC82D00932A40FE91D70; // 0x0780(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_781[0x3];                                      // 0x0781(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     KnobSpeedup;                                       // 0x0784(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           WeaponGlow_EmissiveGlowLinear_C258D6FF46D677090111C0B2CB91D0E8; // 0x0788(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ETimelineDirection                            WeaponGlow__Direction_C258D6FF46D677090111C0B2CB91D0E8; // 0x0798(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_799[0x3];                                      // 0x0799(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     WeaponGlow;                                        // 0x079C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UMaterialInstanceDynamic*               WeaponGlowMID;                                     // 0x07A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         KnobSpinSpeed_Max_;                                // 0x07A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FLinearColor                           KnobIdleColor;                                     // 0x07A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_B_Assault_Raygun_Auto(int32 EntryPoint);
	void ReceiveBeginPlay();
	void OnStopWeaponFireFX();
	void OnPlayWeaponFireFX(bool bPersistentFire);
	void KnobSpeedup__UpdateFunc();
	void KnobSpeedup__FinishedFunc();
	void WeaponGlow__UpdateFunc();
	void WeaponGlow__FinishedFunc();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Assault_Raygun_Auto_C">();
	}
	static class AB_Assault_Raygun_Auto_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Assault_Raygun_Auto_C>();
	}
};
static_assert(alignof(AB_Assault_Raygun_Auto_C) == 0x000004, "Wrong alignment on AB_Assault_Raygun_Auto_C");
static_assert(sizeof(AB_Assault_Raygun_Auto_C) == 0x0007B8, "Wrong size on AB_Assault_Raygun_Auto_C");
static_assert(offsetof(AB_Assault_Raygun_Auto_C, UberGraphFrame_B_Assault_Raygun_Auto_C) == 0x000774, "Member 'AB_Assault_Raygun_Auto_C::UberGraphFrame_B_Assault_Raygun_Auto_C' has a wrong offset!");
static_assert(offsetof(AB_Assault_Raygun_Auto_C, Power_Loop_AudioComponent) == 0x000778, "Member 'AB_Assault_Raygun_Auto_C::Power_Loop_AudioComponent' has a wrong offset!");
static_assert(offsetof(AB_Assault_Raygun_Auto_C, KnobSpeedup_Speed_3FE69DBE4BA3AC82D00932A40FE91D70) == 0x00077C, "Member 'AB_Assault_Raygun_Auto_C::KnobSpeedup_Speed_3FE69DBE4BA3AC82D00932A40FE91D70' has a wrong offset!");
static_assert(offsetof(AB_Assault_Raygun_Auto_C, KnobSpeedup__Direction_3FE69DBE4BA3AC82D00932A40FE91D70) == 0x000780, "Member 'AB_Assault_Raygun_Auto_C::KnobSpeedup__Direction_3FE69DBE4BA3AC82D00932A40FE91D70' has a wrong offset!");
static_assert(offsetof(AB_Assault_Raygun_Auto_C, KnobSpeedup) == 0x000784, "Member 'AB_Assault_Raygun_Auto_C::KnobSpeedup' has a wrong offset!");
static_assert(offsetof(AB_Assault_Raygun_Auto_C, WeaponGlow_EmissiveGlowLinear_C258D6FF46D677090111C0B2CB91D0E8) == 0x000788, "Member 'AB_Assault_Raygun_Auto_C::WeaponGlow_EmissiveGlowLinear_C258D6FF46D677090111C0B2CB91D0E8' has a wrong offset!");
static_assert(offsetof(AB_Assault_Raygun_Auto_C, WeaponGlow__Direction_C258D6FF46D677090111C0B2CB91D0E8) == 0x000798, "Member 'AB_Assault_Raygun_Auto_C::WeaponGlow__Direction_C258D6FF46D677090111C0B2CB91D0E8' has a wrong offset!");
static_assert(offsetof(AB_Assault_Raygun_Auto_C, WeaponGlow) == 0x00079C, "Member 'AB_Assault_Raygun_Auto_C::WeaponGlow' has a wrong offset!");
static_assert(offsetof(AB_Assault_Raygun_Auto_C, WeaponGlowMID) == 0x0007A0, "Member 'AB_Assault_Raygun_Auto_C::WeaponGlowMID' has a wrong offset!");
static_assert(offsetof(AB_Assault_Raygun_Auto_C, KnobSpinSpeed_Max_) == 0x0007A4, "Member 'AB_Assault_Raygun_Auto_C::KnobSpinSpeed_Max_' has a wrong offset!");
static_assert(offsetof(AB_Assault_Raygun_Auto_C, KnobIdleColor) == 0x0007A8, "Member 'AB_Assault_Raygun_Auto_C::KnobIdleColor' has a wrong offset!");

}

#pragma pack(pop)
