#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Assault_Raygun_Auto

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function B_Assault_Raygun_Auto.B_Assault_Raygun_Auto_C.ExecuteUbergraph_B_Assault_Raygun_Auto
// 0x001C (0x001C - 0x0000)
struct B_Assault_Raygun_Auto_C_ExecuteUbergraph_B_Assault_Raygun_Auto final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bPersistentFire;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           CallFunc_LinearColorLerp_ReturnValue;              // 0x000C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Assault_Raygun_Auto_C_ExecuteUbergraph_B_Assault_Raygun_Auto) == 0x000004, "Wrong alignment on B_Assault_Raygun_Auto_C_ExecuteUbergraph_B_Assault_Raygun_Auto");
static_assert(sizeof(B_Assault_Raygun_Auto_C_ExecuteUbergraph_B_Assault_Raygun_Auto) == 0x00001C, "Wrong size on B_Assault_Raygun_Auto_C_ExecuteUbergraph_B_Assault_Raygun_Auto");
static_assert(offsetof(B_Assault_Raygun_Auto_C_ExecuteUbergraph_B_Assault_Raygun_Auto, EntryPoint) == 0x000000, "Member 'B_Assault_Raygun_Auto_C_ExecuteUbergraph_B_Assault_Raygun_Auto::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Assault_Raygun_Auto_C_ExecuteUbergraph_B_Assault_Raygun_Auto, K2Node_Event_bPersistentFire) == 0x000004, "Member 'B_Assault_Raygun_Auto_C_ExecuteUbergraph_B_Assault_Raygun_Auto::K2Node_Event_bPersistentFire' has a wrong offset!");
static_assert(offsetof(B_Assault_Raygun_Auto_C_ExecuteUbergraph_B_Assault_Raygun_Auto, CallFunc_Lerp_ReturnValue) == 0x000008, "Member 'B_Assault_Raygun_Auto_C_ExecuteUbergraph_B_Assault_Raygun_Auto::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Assault_Raygun_Auto_C_ExecuteUbergraph_B_Assault_Raygun_Auto, CallFunc_LinearColorLerp_ReturnValue) == 0x00000C, "Member 'B_Assault_Raygun_Auto_C_ExecuteUbergraph_B_Assault_Raygun_Auto::CallFunc_LinearColorLerp_ReturnValue' has a wrong offset!");

// Function B_Assault_Raygun_Auto.B_Assault_Raygun_Auto_C.OnPlayWeaponFireFX
// 0x0001 (0x0001 - 0x0000)
struct B_Assault_Raygun_Auto_C_OnPlayWeaponFireFX final
{
public:
	bool                                          bPersistentFire;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Assault_Raygun_Auto_C_OnPlayWeaponFireFX) == 0x000001, "Wrong alignment on B_Assault_Raygun_Auto_C_OnPlayWeaponFireFX");
static_assert(sizeof(B_Assault_Raygun_Auto_C_OnPlayWeaponFireFX) == 0x000001, "Wrong size on B_Assault_Raygun_Auto_C_OnPlayWeaponFireFX");
static_assert(offsetof(B_Assault_Raygun_Auto_C_OnPlayWeaponFireFX, bPersistentFire) == 0x000000, "Member 'B_Assault_Raygun_Auto_C_OnPlayWeaponFireFX::bPersistentFire' has a wrong offset!");

// Function B_Assault_Raygun_Auto.B_Assault_Raygun_Auto_C.UserConstructionScript
// 0x0004 (0x0004 - 0x0000)
struct B_Assault_Raygun_Auto_C_UserConstructionScript final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Assault_Raygun_Auto_C_UserConstructionScript) == 0x000004, "Wrong alignment on B_Assault_Raygun_Auto_C_UserConstructionScript");
static_assert(sizeof(B_Assault_Raygun_Auto_C_UserConstructionScript) == 0x000004, "Wrong size on B_Assault_Raygun_Auto_C_UserConstructionScript");
static_assert(offsetof(B_Assault_Raygun_Auto_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000000, "Member 'B_Assault_Raygun_Auto_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

}

#pragma pack(pop)
