#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_BGA_SploderPropaneTank

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "CoreUObject_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass B_BGA_SploderPropaneTank.B_BGA_SploderPropaneTank_C
// 0x00C0 (0x0548 - 0x0488)
class AB_BGA_SploderPropaneTank_C final : public ABuildingGameplayActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0488(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        PropaneExplosionWarningAudio;                      // 0x048C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UParticleSystemComponent*               PropaneExplosionWarningFX;                         // 0x0490(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   PropaneTankMesh;                                   // 0x0494(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UCapsuleComponent*                      PropaneTankCapsule;                                // 0x0498(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UProjectileMovementComponent*           ProjectileMovement;                                // 0x049C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	float                                         ExpandBeforeExplode_Scale_5E732A8540AAB66FDC4945A2B3198A85; // 0x04A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ETimelineDirection                            ExpandBeforeExplode__Direction_5E732A8540AAB66FDC4945A2B3198A85; // 0x04A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A5[0x3];                                      // 0x04A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     ExpandBeforeExplode;                               // 0x04A8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         TankWiggle_Scale_F38F2A8E4B18D4E64B869A903452F890; // 0x04AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ETimelineDirection                            TankWiggle__Direction_F38F2A8E4B18D4E64B869A903452F890; // 0x04B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B1[0x3];                                      // 0x04B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     TankWiggle;                                        // 0x04B4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsLevelProp;                                       // 0x04B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Thrown;                                            // 0x04B9(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor)
	bool                                          Dropped;                                           // 0x04BA(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor)
	bool                                          IsDestroyed;                                       // 0x04BB(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	bool                                          MeleeDrop;                                         // 0x04BC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4BD[0x3];                                      // 0x04BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                MeleeDropVector;                                   // 0x04C0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          TankOnGround;                                      // 0x04CC(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	bool                                          TankWarningFXEnabled;                              // 0x04CD(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor)
	bool                                          ExplosionImminent;                                 // 0x04CE(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          DelayedShouldDie;                                  // 0x04CF(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class USoundBase*                             BounceSound;                                       // 0x04D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class USoundBase*                             SoundBeforeExplode;                                // 0x04D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class USoundBase*                             ExplosionSound;                                    // 0x04D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UParticleSystem*                        ExplosionEffect;                                   // 0x04DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                ExplosionEffectScale;                              // 0x04E0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class APawn*                                  ExplosionInstigatingPawn;                          // 0x04EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor)
	class AController*                            ExplosionInstigatingController;                    // 0x04F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor)
	class AActor*                                 LastDamageCausingActor;                            // 0x04F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class APawn*                                  LastDamageCausingPawn;                             // 0x04F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  TC_MeleeDamage;                                    // 0x04FC(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class ABuildingSMActor*                       MyBaseMesh;                                        // 0x0514(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                VelocityWhenDropped;                               // 0x0518(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class FName                                   PropaneTankMeshDefaulCollisionProfileName;         // 0x0524(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FGameplayTag                           Event_NPCAbilityAttackAOEExplosion;                // 0x052C(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         TankReminderTimeMin;                               // 0x0534(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         TankReminderTimeMax;                               // 0x0538(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	EFortTeamAffiliation                          TeamAffiliationBetweenDamageInstigatorAndTankOwner; // 0x053C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortTeam                                     ExplosionInstigatingPawnTeam;                      // 0x053D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortTeam                                     TankOwnerTeam;                                     // 0x053E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53F[0x1];                                      // 0x053F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 AIAbilityTargetOfTankOwner;                        // 0x0540(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor)
	float                                         XYVelocityMultWhenBouncingOffOfAbilityTarget;      // 0x0544(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_B_BGA_SploderPropaneTank(int32 EntryPoint);
	void ReceiveBeginPlay();
	void MyBaseTookDamage(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);
	void RemindAI();
	void AIKnowsTankHasDropped();
	void MyBaseDiedOrWasReconfigured(EEndPlayReason EndPlayReason);
	void TankBaseDestroyed();
	void MeleeDamageLaunchesTank();
	void DelayExplosion_();
	void DropOrExplodeTank(bool Drop, bool MeleeDrop_0, class AActor* DamageCauser);
	void ExplodeNow();
	void ExpandThenExplode();
	void BounceOrImpactTankWiggle();
	void BounceOrImpactSound();
	void OnDeathServer(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AController* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void ReceiveDestroyed();
	void OnDamageServer(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AController* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void BndEvt__ProjectileMovement_K2Node_ComponentBoundEvent_32_OnProjectileBounceDelegate__DelegateSignature(const struct FHitResult& ImpactResult, const struct FVector& ImpactVelocity);
	void BndEvt__ProjectileMovement_K2Node_ComponentBoundEvent_29_OnProjectileStopDelegate__DelegateSignature(const struct FHitResult& ImpactResult);
	void ReceiveHit(class UPrimitiveComponent* MyComp, class AActor* Other, class UPrimitiveComponent* OtherComp, bool bSelfMoved, const struct FVector& HitLocation, const struct FVector& HitNormal, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void ExpandBeforeExplode__UpdateFunc();
	void ExpandBeforeExplode__FinishedFunc();
	void TankWiggle__UpdateFunc();
	void TankWiggle__FinishedFunc();
	void UserConstructionScript();
	void OnRep_IsDestroyed();
	void OnRep_Dropped();
	void OnRep_TankOnGround();
	void SetTankInBT(class UObject* ObjectToPassToBT);
	void OnRep_Thrown();
	void SetPropaneTankMeshCollisionProfile(bool CanHitWithMelee);
	void Propane_Tank_Warning_FX_and_Audio_Status(bool Enabled);
	void OnRep_TankWarningFXEnabled();
	bool ShouldDie(float Damage, class AController* EventInstigator, class AActor* DamageCauser);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_BGA_SploderPropaneTank_C">();
	}
	static class AB_BGA_SploderPropaneTank_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_BGA_SploderPropaneTank_C>();
	}
};
static_assert(alignof(AB_BGA_SploderPropaneTank_C) == 0x000004, "Wrong alignment on AB_BGA_SploderPropaneTank_C");
static_assert(sizeof(AB_BGA_SploderPropaneTank_C) == 0x000548, "Wrong size on AB_BGA_SploderPropaneTank_C");
static_assert(offsetof(AB_BGA_SploderPropaneTank_C, UberGraphFrame) == 0x000488, "Member 'AB_BGA_SploderPropaneTank_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_BGA_SploderPropaneTank_C, PropaneExplosionWarningAudio) == 0x00048C, "Member 'AB_BGA_SploderPropaneTank_C::PropaneExplosionWarningAudio' has a wrong offset!");
static_assert(offsetof(AB_BGA_SploderPropaneTank_C, PropaneExplosionWarningFX) == 0x000490, "Member 'AB_BGA_SploderPropaneTank_C::PropaneExplosionWarningFX' has a wrong offset!");
static_assert(offsetof(AB_BGA_SploderPropaneTank_C, PropaneTankMesh) == 0x000494, "Member 'AB_BGA_SploderPropaneTank_C::PropaneTankMesh' has a wrong offset!");
static_assert(offsetof(AB_BGA_SploderPropaneTank_C, PropaneTankCapsule) == 0x000498, "Member 'AB_BGA_SploderPropaneTank_C::PropaneTankCapsule' has a wrong offset!");
static_assert(offsetof(AB_BGA_SploderPropaneTank_C, ProjectileMovement) == 0x00049C, "Member 'AB_BGA_SploderPropaneTank_C::ProjectileMovement' has a wrong offset!");
static_assert(offsetof(AB_BGA_SploderPropaneTank_C, ExpandBeforeExplode_Scale_5E732A8540AAB66FDC4945A2B3198A85) == 0x0004A0, "Member 'AB_BGA_SploderPropaneTank_C::ExpandBeforeExplode_Scale_5E732A8540AAB66FDC4945A2B3198A85' has a wrong offset!");
static_assert(offsetof(AB_BGA_SploderPropaneTank_C, ExpandBeforeExplode__Direction_5E732A8540AAB66FDC4945A2B3198A85) == 0x0004A4, "Member 'AB_BGA_SploderPropaneTank_C::ExpandBeforeExplode__Direction_5E732A8540AAB66FDC4945A2B3198A85' has a wrong offset!");
static_assert(offsetof(AB_BGA_SploderPropaneTank_C, ExpandBeforeExplode) == 0x0004A8, "Member 'AB_BGA_SploderPropaneTank_C::ExpandBeforeExplode' has a wrong offset!");
static_assert(offsetof(AB_BGA_SploderPropaneTank_C, TankWiggle_Scale_F38F2A8E4B18D4E64B869A903452F890) == 0x0004AC, "Member 'AB_BGA_SploderPropaneTank_C::TankWiggle_Scale_F38F2A8E4B18D4E64B869A903452F890' has a wrong offset!");
static_assert(offsetof(AB_BGA_SploderPropaneTank_C, TankWiggle__Direction_F38F2A8E4B18D4E64B869A903452F890) == 0x0004B0, "Member 'AB_BGA_SploderPropaneTank_C::TankWiggle__Direction_F38F2A8E4B18D4E64B869A903452F890' has a wrong offset!");
static_assert(offsetof(AB_BGA_SploderPropaneTank_C, TankWiggle) == 0x0004B4, "Member 'AB_BGA_SploderPropaneTank_C::TankWiggle' has a wrong offset!");
static_assert(offsetof(AB_BGA_SploderPropaneTank_C, IsLevelProp) == 0x0004B8, "Member 'AB_BGA_SploderPropaneTank_C::IsLevelProp' has a wrong offset!");
static_assert(offsetof(AB_BGA_SploderPropaneTank_C, Thrown) == 0x0004B9, "Member 'AB_BGA_SploderPropaneTank_C::Thrown' has a wrong offset!");
static_assert(offsetof(AB_BGA_SploderPropaneTank_C, Dropped) == 0x0004BA, "Member 'AB_BGA_SploderPropaneTank_C::Dropped' has a wrong offset!");
static_assert(offsetof(AB_BGA_SploderPropaneTank_C, IsDestroyed) == 0x0004BB, "Member 'AB_BGA_SploderPropaneTank_C::IsDestroyed' has a wrong offset!");
static_assert(offsetof(AB_BGA_SploderPropaneTank_C, MeleeDrop) == 0x0004BC, "Member 'AB_BGA_SploderPropaneTank_C::MeleeDrop' has a wrong offset!");
static_assert(offsetof(AB_BGA_SploderPropaneTank_C, MeleeDropVector) == 0x0004C0, "Member 'AB_BGA_SploderPropaneTank_C::MeleeDropVector' has a wrong offset!");
static_assert(offsetof(AB_BGA_SploderPropaneTank_C, TankOnGround) == 0x0004CC, "Member 'AB_BGA_SploderPropaneTank_C::TankOnGround' has a wrong offset!");
static_assert(offsetof(AB_BGA_SploderPropaneTank_C, TankWarningFXEnabled) == 0x0004CD, "Member 'AB_BGA_SploderPropaneTank_C::TankWarningFXEnabled' has a wrong offset!");
static_assert(offsetof(AB_BGA_SploderPropaneTank_C, ExplosionImminent) == 0x0004CE, "Member 'AB_BGA_SploderPropaneTank_C::ExplosionImminent' has a wrong offset!");
static_assert(offsetof(AB_BGA_SploderPropaneTank_C, DelayedShouldDie) == 0x0004CF, "Member 'AB_BGA_SploderPropaneTank_C::DelayedShouldDie' has a wrong offset!");
static_assert(offsetof(AB_BGA_SploderPropaneTank_C, BounceSound) == 0x0004D0, "Member 'AB_BGA_SploderPropaneTank_C::BounceSound' has a wrong offset!");
static_assert(offsetof(AB_BGA_SploderPropaneTank_C, SoundBeforeExplode) == 0x0004D4, "Member 'AB_BGA_SploderPropaneTank_C::SoundBeforeExplode' has a wrong offset!");
static_assert(offsetof(AB_BGA_SploderPropaneTank_C, ExplosionSound) == 0x0004D8, "Member 'AB_BGA_SploderPropaneTank_C::ExplosionSound' has a wrong offset!");
static_assert(offsetof(AB_BGA_SploderPropaneTank_C, ExplosionEffect) == 0x0004DC, "Member 'AB_BGA_SploderPropaneTank_C::ExplosionEffect' has a wrong offset!");
static_assert(offsetof(AB_BGA_SploderPropaneTank_C, ExplosionEffectScale) == 0x0004E0, "Member 'AB_BGA_SploderPropaneTank_C::ExplosionEffectScale' has a wrong offset!");
static_assert(offsetof(AB_BGA_SploderPropaneTank_C, ExplosionInstigatingPawn) == 0x0004EC, "Member 'AB_BGA_SploderPropaneTank_C::ExplosionInstigatingPawn' has a wrong offset!");
static_assert(offsetof(AB_BGA_SploderPropaneTank_C, ExplosionInstigatingController) == 0x0004F0, "Member 'AB_BGA_SploderPropaneTank_C::ExplosionInstigatingController' has a wrong offset!");
static_assert(offsetof(AB_BGA_SploderPropaneTank_C, LastDamageCausingActor) == 0x0004F4, "Member 'AB_BGA_SploderPropaneTank_C::LastDamageCausingActor' has a wrong offset!");
static_assert(offsetof(AB_BGA_SploderPropaneTank_C, LastDamageCausingPawn) == 0x0004F8, "Member 'AB_BGA_SploderPropaneTank_C::LastDamageCausingPawn' has a wrong offset!");
static_assert(offsetof(AB_BGA_SploderPropaneTank_C, TC_MeleeDamage) == 0x0004FC, "Member 'AB_BGA_SploderPropaneTank_C::TC_MeleeDamage' has a wrong offset!");
static_assert(offsetof(AB_BGA_SploderPropaneTank_C, MyBaseMesh) == 0x000514, "Member 'AB_BGA_SploderPropaneTank_C::MyBaseMesh' has a wrong offset!");
static_assert(offsetof(AB_BGA_SploderPropaneTank_C, VelocityWhenDropped) == 0x000518, "Member 'AB_BGA_SploderPropaneTank_C::VelocityWhenDropped' has a wrong offset!");
static_assert(offsetof(AB_BGA_SploderPropaneTank_C, PropaneTankMeshDefaulCollisionProfileName) == 0x000524, "Member 'AB_BGA_SploderPropaneTank_C::PropaneTankMeshDefaulCollisionProfileName' has a wrong offset!");
static_assert(offsetof(AB_BGA_SploderPropaneTank_C, Event_NPCAbilityAttackAOEExplosion) == 0x00052C, "Member 'AB_BGA_SploderPropaneTank_C::Event_NPCAbilityAttackAOEExplosion' has a wrong offset!");
static_assert(offsetof(AB_BGA_SploderPropaneTank_C, TankReminderTimeMin) == 0x000534, "Member 'AB_BGA_SploderPropaneTank_C::TankReminderTimeMin' has a wrong offset!");
static_assert(offsetof(AB_BGA_SploderPropaneTank_C, TankReminderTimeMax) == 0x000538, "Member 'AB_BGA_SploderPropaneTank_C::TankReminderTimeMax' has a wrong offset!");
static_assert(offsetof(AB_BGA_SploderPropaneTank_C, TeamAffiliationBetweenDamageInstigatorAndTankOwner) == 0x00053C, "Member 'AB_BGA_SploderPropaneTank_C::TeamAffiliationBetweenDamageInstigatorAndTankOwner' has a wrong offset!");
static_assert(offsetof(AB_BGA_SploderPropaneTank_C, ExplosionInstigatingPawnTeam) == 0x00053D, "Member 'AB_BGA_SploderPropaneTank_C::ExplosionInstigatingPawnTeam' has a wrong offset!");
static_assert(offsetof(AB_BGA_SploderPropaneTank_C, TankOwnerTeam) == 0x00053E, "Member 'AB_BGA_SploderPropaneTank_C::TankOwnerTeam' has a wrong offset!");
static_assert(offsetof(AB_BGA_SploderPropaneTank_C, AIAbilityTargetOfTankOwner) == 0x000540, "Member 'AB_BGA_SploderPropaneTank_C::AIAbilityTargetOfTankOwner' has a wrong offset!");
static_assert(offsetof(AB_BGA_SploderPropaneTank_C, XYVelocityMultWhenBouncingOffOfAbilityTarget) == 0x000544, "Member 'AB_BGA_SploderPropaneTank_C::XYVelocityMultWhenBouncingOffOfAbilityTarget' has a wrong offset!");

}

#pragma pack(pop)
