#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_BGA_SploderPropaneTank

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function B_BGA_SploderPropaneTank.B_BGA_SploderPropaneTank_C.ExecuteUbergraph_B_BGA_SploderPropaneTank
// 0x0694 (0x0694 - 0x0000)
struct B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_Event_MyComp;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_Event_Other;                                // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    K2Node_Event_OtherComp;                            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bSelfMoved;                           // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_HitLocation;                          // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                K2Node_Event_HitNormal;                            // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                K2Node_Event_NormalImpulse;                        // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x003C(0x0080)(ConstParm, ContainsInstancedReference)
	struct FHitResult                             K2Node_ComponentBoundEvent_ImpactResult2;          // 0x00BC(0x0080)(ConstParm, ContainsInstancedReference)
	struct FHitResult                             K2Node_ComponentBoundEvent_ImpactResult;           // 0x013C(0x0080)(ConstParm, ContainsInstancedReference)
	struct FVector                                K2Node_ComponentBoundEvent_ImpactVelocity;         // 0x01BC(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1CA[0x2];                                      // 0x01CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x01D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x01DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x01E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x01F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x020C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0218(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0224(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit2;             // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap2;          // 0x0231(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_232[0x2];                                      // 0x0232(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time2;                     // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_Location2;                 // 0x0238(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint2;              // 0x0244(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_Normal2;                   // 0x0250(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal2;             // 0x025C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat2;                  // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BreakHitResult_HitActor2;                 // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent2;             // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   CallFunc_BreakHitResult_HitBoneName2;              // 0x0274(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_BreakHitResult_HitItem2;                  // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_TraceStart2;               // 0x0280(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd2;                 // 0x028C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ABuildingSMActor*                       K2Node_DynamicCast_AsBuilding_SMActor;             // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x029C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29D[0x3];                                      // 0x029D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Damage2;                              // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  K2Node_Event_DamageTags2;                          // 0x02A4(0x0018)(ConstParm)
	struct FVector                                K2Node_Event_Momentum2;                            // 0x02BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             K2Node_Event_HitInfo2;                             // 0x02C8(0x0080)(ConstParm, ContainsInstancedReference)
	class AController*                            K2Node_Event_InstigatedBy2;                        // 0x0348(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_Event_DamageCauser2;                        // 0x034C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext2;                       // 0x0350(0x000C)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x035C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x035D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35E[0x2];                                      // 0x035E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_Damage;                               // 0x0364(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  K2Node_Event_DamageTags;                           // 0x0368(0x0018)(ConstParm)
	struct FVector                                K2Node_Event_Momentum;                             // 0x0380(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             K2Node_Event_HitInfo;                              // 0x038C(0x0080)(ConstParm, ContainsInstancedReference)
	class AController*                            K2Node_Event_InstigatedBy;                         // 0x040C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x0410(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext;                        // 0x0414(0x000C)()
	bool                                          Temp_bool_Has_Been_Initd_Variable2;                // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable3;                // 0x0421(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable2;                      // 0x0422(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable3;                      // 0x0423(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0424(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue2;          // 0x0428(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue3;          // 0x042C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_Drop;                           // 0x0430(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_MeleeDrop;                      // 0x0431(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_432[0x2];                                      // 0x0432(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_DamageCauser2;                  // 0x0434(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable4;                      // 0x0438(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_439[0x3];                                      // 0x0439(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x043C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_449[0x3];                                      // 0x0449(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetInstigatorController_ReturnValue;      // 0x044C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AB_BGA_SploderPropaneTank_C*            K2Node_DynamicCast_AsB_BGA_Sploder_Propane_Tank;   // 0x0450(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0454(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_455[0x3];                                      // 0x0455(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0458(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable4;                // 0x045C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTags_ReturnValue;                      // 0x045D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEndPlayReason                                K2Node_CustomEvent_EndPlayReason;                  // 0x045E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortTeamAffiliation                          CallFunc_GetTeamAffiliationBetweenTeams_ReturnValue; // 0x045F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetHealth_ReturnValue;                    // 0x0460(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0464(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable5;                // 0x0465(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable5;                      // 0x0466(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_467[0x1];                                      // 0x0467(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0468(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x046C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortTeam                                     CallFunc_GetActorTeam_ReturnValue;                 // 0x0470(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_471[0x3];                                      // 0x0471(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_DamagedActor;                   // 0x0474(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_CustomEvent_Damage;                         // 0x0478(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AController*                            K2Node_CustomEvent_InstigatedBy;                   // 0x047C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_CustomEvent_DamageCauser;                   // 0x0480(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                K2Node_CustomEvent_HitLocation;                    // 0x0484(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    K2Node_CustomEvent_FHitComponent;                  // 0x0490(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   K2Node_CustomEvent_BoneName;                       // 0x0494(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                K2Node_CustomEvent_Momentum;                       // 0x049C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum)> K2Node_CreateDelegate_OutputDelegate;              // 0x04A8(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x04B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x04B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4BA[0x2];                                      // 0x04BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue2;               // 0x04BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue3;               // 0x04C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AController*                            CallFunc_GetInstigatorController_ReturnValue2;     // 0x04C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortTeam                                     CallFunc_GetActorTeam_ReturnValue2;                // 0x04C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C9[0x3];                                      // 0x04C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetCollisionProfileName_ReturnValue;      // 0x04CC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEventData                     K2Node_MakeStruct_GameplayEventData;               // 0x04D4(0x0058)()
	float                                         CallFunc_RandomFloatInRange_ReturnValue2;          // 0x052C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0530(0x0004)()
	class APawn*                                  CallFunc_GetInstigator_ReturnValue4;               // 0x0534(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0538(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortTeam                                     CallFunc_GetActorTeam_ReturnValue3;                // 0x0539(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable6;                // 0x053A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable6;                      // 0x053B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortTeam                                     CallFunc_GetActorTeam_ReturnValue4;                // 0x053C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x053D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortTeam                                     CallFunc_GetActorTeam_ReturnValue5;                // 0x053E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53F[0x1];                                      // 0x053F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EEndPlayReason EndPlayReason)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0540(0x0010)(ZeroConstructor, NoDestructor)
	EFortTeamAffiliation                          CallFunc_GetTeamAffiliationBetweenTeams_ReturnValue2; // 0x0550(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortTeamAffiliation                          CallFunc_GetTeamAffiliationBetweenTeams_ReturnValue3; // 0x0551(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortTeamAffiliation                          CallFunc_GetTeamAffiliationBetweenTeams_ReturnValue4; // 0x0552(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0553(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X;                            // 0x0554(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Y;                            // 0x0558(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Z;                            // 0x055C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0560(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue2;         // 0x0564(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0568(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue5;               // 0x0574(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue2;         // 0x0578(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0584(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X2;                           // 0x0590(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Y2;                           // 0x0594(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Z2;                           // 0x0598(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x059C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue2;                  // 0x05A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Conv_RotatorToVector_ReturnValue;         // 0x05B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x05C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X3;                           // 0x05CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Y3;                           // 0x05D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Z3;                           // 0x05D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x05D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue3;                  // 0x05E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Normal_ReturnValue2;                      // 0x05F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X4;                           // 0x05FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Y4;                           // 0x0600(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Z4;                           // 0x0604(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue2;                  // 0x0608(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue4;                  // 0x060C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Normal_ReturnValue3;                      // 0x0618(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0624(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue2;        // 0x0630(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_SelectVector_ReturnValue2;                // 0x063C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue3;        // 0x0648(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0654(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue6;               // 0x065C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x0660(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_661[0x3];                                      // 0x0661(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue;                // 0x0664(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue5;                     // 0x0668(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_669[0x3];                                      // 0x0669(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetValueAsObject_ReturnValue;             // 0x066C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue6;                     // 0x0670(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue2;     // 0x0671(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0672(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_673[0x1];                                      // 0x0673(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue7;               // 0x0674(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue2;             // 0x0678(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue7;                     // 0x0680(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_681[0x3];                                      // 0x0681(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue2;               // 0x0684(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue8;                     // 0x0688(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_689[0x3];                                      // 0x0689(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetValueAsObject_ReturnValue2;            // 0x068C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue3;     // 0x0690(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x0691(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank) == 0x000004, "Wrong alignment on B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank");
static_assert(sizeof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank) == 0x000694, "Wrong size on B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, EntryPoint) == 0x000000, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, Temp_bool_Has_Been_Initd_Variable) == 0x000004, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, Temp_bool_IsClosed_Variable) == 0x000005, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, CallFunc_IsDedicatedServer_ReturnValue) == 0x000006, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, K2Node_Event_MyComp) == 0x000008, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::K2Node_Event_MyComp' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, K2Node_Event_Other) == 0x00000C, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::K2Node_Event_Other' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, K2Node_Event_OtherComp) == 0x000010, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::K2Node_Event_OtherComp' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, K2Node_Event_bSelfMoved) == 0x000014, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::K2Node_Event_bSelfMoved' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, K2Node_Event_HitLocation) == 0x000018, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::K2Node_Event_HitLocation' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, K2Node_Event_HitNormal) == 0x000024, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::K2Node_Event_HitNormal' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, K2Node_Event_NormalImpulse) == 0x000030, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::K2Node_Event_NormalImpulse' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, K2Node_Event_Hit) == 0x00003C, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, K2Node_ComponentBoundEvent_ImpactResult2) == 0x0000BC, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::K2Node_ComponentBoundEvent_ImpactResult2' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, K2Node_ComponentBoundEvent_ImpactResult) == 0x00013C, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::K2Node_ComponentBoundEvent_ImpactResult' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, K2Node_ComponentBoundEvent_ImpactVelocity) == 0x0001BC, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::K2Node_ComponentBoundEvent_ImpactVelocity' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, CallFunc_BreakHitResult_bBlockingHit) == 0x0001C8, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, CallFunc_BreakHitResult_bInitialOverlap) == 0x0001C9, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, CallFunc_BreakHitResult_Time) == 0x0001CC, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, CallFunc_BreakHitResult_Location) == 0x0001D0, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, CallFunc_BreakHitResult_ImpactPoint) == 0x0001DC, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, CallFunc_BreakHitResult_Normal) == 0x0001E8, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, CallFunc_BreakHitResult_ImpactNormal) == 0x0001F4, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, CallFunc_BreakHitResult_PhysMat) == 0x000200, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, CallFunc_BreakHitResult_HitActor) == 0x000204, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, CallFunc_BreakHitResult_HitComponent) == 0x000208, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, CallFunc_BreakHitResult_HitBoneName) == 0x00020C, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, CallFunc_BreakHitResult_HitItem) == 0x000214, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, CallFunc_BreakHitResult_TraceStart) == 0x000218, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, CallFunc_BreakHitResult_TraceEnd) == 0x000224, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, CallFunc_BreakHitResult_bBlockingHit2) == 0x000230, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::CallFunc_BreakHitResult_bBlockingHit2' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, CallFunc_BreakHitResult_bInitialOverlap2) == 0x000231, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::CallFunc_BreakHitResult_bInitialOverlap2' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, CallFunc_BreakHitResult_Time2) == 0x000234, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::CallFunc_BreakHitResult_Time2' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, CallFunc_BreakHitResult_Location2) == 0x000238, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::CallFunc_BreakHitResult_Location2' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, CallFunc_BreakHitResult_ImpactPoint2) == 0x000244, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::CallFunc_BreakHitResult_ImpactPoint2' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, CallFunc_BreakHitResult_Normal2) == 0x000250, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::CallFunc_BreakHitResult_Normal2' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, CallFunc_BreakHitResult_ImpactNormal2) == 0x00025C, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::CallFunc_BreakHitResult_ImpactNormal2' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, CallFunc_BreakHitResult_PhysMat2) == 0x000268, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::CallFunc_BreakHitResult_PhysMat2' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, CallFunc_BreakHitResult_HitActor2) == 0x00026C, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::CallFunc_BreakHitResult_HitActor2' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, CallFunc_BreakHitResult_HitComponent2) == 0x000270, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::CallFunc_BreakHitResult_HitComponent2' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, CallFunc_BreakHitResult_HitBoneName2) == 0x000274, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::CallFunc_BreakHitResult_HitBoneName2' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, CallFunc_BreakHitResult_HitItem2) == 0x00027C, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::CallFunc_BreakHitResult_HitItem2' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, CallFunc_BreakHitResult_TraceStart2) == 0x000280, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::CallFunc_BreakHitResult_TraceStart2' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, CallFunc_BreakHitResult_TraceEnd2) == 0x00028C, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::CallFunc_BreakHitResult_TraceEnd2' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, K2Node_DynamicCast_AsBuilding_SMActor) == 0x000298, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::K2Node_DynamicCast_AsBuilding_SMActor' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, K2Node_DynamicCast_bSuccess) == 0x00029C, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, K2Node_Event_Damage2) == 0x0002A0, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::K2Node_Event_Damage2' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, K2Node_Event_DamageTags2) == 0x0002A4, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::K2Node_Event_DamageTags2' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, K2Node_Event_Momentum2) == 0x0002BC, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::K2Node_Event_Momentum2' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, K2Node_Event_HitInfo2) == 0x0002C8, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::K2Node_Event_HitInfo2' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, K2Node_Event_InstigatedBy2) == 0x000348, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::K2Node_Event_InstigatedBy2' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, K2Node_Event_DamageCauser2) == 0x00034C, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::K2Node_Event_DamageCauser2' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, K2Node_Event_EffectContext2) == 0x000350, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::K2Node_Event_EffectContext2' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, CallFunc_IsValid_ReturnValue) == 0x00035C, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, CallFunc_IsValid_ReturnValue2) == 0x00035D, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, CallFunc_K2_GetPawn_ReturnValue) == 0x000360, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, K2Node_Event_Damage) == 0x000364, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, K2Node_Event_DamageTags) == 0x000368, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::K2Node_Event_DamageTags' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, K2Node_Event_Momentum) == 0x000380, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::K2Node_Event_Momentum' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, K2Node_Event_HitInfo) == 0x00038C, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::K2Node_Event_HitInfo' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, K2Node_Event_InstigatedBy) == 0x00040C, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::K2Node_Event_InstigatedBy' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, K2Node_Event_DamageCauser) == 0x000410, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::K2Node_Event_DamageCauser' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, K2Node_Event_EffectContext) == 0x000414, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::K2Node_Event_EffectContext' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, Temp_bool_Has_Been_Initd_Variable2) == 0x000420, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::Temp_bool_Has_Been_Initd_Variable2' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, Temp_bool_Has_Been_Initd_Variable3) == 0x000421, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::Temp_bool_Has_Been_Initd_Variable3' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, Temp_bool_IsClosed_Variable2) == 0x000422, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::Temp_bool_IsClosed_Variable2' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, Temp_bool_IsClosed_Variable3) == 0x000423, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::Temp_bool_IsClosed_Variable3' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000424, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, CallFunc_SpawnSoundAttached_ReturnValue2) == 0x000428, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::CallFunc_SpawnSoundAttached_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, CallFunc_SpawnSoundAttached_ReturnValue3) == 0x00042C, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::CallFunc_SpawnSoundAttached_ReturnValue3' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, K2Node_CustomEvent_Drop) == 0x000430, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::K2Node_CustomEvent_Drop' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, K2Node_CustomEvent_MeleeDrop) == 0x000431, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::K2Node_CustomEvent_MeleeDrop' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, K2Node_CustomEvent_DamageCauser2) == 0x000434, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::K2Node_CustomEvent_DamageCauser2' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, Temp_bool_IsClosed_Variable4) == 0x000438, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::Temp_bool_IsClosed_Variable4' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00043C, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, CallFunc_Not_PreBool_ReturnValue) == 0x000448, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, CallFunc_GetInstigatorController_ReturnValue) == 0x00044C, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::CallFunc_GetInstigatorController_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, K2Node_DynamicCast_AsB_BGA_Sploder_Propane_Tank) == 0x000450, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::K2Node_DynamicCast_AsB_BGA_Sploder_Propane_Tank' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, K2Node_DynamicCast_bSuccess2) == 0x000454, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, CallFunc_RandomFloatInRange_ReturnValue) == 0x000458, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, Temp_bool_Has_Been_Initd_Variable4) == 0x00045C, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::Temp_bool_Has_Been_Initd_Variable4' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, CallFunc_HasTags_ReturnValue) == 0x00045D, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::CallFunc_HasTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, K2Node_CustomEvent_EndPlayReason) == 0x00045E, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::K2Node_CustomEvent_EndPlayReason' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, CallFunc_GetTeamAffiliationBetweenTeams_ReturnValue) == 0x00045F, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::CallFunc_GetTeamAffiliationBetweenTeams_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, CallFunc_GetHealth_ReturnValue) == 0x000460, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::CallFunc_GetHealth_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000464, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, Temp_bool_Has_Been_Initd_Variable5) == 0x000465, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::Temp_bool_Has_Been_Initd_Variable5' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, Temp_bool_IsClosed_Variable5) == 0x000466, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::Temp_bool_IsClosed_Variable5' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, CallFunc_SelectFloat_ReturnValue) == 0x000468, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, CallFunc_GetInstigator_ReturnValue) == 0x00046C, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, CallFunc_GetActorTeam_ReturnValue) == 0x000470, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::CallFunc_GetActorTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, K2Node_CustomEvent_DamagedActor) == 0x000474, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::K2Node_CustomEvent_DamagedActor' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, K2Node_CustomEvent_Damage) == 0x000478, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::K2Node_CustomEvent_Damage' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, K2Node_CustomEvent_InstigatedBy) == 0x00047C, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::K2Node_CustomEvent_InstigatedBy' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, K2Node_CustomEvent_DamageCauser) == 0x000480, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::K2Node_CustomEvent_DamageCauser' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, K2Node_CustomEvent_HitLocation) == 0x000484, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::K2Node_CustomEvent_HitLocation' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, K2Node_CustomEvent_FHitComponent) == 0x000490, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::K2Node_CustomEvent_FHitComponent' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, K2Node_CustomEvent_BoneName) == 0x000494, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::K2Node_CustomEvent_BoneName' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, K2Node_CustomEvent_Momentum) == 0x00049C, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::K2Node_CustomEvent_Momentum' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, K2Node_CreateDelegate_OutputDelegate) == 0x0004A8, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x0004B8, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, CallFunc_BooleanOR_ReturnValue) == 0x0004B9, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank, CallFunc_GetInstigator_ReturnValue2) == 0x0004BC, "Member 'B_BGA_SploderPropaneTank_C_ExecuteUbergraph_B_BGA_SploderPropaneTank::CallFunc_GetInstigator_ReturnValue2' has a wrong offset!");
