#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_BGA_TrashmanBagSkull

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function B_BGA_TrashmanBagSkull.B_BGA_TrashmanBagSkull_C.ExecuteUbergraph_B_BGA_TrashmanBagSkull
// 0x09BC (0x09BC - 0x0000)
struct B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AController*                            CallFunc_GetInstigatorController_ReturnValue;      // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor3;            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp3;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex3;        // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep2;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult2;           // 0x001C(0x0080)(ConstParm, ContainsInstancedReference)
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x00A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor2;            // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp2;             // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex2;        // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X;                            // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Y;                            // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Z;                            // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn2;                   // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x00CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x00CE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CF[0x1];                                       // 0x00CF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x00E0(0x0080)(ConstParm, ContainsInstancedReference)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x3];                                      // 0x0161(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn3;                   // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x3];                                      // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetVelocity_ReturnValue2;                 // 0x016C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X2;                           // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Y2;                           // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Z2;                           // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_RandomFloat_ReturnValue;                  // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0190(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RandomBool_ReturnValue;                   // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A2[0x2];                                      // 0x01A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue;              // 0x01A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x01B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B5[0x3];                                      // 0x01B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue2;          // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C1[0x3];                                      // 0x01C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C9[0x3];                                      // 0x01C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_AddLocalOffset_SweepHitResult;         // 0x01D0(0x0080)(ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_AddLocalRotation_SweepHitResult;       // 0x0250(0x0080)(ContainsInstancedReference)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue3;          // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue4;          // 0x02D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_RandomFloatInRange_ReturnValue2;          // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x02DC(0x0004)()
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue2;                 // 0x02E0(0x0004)()
	float                                         CallFunc_RandomFloatInRange_ReturnValue3;          // 0x02E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue3;                 // 0x02E8(0x0004)()
	bool                                          CallFunc_K2_IsTimerActive_ReturnValue;             // 0x02EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2ED[0x3];                                      // 0x02ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_DeltaSeconds;                   // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                K2Node_CustomEvent_OldLocation;                    // 0x02F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                K2Node_CustomEvent_OldVelocity;                    // 0x0300(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x030C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue5;          // 0x0314(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_319[0x3];                                      // 0x0319(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue6;          // 0x031C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue7;          // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEventData                     K2Node_MakeStruct_GameplayEventData;               // 0x0324(0x0058)()
	struct FGameplayEventData                     K2Node_MakeStruct_GameplayEventData2;              // 0x037C(0x0058)()
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x03D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D5[0x3];                                      // 0x03D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetVelocity_ReturnValue3;                 // 0x03D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x03E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X3;                           // 0x03F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Y3;                           // 0x03F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Z3;                           // 0x03F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue2;          // 0x03FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3FD[0x3];                                      // 0x03FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Damage;                               // 0x0400(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  K2Node_Event_DamageTags;                           // 0x0404(0x0018)(ConstParm)
	struct FVector                                K2Node_Event_Momentum;                             // 0x041C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             K2Node_Event_HitInfo;                              // 0x0428(0x0080)(ConstParm, ContainsInstancedReference)
	class AController*                            K2Node_Event_InstigatedBy;                         // 0x04A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x04AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext;                        // 0x04B0(0x000C)()
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x04BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTags_ReturnValue;                      // 0x04C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C1[0x3];                                      // 0x04C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x04C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x04D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x04DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x04E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x04E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue2;         // 0x04E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x04EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FString                                 CallFunc_BuildString_Float_ReturnValue;            // 0x04F8(0x000C)(ZeroConstructor)
	struct FVector                                CallFunc_Conv_RotatorToVector_ReturnValue;         // 0x0504(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_RandomFloatInRange_ReturnValue4;          // 0x0510(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X4;                           // 0x0514(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Y4;                           // 0x0518(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Z4;                           // 0x051C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue2;                  // 0x0520(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x052C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0538(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x053C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_SelectFloat_ReturnValue2;                 // 0x0548(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue2;         // 0x054C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue2;           // 0x0558(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_559[0x3];                                      // 0x0559(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_RotatorToVector_ReturnValue2;        // 0x055C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X5;                           // 0x0568(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Y5;                           // 0x056C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Z5;                           // 0x0570(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue3;                  // 0x0574(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(float DeltaSeconds, const struct FVector& OldLocation, const struct FVector& OldVelocity)> K2Node_CreateDelegate_OutputDelegate;              // 0x0580(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_Normal_ReturnValue2;                      // 0x0590(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X6;                           // 0x059C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Y6;                           // 0x05A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Z6;                           // 0x05A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue4;                  // 0x05A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_MakeLiteralFloat_ReturnValue;             // 0x05B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Normal_ReturnValue3;                      // 0x05B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue2;        // 0x05C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue3;        // 0x05D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue2;         // 0x05DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x05E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_MakeLiteralFloat_ReturnValue2;            // 0x05F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue3;         // 0x05F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue4;         // 0x0604(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_MakeLiteralFloat_ReturnValue3;            // 0x0610(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X7;                           // 0x0614(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Y7;                           // 0x0618(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Z7;                           // 0x061C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue3;         // 0x0620(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue5;         // 0x062C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll2;                       // 0x0638(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Pitch2;                      // 0x063C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Yaw2;                        // 0x0640(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0644(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue2;                 // 0x0648(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0654(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Conv_RotatorToVector_ReturnValue3;        // 0x0660(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X8;                           // 0x066C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Y8;                           // 0x0670(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Z8;                           // 0x0674(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue4;        // 0x0678(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue5;                  // 0x0684(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue2;            // 0x0690(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x069C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue3;                 // 0x06A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue4;                 // 0x06AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Conv_RotatorToVector_ReturnValue4;        // 0x06B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Conv_RotatorToVector_ReturnValue5;        // 0x06C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue5;        // 0x06D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue6;        // 0x06DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue3;            // 0x06E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue4;            // 0x06F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue6;         // 0x0700(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Lerp_ReturnValue2;                        // 0x070C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0710(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue4;                 // 0x0714(0x0004)()
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0718(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_719[0x3];                                      // 0x0719(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue7;         // 0x071C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue2;     // 0x0728(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X9;                           // 0x0734(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Y9;                           // 0x0738(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Z9;                           // 0x073C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X10;                          // 0x0740(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Y10;                          // 0x0744(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Z10;                          // 0x0748(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue3;          // 0x074C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_74D[0x3];                                      // 0x074D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue2;                  // 0x0750(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue7;        // 0x0754(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0760(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_Contains_ReturnValue2;              // 0x0761(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_762[0x2];                                      // 0x0762(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue8;         // 0x0764(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue3;     // 0x0770(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X11;                          // 0x077C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Y11;                          // 0x0780(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Z11;                          // 0x0784(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X12;                          // 0x0788(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Y12;                          // 0x078C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Z12;                          // 0x0790(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Add_FloatFloat_ReturnValue2;              // 0x0794(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             K2Node_ComponentBoundEvent_ImpactResult;           // 0x0798(0x0080)(ConstParm, ContainsInstancedReference)
	struct FVector                                K2Node_ComponentBoundEvent_ImpactVelocity;         // 0x0818(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue2;             // 0x0824(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_825[0x3];                                      // 0x0825(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue2;         // 0x0828(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue4;          // 0x082C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x082D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable2;                // 0x082E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable2;                      // 0x082F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue9;         // 0x0830(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue4;     // 0x083C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_VSize_ReturnValue2;                       // 0x0848(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetComponentVelocity_ReturnValue;         // 0x084C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetMaxSpeed_ReturnValue;                  // 0x0858(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue10;        // 0x085C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetComponentVelocity_ReturnValue2;        // 0x0868(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_VSize_ReturnValue3;                       // 0x0874(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue5;     // 0x0878(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue3;         // 0x0884(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0888(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_VSize_ReturnValue4;                       // 0x0894(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0898(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue8;        // 0x089C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue5;            // 0x08A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue2;       // 0x08B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X13;                          // 0x08C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Y13;                          // 0x08C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Z13;                          // 0x08C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_VSize_ReturnValue5;                       // 0x08CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue6;                  // 0x08D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Divide_VectorFloat_ReturnValue;           // 0x08DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue9;        // 0x08E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X14;                          // 0x08F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Y14;                          // 0x08F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Z14;                          // 0x08FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue7;                  // 0x0900(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue3;       // 0x090C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Normal_ReturnValue4;                      // 0x0918(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X15;                          // 0x0924(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Y15;                          // 0x0928(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Z15;                          // 0x092C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue10;       // 0x0930(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue8;                  // 0x093C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue6;            // 0x0948(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0954(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll3;                       // 0x0960(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Pitch3;                      // 0x0964(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Yaw3;                        // 0x0968(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FString                                 CallFunc_BuildString_Float_ReturnValue2;           // 0x096C(0x000C)(ZeroConstructor)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue4;         // 0x0978(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FString                                 CallFunc_BuildString_Float_ReturnValue3;           // 0x097C(0x000C)(ZeroConstructor)
	float                                         CallFunc_ClampAngle_ReturnValue;                   // 0x0988(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue2;             // 0x098C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FString                                 CallFunc_BuildString_Float_ReturnValue4;           // 0x0998(0x000C)(ZeroConstructor)
	float                                         CallFunc_BreakVector_X16;                          // 0x09A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Y16;                          // 0x09A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Z16;                          // 0x09AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue9;                  // 0x09B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull) == 0x000004, "Wrong alignment on B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull");
static_assert(sizeof(B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull) == 0x0009BC, "Wrong size on B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull");
static_assert(offsetof(B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull, EntryPoint) == 0x000000, "Member 'B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull, CallFunc_GetInstigator_ReturnValue) == 0x000004, "Member 'B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull, CallFunc_GetInstigatorController_ReturnValue) == 0x000008, "Member 'B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull::CallFunc_GetInstigatorController_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull, K2Node_ComponentBoundEvent_OtherActor3) == 0x00000C, "Member 'B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull::K2Node_ComponentBoundEvent_OtherActor3' has a wrong offset!");
static_assert(offsetof(B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull, K2Node_ComponentBoundEvent_OtherComp3) == 0x000010, "Member 'B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull::K2Node_ComponentBoundEvent_OtherComp3' has a wrong offset!");
static_assert(offsetof(B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull, K2Node_ComponentBoundEvent_OtherBodyIndex3) == 0x000014, "Member 'B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull::K2Node_ComponentBoundEvent_OtherBodyIndex3' has a wrong offset!");
static_assert(offsetof(B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull, K2Node_ComponentBoundEvent_bFromSweep2) == 0x000018, "Member 'B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull::K2Node_ComponentBoundEvent_bFromSweep2' has a wrong offset!");
static_assert(offsetof(B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull, K2Node_ComponentBoundEvent_SweepResult2) == 0x00001C, "Member 'B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull::K2Node_ComponentBoundEvent_SweepResult2' has a wrong offset!");
static_assert(offsetof(B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull, K2Node_DynamicCast_AsFort_Pawn) == 0x00009C, "Member 'B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull::K2Node_DynamicCast_AsFort_Pawn' has a wrong offset!");
static_assert(offsetof(B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull, K2Node_DynamicCast_bSuccess) == 0x0000A0, "Member 'B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull, CallFunc_GetVelocity_ReturnValue) == 0x0000A4, "Member 'B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull, K2Node_ComponentBoundEvent_OtherActor2) == 0x0000B0, "Member 'B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull::K2Node_ComponentBoundEvent_OtherActor2' has a wrong offset!");
static_assert(offsetof(B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull, K2Node_ComponentBoundEvent_OtherComp2) == 0x0000B4, "Member 'B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull::K2Node_ComponentBoundEvent_OtherComp2' has a wrong offset!");
static_assert(offsetof(B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull, K2Node_ComponentBoundEvent_OtherBodyIndex2) == 0x0000B8, "Member 'B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull::K2Node_ComponentBoundEvent_OtherBodyIndex2' has a wrong offset!");
static_assert(offsetof(B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull, CallFunc_BreakVector_X) == 0x0000BC, "Member 'B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull, CallFunc_BreakVector_Y) == 0x0000C0, "Member 'B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull, CallFunc_BreakVector_Z) == 0x0000C4, "Member 'B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull, K2Node_DynamicCast_AsFort_Pawn2) == 0x0000C8, "Member 'B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull::K2Node_DynamicCast_AsFort_Pawn2' has a wrong offset!");
static_assert(offsetof(B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull, K2Node_DynamicCast_bSuccess2) == 0x0000CC, "Member 'B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull, CallFunc_Less_FloatFloat_ReturnValue) == 0x0000CD, "Member 'B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0000CE, "Member 'B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull, K2Node_ComponentBoundEvent_OtherActor) == 0x0000D0, "Member 'B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull, K2Node_ComponentBoundEvent_OtherComp) == 0x0000D4, "Member 'B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x0000D8, "Member 'B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull, K2Node_ComponentBoundEvent_bFromSweep) == 0x0000DC, "Member 'B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull, K2Node_ComponentBoundEvent_SweepResult) == 0x0000E0, "Member 'B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull, CallFunc_BooleanAND_ReturnValue) == 0x000160, "Member 'B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull, K2Node_DynamicCast_AsFort_Pawn3) == 0x000164, "Member 'B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull::K2Node_DynamicCast_AsFort_Pawn3' has a wrong offset!");
static_assert(offsetof(B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull, K2Node_DynamicCast_bSuccess3) == 0x000168, "Member 'B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull, CallFunc_GetVelocity_ReturnValue2) == 0x00016C, "Member 'B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull::CallFunc_GetVelocity_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull, CallFunc_BreakVector_X2) == 0x000178, "Member 'B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull::CallFunc_BreakVector_X2' has a wrong offset!");
static_assert(offsetof(B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull, CallFunc_BreakVector_Y2) == 0x00017C, "Member 'B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull::CallFunc_BreakVector_Y2' has a wrong offset!");
static_assert(offsetof(B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull, CallFunc_BreakVector_Z2) == 0x000180, "Member 'B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull::CallFunc_BreakVector_Z2' has a wrong offset!");
static_assert(offsetof(B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull, CallFunc_RandomFloat_ReturnValue) == 0x000184, "Member 'B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull::CallFunc_RandomFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull, CallFunc_Lerp_ReturnValue) == 0x000188, "Member 'B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull, CallFunc_RandomFloatInRange_ReturnValue) == 0x00018C, "Member 'B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull, CallFunc_MakeVector_ReturnValue) == 0x000190, "Member 'B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00019C, "Member 'B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull, CallFunc_RandomBool_ReturnValue) == 0x0001A0, "Member 'B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull::CallFunc_RandomBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull, Temp_bool_Has_Been_Initd_Variable) == 0x0001A1, "Member 'B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull, CallFunc_SelectFloat_ReturnValue) == 0x0001A4, "Member 'B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull, CallFunc_RotateAngleAxis_ReturnValue) == 0x0001A8, "Member 'B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull::CallFunc_RotateAngleAxis_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull, Temp_bool_IsClosed_Variable) == 0x0001B4, "Member 'B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull, CallFunc_SpawnSoundAttached_ReturnValue) == 0x0001B8, "Member 'B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull, CallFunc_SpawnSoundAttached_ReturnValue2) == 0x0001BC, "Member 'B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull::CallFunc_SpawnSoundAttached_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull, CallFunc_IsDedicatedServer_ReturnValue) == 0x0001C0, "Member 'B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull, CallFunc_Array_Length_ReturnValue) == 0x0001C4, "Member 'B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull, CallFunc_Greater_IntInt_ReturnValue) == 0x0001C8, "Member 'B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x0001CC, "Member 'B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull, CallFunc_K2_AddLocalOffset_SweepHitResult) == 0x0001D0, "Member 'B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull::CallFunc_K2_AddLocalOffset_SweepHitResult' has a wrong offset!");
static_assert(offsetof(B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull, CallFunc_K2_AddLocalRotation_SweepHitResult) == 0x000250, "Member 'B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull::CallFunc_K2_AddLocalRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull, CallFunc_SpawnSoundAttached_ReturnValue3) == 0x0002D0, "Member 'B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull::CallFunc_SpawnSoundAttached_ReturnValue3' has a wrong offset!");
static_assert(offsetof(B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull, CallFunc_SpawnSoundAttached_ReturnValue4) == 0x0002D4, "Member 'B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull::CallFunc_SpawnSoundAttached_ReturnValue4' has a wrong offset!");
static_assert(offsetof(B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull, CallFunc_RandomFloatInRange_ReturnValue2) == 0x0002D8, "Member 'B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull::CallFunc_RandomFloatInRange_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull, CallFunc_K2_SetTimer_ReturnValue) == 0x0002DC, "Member 'B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull, CallFunc_K2_SetTimer_ReturnValue2) == 0x0002E0, "Member 'B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull::CallFunc_K2_SetTimer_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull, CallFunc_RandomFloatInRange_ReturnValue3) == 0x0002E4, "Member 'B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull::CallFunc_RandomFloatInRange_ReturnValue3' has a wrong offset!");
static_assert(offsetof(B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull, CallFunc_K2_SetTimer_ReturnValue3) == 0x0002E8, "Member 'B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull::CallFunc_K2_SetTimer_ReturnValue3' has a wrong offset!");
static_assert(offsetof(B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull, CallFunc_K2_IsTimerActive_ReturnValue) == 0x0002EC, "Member 'B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull::CallFunc_K2_IsTimerActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull, K2Node_CustomEvent_DeltaSeconds) == 0x0002F0, "Member 'B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull::K2Node_CustomEvent_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull, K2Node_CustomEvent_OldLocation) == 0x0002F4, "Member 'B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull::K2Node_CustomEvent_OldLocation' has a wrong offset!");
static_assert(offsetof(B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull, K2Node_CustomEvent_OldVelocity) == 0x000300, "Member 'B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull::K2Node_CustomEvent_OldVelocity' has a wrong offset!");
static_assert(offsetof(B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull, CallFunc_RandomIntegerInRange_ReturnValue) == 0x00030C, "Member 'B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull, CallFunc_Add_IntInt_ReturnValue) == 0x000310, "Member 'B_BGA_TrashmanBagSkull_C_ExecuteUbergraph_B_BGA_TrashmanBagSkull::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
