#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_BGA_SentryGun

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function B_BGA_SentryGun.B_BGA_SentryGun_C.ExecuteUbergraph_B_BGA_SentryGun
// 0x05E4 (0x05E4 - 0x0000)
struct B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue2;                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EGameplayCueEvent                             K2Node_GameplayCueEvent_EventType2;                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 K2Node_GameplayCueEvent_Parameters2;               // 0x0008(0x0084)()
	float                                         K2Node_Event_DeltaSeconds;                         // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_EffectContextGetHitResult_ReturnValue;    // 0x0094(0x0080)(ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0115(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_116[0x2];                                      // 0x0116(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x011C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0128(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0134(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0140(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0164(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0170(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x017C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EGameplayCueEvent                             K2Node_GameplayCueEvent_EventType;                 // 0x017D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17E[0x2];                                      // 0x017E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 K2Node_GameplayCueEvent_Parameters;                // 0x0180(0x0084)()
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x0204(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_205[0x3];                                      // 0x0205(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Damage2;                              // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  K2Node_Event_DamageTags2;                          // 0x020C(0x0018)(ConstParm)
	struct FVector                                K2Node_Event_Momentum2;                            // 0x0224(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             K2Node_Event_HitInfo2;                             // 0x0230(0x0080)(ConstParm, ContainsInstancedReference)
	class AFortPawn*                              K2Node_Event_InstigatedBy2;                        // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_Event_DamageCauser2;                        // 0x02B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext2;                       // 0x02B8(0x000C)()
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x02C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_Damage;                               // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  K2Node_Event_DamageTags;                           // 0x02D4(0x0018)(ConstParm)
	struct FVector                                K2Node_Event_Momentum;                             // 0x02EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             K2Node_Event_HitInfo;                              // 0x02F8(0x0080)(ConstParm, ContainsInstancedReference)
	class AController*                            K2Node_Event_InstigatedBy;                         // 0x0378(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x037C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext;                        // 0x0380(0x000C)()
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x038C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_38D[0x3];                                      // 0x038D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor2;            // 0x0394(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp2;             // 0x0398(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex2;        // 0x039C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A1[0x3];                                      // 0x03A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x03A4(0x0080)(ConstParm, ContainsInstancedReference)
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x0424(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0428(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_429[0x3];                                      // 0x0429(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x042C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0430(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0434(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn2;                   // 0x0438(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x043C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43D[0x3];                                      // 0x043D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0440(0x000C)(ConstParm, ZeroConstructor, ReferenceParm)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue2;         // 0x044C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue3;         // 0x0458(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0464(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortBuildingInitializationReason             K2Node_Event_InitializationReason;                 // 0x0470(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortBuildingPersistentState                  K2Node_Event_BuildingPersistentState;              // 0x0471(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_472[0x2];                                      // 0x0472(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_LineTraceSingle_NEW_OutHit;               // 0x0474(0x0080)(ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_NEW_ReturnValue;          // 0x04F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit2;             // 0x04F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap2;          // 0x04F6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F7[0x1];                                      // 0x04F7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time2;                     // 0x04F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_Location2;                 // 0x04FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint2;              // 0x0508(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_Normal2;                   // 0x0514(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal2;             // 0x0520(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat2;                  // 0x052C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BreakHitResult_HitActor2;                 // 0x0530(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent2;             // 0x0534(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   CallFunc_BreakHitResult_HitBoneName2;              // 0x0538(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_BreakHitResult_HitItem2;                  // 0x0540(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_TraceStart2;               // 0x0544(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd2;                 // 0x0550(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x055C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55D[0x3];                                      // 0x055D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0560(0x0080)(ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x05E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun) == 0x000004, "Wrong alignment on B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun");
static_assert(sizeof(B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun) == 0x0005E4, "Wrong size on B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun");
static_assert(offsetof(B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun, EntryPoint) == 0x000000, "Member 'B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun, CallFunc_HasAuthority_ReturnValue2) == 0x000005, "Member 'B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun::CallFunc_HasAuthority_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun, K2Node_GameplayCueEvent_EventType2) == 0x000006, "Member 'B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun::K2Node_GameplayCueEvent_EventType2' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun, K2Node_GameplayCueEvent_Parameters2) == 0x000008, "Member 'B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun::K2Node_GameplayCueEvent_Parameters2' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun, K2Node_Event_DeltaSeconds) == 0x00008C, "Member 'B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun, K2Node_SwitchEnum_CmpSuccess) == 0x000090, "Member 'B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun, CallFunc_EffectContextGetHitResult_ReturnValue) == 0x000094, "Member 'B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun::CallFunc_EffectContextGetHitResult_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun, CallFunc_BreakHitResult_bBlockingHit) == 0x000114, "Member 'B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun, CallFunc_BreakHitResult_bInitialOverlap) == 0x000115, "Member 'B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun, CallFunc_BreakHitResult_Time) == 0x000118, "Member 'B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun, CallFunc_BreakHitResult_Location) == 0x00011C, "Member 'B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun, CallFunc_BreakHitResult_ImpactPoint) == 0x000128, "Member 'B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun, CallFunc_BreakHitResult_Normal) == 0x000134, "Member 'B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun, CallFunc_BreakHitResult_ImpactNormal) == 0x000140, "Member 'B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun, CallFunc_BreakHitResult_PhysMat) == 0x00014C, "Member 'B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun, CallFunc_BreakHitResult_HitActor) == 0x000150, "Member 'B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun, CallFunc_BreakHitResult_HitComponent) == 0x000154, "Member 'B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun, CallFunc_BreakHitResult_HitBoneName) == 0x000158, "Member 'B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun, CallFunc_BreakHitResult_HitItem) == 0x000160, "Member 'B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun, CallFunc_BreakHitResult_TraceStart) == 0x000164, "Member 'B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun, CallFunc_BreakHitResult_TraceEnd) == 0x000170, "Member 'B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun, CallFunc_IsValid_ReturnValue) == 0x00017C, "Member 'B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun, K2Node_GameplayCueEvent_EventType) == 0x00017D, "Member 'B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun::K2Node_GameplayCueEvent_EventType' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun, K2Node_GameplayCueEvent_Parameters) == 0x000180, "Member 'B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun::K2Node_GameplayCueEvent_Parameters' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun, K2Node_SwitchEnum2_CmpSuccess) == 0x000204, "Member 'B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun::K2Node_SwitchEnum2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun, K2Node_Event_Damage2) == 0x000208, "Member 'B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun::K2Node_Event_Damage2' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun, K2Node_Event_DamageTags2) == 0x00020C, "Member 'B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun::K2Node_Event_DamageTags2' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun, K2Node_Event_Momentum2) == 0x000224, "Member 'B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun::K2Node_Event_Momentum2' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun, K2Node_Event_HitInfo2) == 0x000230, "Member 'B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun::K2Node_Event_HitInfo2' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun, K2Node_Event_InstigatedBy2) == 0x0002B0, "Member 'B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun::K2Node_Event_InstigatedBy2' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun, K2Node_Event_DamageCauser2) == 0x0002B4, "Member 'B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun::K2Node_Event_DamageCauser2' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun, K2Node_Event_EffectContext2) == 0x0002B8, "Member 'B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun::K2Node_Event_EffectContext2' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0002C4, "Member 'B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun, K2Node_Event_Damage) == 0x0002D0, "Member 'B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun, K2Node_Event_DamageTags) == 0x0002D4, "Member 'B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun::K2Node_Event_DamageTags' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun, K2Node_Event_Momentum) == 0x0002EC, "Member 'B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun::K2Node_Event_Momentum' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun, K2Node_Event_HitInfo) == 0x0002F8, "Member 'B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun::K2Node_Event_HitInfo' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun, K2Node_Event_InstigatedBy) == 0x000378, "Member 'B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun::K2Node_Event_InstigatedBy' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun, K2Node_Event_DamageCauser) == 0x00037C, "Member 'B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun::K2Node_Event_DamageCauser' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun, K2Node_Event_EffectContext) == 0x000380, "Member 'B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun::K2Node_Event_EffectContext' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun, CallFunc_IsValid_ReturnValue2) == 0x00038C, "Member 'B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000390, "Member 'B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun, K2Node_ComponentBoundEvent_OtherActor2) == 0x000394, "Member 'B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun::K2Node_ComponentBoundEvent_OtherActor2' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun, K2Node_ComponentBoundEvent_OtherComp2) == 0x000398, "Member 'B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun::K2Node_ComponentBoundEvent_OtherComp2' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun, K2Node_ComponentBoundEvent_OtherBodyIndex2) == 0x00039C, "Member 'B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun::K2Node_ComponentBoundEvent_OtherBodyIndex2' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun, K2Node_ComponentBoundEvent_bFromSweep) == 0x0003A0, "Member 'B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun, K2Node_ComponentBoundEvent_SweepResult) == 0x0003A4, "Member 'B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun, K2Node_DynamicCast_AsFort_Pawn) == 0x000424, "Member 'B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun::K2Node_DynamicCast_AsFort_Pawn' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun, K2Node_DynamicCast_bSuccess) == 0x000428, "Member 'B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun, K2Node_ComponentBoundEvent_OtherActor) == 0x00042C, "Member 'B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun, K2Node_ComponentBoundEvent_OtherComp) == 0x000430, "Member 'B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000434, "Member 'B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun, K2Node_DynamicCast_AsFort_Pawn2) == 0x000438, "Member 'B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun::K2Node_DynamicCast_AsFort_Pawn2' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun, K2Node_DynamicCast_bSuccess2) == 0x00043C, "Member 'B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun, Temp_object_Variable) == 0x000440, "Member 'B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun, CallFunc_K2_GetActorLocation_ReturnValue2) == 0x00044C, "Member 'B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun::CallFunc_K2_GetActorLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun, CallFunc_K2_GetActorLocation_ReturnValue3) == 0x000458, "Member 'B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun::CallFunc_K2_GetActorLocation_ReturnValue3' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000464, "Member 'B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun, K2Node_Event_InitializationReason) == 0x000470, "Member 'B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun::K2Node_Event_InitializationReason' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun, K2Node_Event_BuildingPersistentState) == 0x000471, "Member 'B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun::K2Node_Event_BuildingPersistentState' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun, CallFunc_LineTraceSingle_NEW_OutHit) == 0x000474, "Member 'B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun::CallFunc_LineTraceSingle_NEW_OutHit' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun, CallFunc_LineTraceSingle_NEW_ReturnValue) == 0x0004F4, "Member 'B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun::CallFunc_LineTraceSingle_NEW_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun, CallFunc_BreakHitResult_bBlockingHit2) == 0x0004F5, "Member 'B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun::CallFunc_BreakHitResult_bBlockingHit2' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun, CallFunc_BreakHitResult_bInitialOverlap2) == 0x0004F6, "Member 'B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun::CallFunc_BreakHitResult_bInitialOverlap2' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun, CallFunc_BreakHitResult_Time2) == 0x0004F8, "Member 'B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun::CallFunc_BreakHitResult_Time2' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun, CallFunc_BreakHitResult_Location2) == 0x0004FC, "Member 'B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun::CallFunc_BreakHitResult_Location2' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun, CallFunc_BreakHitResult_ImpactPoint2) == 0x000508, "Member 'B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun::CallFunc_BreakHitResult_ImpactPoint2' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun, CallFunc_BreakHitResult_Normal2) == 0x000514, "Member 'B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun::CallFunc_BreakHitResult_Normal2' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun, CallFunc_BreakHitResult_ImpactNormal2) == 0x000520, "Member 'B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun::CallFunc_BreakHitResult_ImpactNormal2' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun, CallFunc_BreakHitResult_PhysMat2) == 0x00052C, "Member 'B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun::CallFunc_BreakHitResult_PhysMat2' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun, CallFunc_BreakHitResult_HitActor2) == 0x000530, "Member 'B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun::CallFunc_BreakHitResult_HitActor2' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun, CallFunc_BreakHitResult_HitComponent2) == 0x000534, "Member 'B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun::CallFunc_BreakHitResult_HitComponent2' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun, CallFunc_BreakHitResult_HitBoneName2) == 0x000538, "Member 'B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun::CallFunc_BreakHitResult_HitBoneName2' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun, CallFunc_BreakHitResult_HitItem2) == 0x000540, "Member 'B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun::CallFunc_BreakHitResult_HitItem2' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun, CallFunc_BreakHitResult_TraceStart2) == 0x000544, "Member 'B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun::CallFunc_BreakHitResult_TraceStart2' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun, CallFunc_BreakHitResult_TraceEnd2) == 0x000550, "Member 'B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun::CallFunc_BreakHitResult_TraceEnd2' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x00055C, "Member 'B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000560, "Member 'B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun, CallFunc_K2_SetActorLocation_ReturnValue) == 0x0005E0, "Member 'B_BGA_SentryGun_C_ExecuteUbergraph_B_BGA_SentryGun::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");

// Function B_BGA_SentryGun.B_BGA_SentryGun_C.OnBuildingActorInitialized
// 0x0002 (0x0002 - 0x0000)
struct B_BGA_SentryGun_C_OnBuildingActorInitialized final
{
public:
	EFortBuildingInitializationReason             InitializationReason;                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortBuildingPersistentState                  BuildingPersistentState;                           // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_BGA_SentryGun_C_OnBuildingActorInitialized) == 0x000001, "Wrong alignment on B_BGA_SentryGun_C_OnBuildingActorInitialized");
static_assert(sizeof(B_BGA_SentryGun_C_OnBuildingActorInitialized) == 0x000002, "Wrong size on B_BGA_SentryGun_C_OnBuildingActorInitialized");
static_assert(offsetof(B_BGA_SentryGun_C_OnBuildingActorInitialized, InitializationReason) == 0x000000, "Member 'B_BGA_SentryGun_C_OnBuildingActorInitialized::InitializationReason' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_OnBuildingActorInitialized, BuildingPersistentState) == 0x000001, "Member 'B_BGA_SentryGun_C_OnBuildingActorInitialized::BuildingPersistentState' has a wrong offset!");

// Function B_BGA_SentryGun.B_BGA_SentryGun_C.BndEvt__SightRadiusSphereComponent_K2Node_ComponentBoundEvent_275_ComponentEndOverlapSignature__DelegateSignature
// 0x000C (0x000C - 0x0000)
struct B_BGA_SentryGun_C_BndEvt__SightRadiusSphereComponent_K2Node_ComponentBoundEvent_275_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         OtherBodyIndex;                                    // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_BGA_SentryGun_C_BndEvt__SightRadiusSphereComponent_K2Node_ComponentBoundEvent_275_ComponentEndOverlapSignature__DelegateSignature) == 0x000004, "Wrong alignment on B_BGA_SentryGun_C_BndEvt__SightRadiusSphereComponent_K2Node_ComponentBoundEvent_275_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(B_BGA_SentryGun_C_BndEvt__SightRadiusSphereComponent_K2Node_ComponentBoundEvent_275_ComponentEndOverlapSignature__DelegateSignature) == 0x00000C, "Wrong size on B_BGA_SentryGun_C_BndEvt__SightRadiusSphereComponent_K2Node_ComponentBoundEvent_275_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(B_BGA_SentryGun_C_BndEvt__SightRadiusSphereComponent_K2Node_ComponentBoundEvent_275_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000000, "Member 'B_BGA_SentryGun_C_BndEvt__SightRadiusSphereComponent_K2Node_ComponentBoundEvent_275_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_BndEvt__SightRadiusSphereComponent_K2Node_ComponentBoundEvent_275_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000004, "Member 'B_BGA_SentryGun_C_BndEvt__SightRadiusSphereComponent_K2Node_ComponentBoundEvent_275_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_BndEvt__SightRadiusSphereComponent_K2Node_ComponentBoundEvent_275_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000008, "Member 'B_BGA_SentryGun_C_BndEvt__SightRadiusSphereComponent_K2Node_ComponentBoundEvent_275_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function B_BGA_SentryGun.B_BGA_SentryGun_C.BndEvt__SightRadiusSphereComponent_K2Node_ComponentBoundEvent_271_ComponentBeginOverlapSignature__DelegateSignature
// 0x0090 (0x0090 - 0x0000)
struct B_BGA_SentryGun_C_BndEvt__SightRadiusSphereComponent_K2Node_ComponentBoundEvent_271_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         OtherBodyIndex;                                    // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bFromSweep;                                        // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0010(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(B_BGA_SentryGun_C_BndEvt__SightRadiusSphereComponent_K2Node_ComponentBoundEvent_271_ComponentBeginOverlapSignature__DelegateSignature) == 0x000004, "Wrong alignment on B_BGA_SentryGun_C_BndEvt__SightRadiusSphereComponent_K2Node_ComponentBoundEvent_271_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(B_BGA_SentryGun_C_BndEvt__SightRadiusSphereComponent_K2Node_ComponentBoundEvent_271_ComponentBeginOverlapSignature__DelegateSignature) == 0x000090, "Wrong size on B_BGA_SentryGun_C_BndEvt__SightRadiusSphereComponent_K2Node_ComponentBoundEvent_271_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(B_BGA_SentryGun_C_BndEvt__SightRadiusSphereComponent_K2Node_ComponentBoundEvent_271_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000000, "Member 'B_BGA_SentryGun_C_BndEvt__SightRadiusSphereComponent_K2Node_ComponentBoundEvent_271_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_BndEvt__SightRadiusSphereComponent_K2Node_ComponentBoundEvent_271_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000004, "Member 'B_BGA_SentryGun_C_BndEvt__SightRadiusSphereComponent_K2Node_ComponentBoundEvent_271_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_BndEvt__SightRadiusSphereComponent_K2Node_ComponentBoundEvent_271_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000008, "Member 'B_BGA_SentryGun_C_BndEvt__SightRadiusSphereComponent_K2Node_ComponentBoundEvent_271_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_BndEvt__SightRadiusSphereComponent_K2Node_ComponentBoundEvent_271_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00000C, "Member 'B_BGA_SentryGun_C_BndEvt__SightRadiusSphereComponent_K2Node_ComponentBoundEvent_271_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_BndEvt__SightRadiusSphereComponent_K2Node_ComponentBoundEvent_271_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000010, "Member 'B_BGA_SentryGun_C_BndEvt__SightRadiusSphereComponent_K2Node_ComponentBoundEvent_271_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function B_BGA_SentryGun.B_BGA_SentryGun_C.OnDeathServer
// 0x00BC (0x00BC - 0x0000)
struct B_BGA_SentryGun_C_OnDeathServer final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  DamageTags;                                        // 0x0004(0x0018)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FVector                                Momentum;                                          // 0x001C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             HitInfo;                                           // 0x0028(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class AController*                            InstigatedBy;                                      // 0x00A8(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 DamageCauser;                                      // 0x00AC(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x00B0(0x000C)(Parm)
};
static_assert(alignof(B_BGA_SentryGun_C_OnDeathServer) == 0x000004, "Wrong alignment on B_BGA_SentryGun_C_OnDeathServer");
static_assert(sizeof(B_BGA_SentryGun_C_OnDeathServer) == 0x0000BC, "Wrong size on B_BGA_SentryGun_C_OnDeathServer");
static_assert(offsetof(B_BGA_SentryGun_C_OnDeathServer, Damage) == 0x000000, "Member 'B_BGA_SentryGun_C_OnDeathServer::Damage' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_OnDeathServer, DamageTags) == 0x000004, "Member 'B_BGA_SentryGun_C_OnDeathServer::DamageTags' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_OnDeathServer, Momentum) == 0x00001C, "Member 'B_BGA_SentryGun_C_OnDeathServer::Momentum' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_OnDeathServer, HitInfo) == 0x000028, "Member 'B_BGA_SentryGun_C_OnDeathServer::HitInfo' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_OnDeathServer, InstigatedBy) == 0x0000A8, "Member 'B_BGA_SentryGun_C_OnDeathServer::InstigatedBy' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_OnDeathServer, DamageCauser) == 0x0000AC, "Member 'B_BGA_SentryGun_C_OnDeathServer::DamageCauser' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_OnDeathServer, EffectContext) == 0x0000B0, "Member 'B_BGA_SentryGun_C_OnDeathServer::EffectContext' has a wrong offset!");

// Function B_BGA_SentryGun.B_BGA_SentryGun_C.OnDeathPlayEffects
// 0x00BC (0x00BC - 0x0000)
struct B_BGA_SentryGun_C_OnDeathPlayEffects final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  DamageTags;                                        // 0x0004(0x0018)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FVector                                Momentum;                                          // 0x001C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             HitInfo;                                           // 0x0028(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class AFortPawn*                              InstigatedBy;                                      // 0x00A8(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 DamageCauser;                                      // 0x00AC(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x00B0(0x000C)(Parm)
};
static_assert(alignof(B_BGA_SentryGun_C_OnDeathPlayEffects) == 0x000004, "Wrong alignment on B_BGA_SentryGun_C_OnDeathPlayEffects");
static_assert(sizeof(B_BGA_SentryGun_C_OnDeathPlayEffects) == 0x0000BC, "Wrong size on B_BGA_SentryGun_C_OnDeathPlayEffects");
static_assert(offsetof(B_BGA_SentryGun_C_OnDeathPlayEffects, Damage) == 0x000000, "Member 'B_BGA_SentryGun_C_OnDeathPlayEffects::Damage' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_OnDeathPlayEffects, DamageTags) == 0x000004, "Member 'B_BGA_SentryGun_C_OnDeathPlayEffects::DamageTags' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_OnDeathPlayEffects, Momentum) == 0x00001C, "Member 'B_BGA_SentryGun_C_OnDeathPlayEffects::Momentum' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_OnDeathPlayEffects, HitInfo) == 0x000028, "Member 'B_BGA_SentryGun_C_OnDeathPlayEffects::HitInfo' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_OnDeathPlayEffects, InstigatedBy) == 0x0000A8, "Member 'B_BGA_SentryGun_C_OnDeathPlayEffects::InstigatedBy' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_OnDeathPlayEffects, DamageCauser) == 0x0000AC, "Member 'B_BGA_SentryGun_C_OnDeathPlayEffects::DamageCauser' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_OnDeathPlayEffects, EffectContext) == 0x0000B0, "Member 'B_BGA_SentryGun_C_OnDeathPlayEffects::EffectContext' has a wrong offset!");

// Function B_BGA_SentryGun.B_BGA_SentryGun_C.GameplayCue.Abilities.Activation.Generic.SentryGun
// 0x0088 (0x0088 - 0x0000)
struct B_BGA_SentryGun_C_GameplayCue_Abilities_Activation_Generic_SentryGun final
{
public:
	EGameplayCueEvent                             EventType;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 Parameters;                                        // 0x0004(0x0084)(Parm)
};
static_assert(alignof(B_BGA_SentryGun_C_GameplayCue_Abilities_Activation_Generic_SentryGun) == 0x000004, "Wrong alignment on B_BGA_SentryGun_C_GameplayCue_Abilities_Activation_Generic_SentryGun");
static_assert(sizeof(B_BGA_SentryGun_C_GameplayCue_Abilities_Activation_Generic_SentryGun) == 0x000088, "Wrong size on B_BGA_SentryGun_C_GameplayCue_Abilities_Activation_Generic_SentryGun");
static_assert(offsetof(B_BGA_SentryGun_C_GameplayCue_Abilities_Activation_Generic_SentryGun, EventType) == 0x000000, "Member 'B_BGA_SentryGun_C_GameplayCue_Abilities_Activation_Generic_SentryGun::EventType' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_GameplayCue_Abilities_Activation_Generic_SentryGun, Parameters) == 0x000004, "Member 'B_BGA_SentryGun_C_GameplayCue_Abilities_Activation_Generic_SentryGun::Parameters' has a wrong offset!");

// Function B_BGA_SentryGun.B_BGA_SentryGun_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct B_BGA_SentryGun_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_BGA_SentryGun_C_ReceiveTick) == 0x000004, "Wrong alignment on B_BGA_SentryGun_C_ReceiveTick");
static_assert(sizeof(B_BGA_SentryGun_C_ReceiveTick) == 0x000004, "Wrong size on B_BGA_SentryGun_C_ReceiveTick");
static_assert(offsetof(B_BGA_SentryGun_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'B_BGA_SentryGun_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function B_BGA_SentryGun.B_BGA_SentryGun_C.GameplayCue.Impact.Physical
// 0x0088 (0x0088 - 0x0000)
struct B_BGA_SentryGun_C_GameplayCue_Impact_Physical final
{
public:
	EGameplayCueEvent                             EventType;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 Parameters;                                        // 0x0004(0x0084)(Parm)
};
static_assert(alignof(B_BGA_SentryGun_C_GameplayCue_Impact_Physical) == 0x000004, "Wrong alignment on B_BGA_SentryGun_C_GameplayCue_Impact_Physical");
static_assert(sizeof(B_BGA_SentryGun_C_GameplayCue_Impact_Physical) == 0x000088, "Wrong size on B_BGA_SentryGun_C_GameplayCue_Impact_Physical");
static_assert(offsetof(B_BGA_SentryGun_C_GameplayCue_Impact_Physical, EventType) == 0x000000, "Member 'B_BGA_SentryGun_C_GameplayCue_Impact_Physical::EventType' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_GameplayCue_Impact_Physical, Parameters) == 0x000004, "Member 'B_BGA_SentryGun_C_GameplayCue_Impact_Physical::Parameters' has a wrong offset!");

// Function B_BGA_SentryGun.B_BGA_SentryGun_C.InitializeMIDs
// 0x0004 (0x0004 - 0x0000)
struct B_BGA_SentryGun_C_InitializeMIDs final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_BGA_SentryGun_C_InitializeMIDs) == 0x000004, "Wrong alignment on B_BGA_SentryGun_C_InitializeMIDs");
static_assert(sizeof(B_BGA_SentryGun_C_InitializeMIDs) == 0x000004, "Wrong size on B_BGA_SentryGun_C_InitializeMIDs");
static_assert(offsetof(B_BGA_SentryGun_C_InitializeMIDs, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000000, "Member 'B_BGA_SentryGun_C_InitializeMIDs::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

// Function B_BGA_SentryGun.B_BGA_SentryGun_C.SetTrackingTarget
// 0x0008 (0x0008 - 0x0000)
struct B_BGA_SentryGun_C_SetTrackingTarget final
{
public:
	class AFortPawn*                              PawnToTrack;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_BGA_SentryGun_C_SetTrackingTarget) == 0x000004, "Wrong alignment on B_BGA_SentryGun_C_SetTrackingTarget");
static_assert(sizeof(B_BGA_SentryGun_C_SetTrackingTarget) == 0x000008, "Wrong size on B_BGA_SentryGun_C_SetTrackingTarget");
static_assert(offsetof(B_BGA_SentryGun_C_SetTrackingTarget, PawnToTrack) == 0x000000, "Member 'B_BGA_SentryGun_C_SetTrackingTarget::PawnToTrack' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_SetTrackingTarget, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'B_BGA_SentryGun_C_SetTrackingTarget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_SetTrackingTarget, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000005, "Member 'B_BGA_SentryGun_C_SetTrackingTarget::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_SetTrackingTarget, CallFunc_HasAuthority_ReturnValue) == 0x000006, "Member 'B_BGA_SentryGun_C_SetTrackingTarget::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_SetTrackingTarget, CallFunc_BooleanAND_ReturnValue) == 0x000007, "Member 'B_BGA_SentryGun_C_SetTrackingTarget::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function B_BGA_SentryGun.B_BGA_SentryGun_C.AttemptAcquireTarget
// 0x0030 (0x0030 - 0x0000)
struct B_BGA_SentryGun_C_AttemptAcquireTarget final
{
public:
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	const class AFortPawn*                        Temp_object_Variable;                              // 0x0018(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortPawn*                              CallFunc_Array_Get_Item;                           // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidTarget_bValidTarget;               // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_BGA_SentryGun_C_AttemptAcquireTarget) == 0x000004, "Wrong alignment on B_BGA_SentryGun_C_AttemptAcquireTarget");
static_assert(sizeof(B_BGA_SentryGun_C_AttemptAcquireTarget) == 0x000030, "Wrong size on B_BGA_SentryGun_C_AttemptAcquireTarget");
static_assert(offsetof(B_BGA_SentryGun_C_AttemptAcquireTarget, Temp_bool_True_if_break_was_hit_Variable) == 0x000000, "Member 'B_BGA_SentryGun_C_AttemptAcquireTarget::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_AttemptAcquireTarget, Temp_int_Array_Index_Variable) == 0x000004, "Member 'B_BGA_SentryGun_C_AttemptAcquireTarget::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_AttemptAcquireTarget, CallFunc_Not_PreBool_ReturnValue) == 0x000008, "Member 'B_BGA_SentryGun_C_AttemptAcquireTarget::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_AttemptAcquireTarget, CallFunc_Array_Length_ReturnValue) == 0x00000C, "Member 'B_BGA_SentryGun_C_AttemptAcquireTarget::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_AttemptAcquireTarget, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'B_BGA_SentryGun_C_AttemptAcquireTarget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_AttemptAcquireTarget, CallFunc_Greater_IntInt_ReturnValue) == 0x000011, "Member 'B_BGA_SentryGun_C_AttemptAcquireTarget::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_AttemptAcquireTarget, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'B_BGA_SentryGun_C_AttemptAcquireTarget::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_AttemptAcquireTarget, Temp_object_Variable) == 0x000018, "Member 'B_BGA_SentryGun_C_AttemptAcquireTarget::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(B_BGA_SentryGun_C_AttemptAcquireTarget, CallFunc_Array_RemoveItem_ReturnValue) == 0x00001C, "Member 'B_BGA_SentryGun_C_AttemptAcquireTarget::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
