#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_BGA_TrashmanBagSkull

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass B_BGA_TrashmanBagSkull.B_BGA_TrashmanBagSkull_C
// 0x00F8 (0x0580 - 0x0488)
class AB_BGA_TrashmanBagSkull_C final : public ABuildingGameplayActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0488(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               P_Husk_Trashman_Projectile;                        // 0x048C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UBoxComponent*                          SkullBiteBox;                                      // 0x0490(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class USphereComponent*                       SkullJumpSphere;                                   // 0x0494(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UAudioComponent*                        SkullAmbientAudio;                                 // 0x0498(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UParticleSystemComponent*               PropaneExplosionWarningFX;                         // 0x049C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   SkullMesh;                                         // 0x04A0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UCapsuleComponent*                      SkullCapsule;                                      // 0x04A4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UProjectileMovementComponent*           ProjectileMovement;                                // 0x04A8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	struct FVector                                Gnawing_SkullScale_6E3241D643BE408125077C9D23CFFFBA; // 0x04AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         Gnawing_Rotation_6E3241D643BE408125077C9D23CFFFBA; // 0x04B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ETimelineDirection                            Gnawing__Direction_6E3241D643BE408125077C9D23CFFFBA; // 0x04BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4BD[0x3];                                      // 0x04BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Gnawing;                                           // 0x04C0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         Wiggle_Scale_AD8C368F44481EFDF909639956EDFA94;     // 0x04C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ETimelineDirection                            Wiggle__Direction_AD8C368F44481EFDF909639956EDFA94; // 0x04C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C9[0x3];                                      // 0x04C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Wiggle;                                            // 0x04CC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsDestroyed;                                       // 0x04D0(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	bool                                          DelayedShouldDie;                                  // 0x04D1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D2[0x2];                                      // 0x04D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             BounceSound;                                       // 0x04D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class USoundBase*                             BiteSound;                                         // 0x04D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class USoundBase*                             DeathSound;                                        // 0x04DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class USoundBase*                             DeathDisappearSound;                               // 0x04E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class USoundBase*                             GnawSound;                                         // 0x04E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class USoundBase*                             GnawFailSound;                                     // 0x04E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UParticleSystem*                        DeathEffect;                                       // 0x04EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                ExplosionEffectScale;                              // 0x04F0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class APawn*                                  ExplosionInstigatingPawn;                          // 0x04FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor)
	class AController*                            ExplosionInstigatingController;                    // 0x0500(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor)
	class AActor*                                 LastDamageCausingActor;                            // 0x0504(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class APawn*                                  LastDamageCausingPawn;                             // 0x0508(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  TC_MeleeDamage;                                    // 0x050C(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           Event_NPCAbilityAttackAOEExplosion;                // 0x0524(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class AFortPawn*>                      SkullJumpSpherePawnsOverlapped;                    // 0x052C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance)
	struct FVector                                SkullBounceVelocity;                               // 0x0538(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Debug;                                             // 0x0544(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_545[0x3];                                      // 0x0545(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                DefaultSkullScale;                                 // 0x0548(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         SkullHopRandomFloat;                               // 0x0554(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FGameplayTag                           Event_Bite;                                        // 0x0558(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          MeleeLaunch;                                       // 0x0560(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	uint8                                         Pad_561[0x3];                                      // 0x0561(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MinJumpsToStopGnawing;                             // 0x0564(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	int32                                         MaxJumpsToStopGnawing;                             // 0x0568(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	int32                                         JumpsToStopGnawing;                                // 0x056C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	int32                                         Jumps;                                             // 0x0570(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          CurrentlyJumping;                                  // 0x0574(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_575[0x3];                                      // 0x0575(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              PawnBeingBitten;                                   // 0x0578(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         MaxJumpAngleChange;                                // 0x057C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_B_BGA_TrashmanBagSkull(int32 EntryPoint);
	void PlayerMovementUpdated(float DeltaSeconds, const struct FVector& OldLocation, const struct FVector& OldVelocity);
	void Gnaw();
	void GnawFinish();
	void StartGnawing();
	void DeathTimer();
	void BounceOrImpactWiggle();
	void MeleeLaunchDeathLanded();
	void ForceSkullJump();
	void SkullHop();
	void StartSkullHop();
	void BndEvt__Box1_K2Node_ComponentBoundEvent_705_ComponentBeginOverlapSignature__DelegateSignature(class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BndEvt__TriggerSphere_K2Node_ComponentBoundEvent_211_ComponentEndOverlapSignature__DelegateSignature(class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void BndEvt__TriggerSphere_K2Node_ComponentBoundEvent_135_ComponentBeginOverlapSignature__DelegateSignature(class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void ReceiveBeginPlay();
	void MeleeDamageLaunchesSkull();
	void BounceOrImpactSound();
	void OnDamageServer(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AController* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void BndEvt__ProjectileMovement_K2Node_ComponentBoundEvent_32_OnProjectileBounceDelegate__DelegateSignature(const struct FHitResult& ImpactResult, const struct FVector& ImpactVelocity);
	void Gnawing__UpdateFunc();
	void Gnawing__FinishedFunc();
	void Wiggle__UpdateFunc();
	void Wiggle__FinishedFunc();
	void UserConstructionScript();
	void OnRep_IsDestroyed();
	bool ShouldDie(float Damage, class AController* EventInstigator, class AActor* DamageCauser);
	void SetSkullVelocity(const struct FVector& Velocity);
	void OnRep_MeleeLaunch();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_BGA_TrashmanBagSkull_C">();
	}
	static class AB_BGA_TrashmanBagSkull_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_BGA_TrashmanBagSkull_C>();
	}
};
static_assert(alignof(AB_BGA_TrashmanBagSkull_C) == 0x000004, "Wrong alignment on AB_BGA_TrashmanBagSkull_C");
static_assert(sizeof(AB_BGA_TrashmanBagSkull_C) == 0x000580, "Wrong size on AB_BGA_TrashmanBagSkull_C");
static_assert(offsetof(AB_BGA_TrashmanBagSkull_C, UberGraphFrame) == 0x000488, "Member 'AB_BGA_TrashmanBagSkull_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_BGA_TrashmanBagSkull_C, P_Husk_Trashman_Projectile) == 0x00048C, "Member 'AB_BGA_TrashmanBagSkull_C::P_Husk_Trashman_Projectile' has a wrong offset!");
static_assert(offsetof(AB_BGA_TrashmanBagSkull_C, SkullBiteBox) == 0x000490, "Member 'AB_BGA_TrashmanBagSkull_C::SkullBiteBox' has a wrong offset!");
static_assert(offsetof(AB_BGA_TrashmanBagSkull_C, SkullJumpSphere) == 0x000494, "Member 'AB_BGA_TrashmanBagSkull_C::SkullJumpSphere' has a wrong offset!");
static_assert(offsetof(AB_BGA_TrashmanBagSkull_C, SkullAmbientAudio) == 0x000498, "Member 'AB_BGA_TrashmanBagSkull_C::SkullAmbientAudio' has a wrong offset!");
static_assert(offsetof(AB_BGA_TrashmanBagSkull_C, PropaneExplosionWarningFX) == 0x00049C, "Member 'AB_BGA_TrashmanBagSkull_C::PropaneExplosionWarningFX' has a wrong offset!");
static_assert(offsetof(AB_BGA_TrashmanBagSkull_C, SkullMesh) == 0x0004A0, "Member 'AB_BGA_TrashmanBagSkull_C::SkullMesh' has a wrong offset!");
static_assert(offsetof(AB_BGA_TrashmanBagSkull_C, SkullCapsule) == 0x0004A4, "Member 'AB_BGA_TrashmanBagSkull_C::SkullCapsule' has a wrong offset!");
static_assert(offsetof(AB_BGA_TrashmanBagSkull_C, ProjectileMovement) == 0x0004A8, "Member 'AB_BGA_TrashmanBagSkull_C::ProjectileMovement' has a wrong offset!");
static_assert(offsetof(AB_BGA_TrashmanBagSkull_C, Gnawing_SkullScale_6E3241D643BE408125077C9D23CFFFBA) == 0x0004AC, "Member 'AB_BGA_TrashmanBagSkull_C::Gnawing_SkullScale_6E3241D643BE408125077C9D23CFFFBA' has a wrong offset!");
static_assert(offsetof(AB_BGA_TrashmanBagSkull_C, Gnawing_Rotation_6E3241D643BE408125077C9D23CFFFBA) == 0x0004B8, "Member 'AB_BGA_TrashmanBagSkull_C::Gnawing_Rotation_6E3241D643BE408125077C9D23CFFFBA' has a wrong offset!");
static_assert(offsetof(AB_BGA_TrashmanBagSkull_C, Gnawing__Direction_6E3241D643BE408125077C9D23CFFFBA) == 0x0004BC, "Member 'AB_BGA_TrashmanBagSkull_C::Gnawing__Direction_6E3241D643BE408125077C9D23CFFFBA' has a wrong offset!");
static_assert(offsetof(AB_BGA_TrashmanBagSkull_C, Gnawing) == 0x0004C0, "Member 'AB_BGA_TrashmanBagSkull_C::Gnawing' has a wrong offset!");
static_assert(offsetof(AB_BGA_TrashmanBagSkull_C, Wiggle_Scale_AD8C368F44481EFDF909639956EDFA94) == 0x0004C4, "Member 'AB_BGA_TrashmanBagSkull_C::Wiggle_Scale_AD8C368F44481EFDF909639956EDFA94' has a wrong offset!");
static_assert(offsetof(AB_BGA_TrashmanBagSkull_C, Wiggle__Direction_AD8C368F44481EFDF909639956EDFA94) == 0x0004C8, "Member 'AB_BGA_TrashmanBagSkull_C::Wiggle__Direction_AD8C368F44481EFDF909639956EDFA94' has a wrong offset!");
static_assert(offsetof(AB_BGA_TrashmanBagSkull_C, Wiggle) == 0x0004CC, "Member 'AB_BGA_TrashmanBagSkull_C::Wiggle' has a wrong offset!");
static_assert(offsetof(AB_BGA_TrashmanBagSkull_C, IsDestroyed) == 0x0004D0, "Member 'AB_BGA_TrashmanBagSkull_C::IsDestroyed' has a wrong offset!");
static_assert(offsetof(AB_BGA_TrashmanBagSkull_C, DelayedShouldDie) == 0x0004D1, "Member 'AB_BGA_TrashmanBagSkull_C::DelayedShouldDie' has a wrong offset!");
static_assert(offsetof(AB_BGA_TrashmanBagSkull_C, BounceSound) == 0x0004D4, "Member 'AB_BGA_TrashmanBagSkull_C::BounceSound' has a wrong offset!");
static_assert(offsetof(AB_BGA_TrashmanBagSkull_C, BiteSound) == 0x0004D8, "Member 'AB_BGA_TrashmanBagSkull_C::BiteSound' has a wrong offset!");
static_assert(offsetof(AB_BGA_TrashmanBagSkull_C, DeathSound) == 0x0004DC, "Member 'AB_BGA_TrashmanBagSkull_C::DeathSound' has a wrong offset!");
static_assert(offsetof(AB_BGA_TrashmanBagSkull_C, DeathDisappearSound) == 0x0004E0, "Member 'AB_BGA_TrashmanBagSkull_C::DeathDisappearSound' has a wrong offset!");
static_assert(offsetof(AB_BGA_TrashmanBagSkull_C, GnawSound) == 0x0004E4, "Member 'AB_BGA_TrashmanBagSkull_C::GnawSound' has a wrong offset!");
static_assert(offsetof(AB_BGA_TrashmanBagSkull_C, GnawFailSound) == 0x0004E8, "Member 'AB_BGA_TrashmanBagSkull_C::GnawFailSound' has a wrong offset!");
static_assert(offsetof(AB_BGA_TrashmanBagSkull_C, DeathEffect) == 0x0004EC, "Member 'AB_BGA_TrashmanBagSkull_C::DeathEffect' has a wrong offset!");
static_assert(offsetof(AB_BGA_TrashmanBagSkull_C, ExplosionEffectScale) == 0x0004F0, "Member 'AB_BGA_TrashmanBagSkull_C::ExplosionEffectScale' has a wrong offset!");
static_assert(offsetof(AB_BGA_TrashmanBagSkull_C, ExplosionInstigatingPawn) == 0x0004FC, "Member 'AB_BGA_TrashmanBagSkull_C::ExplosionInstigatingPawn' has a wrong offset!");
static_assert(offsetof(AB_BGA_TrashmanBagSkull_C, ExplosionInstigatingController) == 0x000500, "Member 'AB_BGA_TrashmanBagSkull_C::ExplosionInstigatingController' has a wrong offset!");
static_assert(offsetof(AB_BGA_TrashmanBagSkull_C, LastDamageCausingActor) == 0x000504, "Member 'AB_BGA_TrashmanBagSkull_C::LastDamageCausingActor' has a wrong offset!");
static_assert(offsetof(AB_BGA_TrashmanBagSkull_C, LastDamageCausingPawn) == 0x000508, "Member 'AB_BGA_TrashmanBagSkull_C::LastDamageCausingPawn' has a wrong offset!");
static_assert(offsetof(AB_BGA_TrashmanBagSkull_C, TC_MeleeDamage) == 0x00050C, "Member 'AB_BGA_TrashmanBagSkull_C::TC_MeleeDamage' has a wrong offset!");
static_assert(offsetof(AB_BGA_TrashmanBagSkull_C, Event_NPCAbilityAttackAOEExplosion) == 0x000524, "Member 'AB_BGA_TrashmanBagSkull_C::Event_NPCAbilityAttackAOEExplosion' has a wrong offset!");
static_assert(offsetof(AB_BGA_TrashmanBagSkull_C, SkullJumpSpherePawnsOverlapped) == 0x00052C, "Member 'AB_BGA_TrashmanBagSkull_C::SkullJumpSpherePawnsOverlapped' has a wrong offset!");
static_assert(offsetof(AB_BGA_TrashmanBagSkull_C, SkullBounceVelocity) == 0x000538, "Member 'AB_BGA_TrashmanBagSkull_C::SkullBounceVelocity' has a wrong offset!");
static_assert(offsetof(AB_BGA_TrashmanBagSkull_C, Debug) == 0x000544, "Member 'AB_BGA_TrashmanBagSkull_C::Debug' has a wrong offset!");
static_assert(offsetof(AB_BGA_TrashmanBagSkull_C, DefaultSkullScale) == 0x000548, "Member 'AB_BGA_TrashmanBagSkull_C::DefaultSkullScale' has a wrong offset!");
static_assert(offsetof(AB_BGA_TrashmanBagSkull_C, SkullHopRandomFloat) == 0x000554, "Member 'AB_BGA_TrashmanBagSkull_C::SkullHopRandomFloat' has a wrong offset!");
static_assert(offsetof(AB_BGA_TrashmanBagSkull_C, Event_Bite) == 0x000558, "Member 'AB_BGA_TrashmanBagSkull_C::Event_Bite' has a wrong offset!");
static_assert(offsetof(AB_BGA_TrashmanBagSkull_C, MeleeLaunch) == 0x000560, "Member 'AB_BGA_TrashmanBagSkull_C::MeleeLaunch' has a wrong offset!");
static_assert(offsetof(AB_BGA_TrashmanBagSkull_C, MinJumpsToStopGnawing) == 0x000564, "Member 'AB_BGA_TrashmanBagSkull_C::MinJumpsToStopGnawing' has a wrong offset!");
static_assert(offsetof(AB_BGA_TrashmanBagSkull_C, MaxJumpsToStopGnawing) == 0x000568, "Member 'AB_BGA_TrashmanBagSkull_C::MaxJumpsToStopGnawing' has a wrong offset!");
static_assert(offsetof(AB_BGA_TrashmanBagSkull_C, JumpsToStopGnawing) == 0x00056C, "Member 'AB_BGA_TrashmanBagSkull_C::JumpsToStopGnawing' has a wrong offset!");
static_assert(offsetof(AB_BGA_TrashmanBagSkull_C, Jumps) == 0x000570, "Member 'AB_BGA_TrashmanBagSkull_C::Jumps' has a wrong offset!");
static_assert(offsetof(AB_BGA_TrashmanBagSkull_C, CurrentlyJumping) == 0x000574, "Member 'AB_BGA_TrashmanBagSkull_C::CurrentlyJumping' has a wrong offset!");
static_assert(offsetof(AB_BGA_TrashmanBagSkull_C, PawnBeingBitten) == 0x000578, "Member 'AB_BGA_TrashmanBagSkull_C::PawnBeingBitten' has a wrong offset!");
static_assert(offsetof(AB_BGA_TrashmanBagSkull_C, MaxJumpAngleChange) == 0x00057C, "Member 'AB_BGA_TrashmanBagSkull_C::MaxJumpAngleChange' has a wrong offset!");

}

#pragma pack(pop)
