#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Decal3d_Parent_01

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function B_Decal3d_Parent_01.B_Decal3d_Parent_01_C.ExecuteUbergraph_B_Decal3d_Parent_01
// 0x0008 (0x0008 - 0x0000)
struct B_Decal3d_Parent_01_C_ExecuteUbergraph_B_Decal3d_Parent_01 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Decal3d_Parent_01_C_ExecuteUbergraph_B_Decal3d_Parent_01) == 0x000004, "Wrong alignment on B_Decal3d_Parent_01_C_ExecuteUbergraph_B_Decal3d_Parent_01");
static_assert(sizeof(B_Decal3d_Parent_01_C_ExecuteUbergraph_B_Decal3d_Parent_01) == 0x000008, "Wrong size on B_Decal3d_Parent_01_C_ExecuteUbergraph_B_Decal3d_Parent_01");
static_assert(offsetof(B_Decal3d_Parent_01_C_ExecuteUbergraph_B_Decal3d_Parent_01, EntryPoint) == 0x000000, "Member 'B_Decal3d_Parent_01_C_ExecuteUbergraph_B_Decal3d_Parent_01::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Decal3d_Parent_01_C_ExecuteUbergraph_B_Decal3d_Parent_01, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000004, "Member 'B_Decal3d_Parent_01_C_ExecuteUbergraph_B_Decal3d_Parent_01::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");

// Function B_Decal3d_Parent_01.B_Decal3d_Parent_01_C.UserConstructionScript
// 0x0100 (0x0100 - 0x0000)
struct B_Decal3d_Parent_01_C_UserConstructionScript final
{
public:
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_FClamp_ReturnValue2;                      // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue;           // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_RandomFloatInRange_ReturnValue2;          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue;              // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0050(0x0030)(IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult;      // 0x0080(0x0080)(ContainsInstancedReference)
};
static_assert(alignof(B_Decal3d_Parent_01_C_UserConstructionScript) == 0x000010, "Wrong alignment on B_Decal3d_Parent_01_C_UserConstructionScript");
static_assert(sizeof(B_Decal3d_Parent_01_C_UserConstructionScript) == 0x000100, "Wrong size on B_Decal3d_Parent_01_C_UserConstructionScript");
static_assert(offsetof(B_Decal3d_Parent_01_C_UserConstructionScript, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000000, "Member 'B_Decal3d_Parent_01_C_UserConstructionScript::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Decal3d_Parent_01_C_UserConstructionScript, CallFunc_FClamp_ReturnValue) == 0x00000C, "Member 'B_Decal3d_Parent_01_C_UserConstructionScript::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Decal3d_Parent_01_C_UserConstructionScript, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000010, "Member 'B_Decal3d_Parent_01_C_UserConstructionScript::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Decal3d_Parent_01_C_UserConstructionScript, CallFunc_RandomFloatInRange_ReturnValue) == 0x000014, "Member 'B_Decal3d_Parent_01_C_UserConstructionScript::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Decal3d_Parent_01_C_UserConstructionScript, CallFunc_FClamp_ReturnValue2) == 0x000018, "Member 'B_Decal3d_Parent_01_C_UserConstructionScript::CallFunc_FClamp_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Decal3d_Parent_01_C_UserConstructionScript, CallFunc_Conv_FloatToVector_ReturnValue) == 0x00001C, "Member 'B_Decal3d_Parent_01_C_UserConstructionScript::CallFunc_Conv_FloatToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Decal3d_Parent_01_C_UserConstructionScript, CallFunc_RandomFloatInRange_ReturnValue2) == 0x000028, "Member 'B_Decal3d_Parent_01_C_UserConstructionScript::CallFunc_RandomFloatInRange_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Decal3d_Parent_01_C_UserConstructionScript, CallFunc_MakeRotator_ReturnValue) == 0x00002C, "Member 'B_Decal3d_Parent_01_C_UserConstructionScript::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Decal3d_Parent_01_C_UserConstructionScript, CallFunc_ComposeRotators_ReturnValue) == 0x000038, "Member 'B_Decal3d_Parent_01_C_UserConstructionScript::CallFunc_ComposeRotators_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Decal3d_Parent_01_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000044, "Member 'B_Decal3d_Parent_01_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Decal3d_Parent_01_C_UserConstructionScript, CallFunc_MakeTransform_ReturnValue) == 0x000050, "Member 'B_Decal3d_Parent_01_C_UserConstructionScript::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Decal3d_Parent_01_C_UserConstructionScript, CallFunc_K2_SetWorldTransform_SweepHitResult) == 0x000080, "Member 'B_Decal3d_Parent_01_C_UserConstructionScript::CallFunc_K2_SetWorldTransform_SweepHitResult' has a wrong offset!");

}

#pragma pack(pop)
