#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Decal3d_Parent_01

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass B_Decal3d_Parent_01.B_Decal3d_Parent_01_C
// 0x00B0 (0x02F0 - 0x0240)
class AB_Decal3d_Parent_01_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0240(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Onex1x1BoxCenterAligned;                           // 0x0244(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0248(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	float                                         Fade_Decal_Out_Timeline_Fade_2CD62F7A487C7EACC7300093F7030217; // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ETimelineDirection                            Fade_Decal_Out_Timeline__Direction_2CD62F7A487C7EACC7300093F7030217; // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_251[0x3];                                      // 0x0251(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Fade_Decal_Out_Timeline;                           // 0x0254(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UMaterialInterface*                     Decal_Material;                                    // 0x0258(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	float                                         Decal_Scale_Min;                                   // 0x025C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	float                                         Decal_Scale_Max;                                   // 0x0260(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	struct FRotator                               Decal_Rotation;                                    // 0x0264(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                Decal_Location;                                    // 0x0270(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UMaterialInstanceDynamic*               Decal_MID;                                         // 0x027C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FLinearColor                           Decal_Color;                                       // 0x0280(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	struct FTransform                             Decal_Transform;                                   // 0x0290(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         Decal_Lifetime;                                    // 0x02C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	float                                         Decal_Fadeout_Time;                                // 0x02C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	float                                         Decal_RT_Delay;                                    // 0x02C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         Decal_Opacity;                                     // 0x02CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	struct FVector                                Decal_Scale;                                       // 0x02D0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         Decal_X_Opacity_Hardness;                          // 0x02DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	float                                         Decal_Y_Opacity_Hardness;                          // 0x02E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	float                                         Decal_Z_Falloff_Hardness;                          // 0x02E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	class UTexture*                               Decal_Texture;                                     // 0x02E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void ExecuteUbergraph_B_Decal3d_Parent_01(int32 EntryPoint);
	void ReceiveBeginPlay();
	void Fade_Decal_Out_Timeline__UpdateFunc();
	void Fade_Decal_Out_Timeline__FinishedFunc();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Decal3d_Parent_01_C">();
	}
	static class AB_Decal3d_Parent_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Decal3d_Parent_01_C>();
	}
};
static_assert(alignof(AB_Decal3d_Parent_01_C) == 0x000010, "Wrong alignment on AB_Decal3d_Parent_01_C");
static_assert(sizeof(AB_Decal3d_Parent_01_C) == 0x0002F0, "Wrong size on AB_Decal3d_Parent_01_C");
static_assert(offsetof(AB_Decal3d_Parent_01_C, UberGraphFrame) == 0x000240, "Member 'AB_Decal3d_Parent_01_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_Decal3d_Parent_01_C, Onex1x1BoxCenterAligned) == 0x000244, "Member 'AB_Decal3d_Parent_01_C::Onex1x1BoxCenterAligned' has a wrong offset!");
static_assert(offsetof(AB_Decal3d_Parent_01_C, DefaultSceneRoot) == 0x000248, "Member 'AB_Decal3d_Parent_01_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AB_Decal3d_Parent_01_C, Fade_Decal_Out_Timeline_Fade_2CD62F7A487C7EACC7300093F7030217) == 0x00024C, "Member 'AB_Decal3d_Parent_01_C::Fade_Decal_Out_Timeline_Fade_2CD62F7A487C7EACC7300093F7030217' has a wrong offset!");
static_assert(offsetof(AB_Decal3d_Parent_01_C, Fade_Decal_Out_Timeline__Direction_2CD62F7A487C7EACC7300093F7030217) == 0x000250, "Member 'AB_Decal3d_Parent_01_C::Fade_Decal_Out_Timeline__Direction_2CD62F7A487C7EACC7300093F7030217' has a wrong offset!");
static_assert(offsetof(AB_Decal3d_Parent_01_C, Fade_Decal_Out_Timeline) == 0x000254, "Member 'AB_Decal3d_Parent_01_C::Fade_Decal_Out_Timeline' has a wrong offset!");
static_assert(offsetof(AB_Decal3d_Parent_01_C, Decal_Material) == 0x000258, "Member 'AB_Decal3d_Parent_01_C::Decal_Material' has a wrong offset!");
static_assert(offsetof(AB_Decal3d_Parent_01_C, Decal_Scale_Min) == 0x00025C, "Member 'AB_Decal3d_Parent_01_C::Decal_Scale_Min' has a wrong offset!");
static_assert(offsetof(AB_Decal3d_Parent_01_C, Decal_Scale_Max) == 0x000260, "Member 'AB_Decal3d_Parent_01_C::Decal_Scale_Max' has a wrong offset!");
static_assert(offsetof(AB_Decal3d_Parent_01_C, Decal_Rotation) == 0x000264, "Member 'AB_Decal3d_Parent_01_C::Decal_Rotation' has a wrong offset!");
static_assert(offsetof(AB_Decal3d_Parent_01_C, Decal_Location) == 0x000270, "Member 'AB_Decal3d_Parent_01_C::Decal_Location' has a wrong offset!");
static_assert(offsetof(AB_Decal3d_Parent_01_C, Decal_MID) == 0x00027C, "Member 'AB_Decal3d_Parent_01_C::Decal_MID' has a wrong offset!");
static_assert(offsetof(AB_Decal3d_Parent_01_C, Decal_Color) == 0x000280, "Member 'AB_Decal3d_Parent_01_C::Decal_Color' has a wrong offset!");
static_assert(offsetof(AB_Decal3d_Parent_01_C, Decal_Transform) == 0x000290, "Member 'AB_Decal3d_Parent_01_C::Decal_Transform' has a wrong offset!");
static_assert(offsetof(AB_Decal3d_Parent_01_C, Decal_Lifetime) == 0x0002C0, "Member 'AB_Decal3d_Parent_01_C::Decal_Lifetime' has a wrong offset!");
static_assert(offsetof(AB_Decal3d_Parent_01_C, Decal_Fadeout_Time) == 0x0002C4, "Member 'AB_Decal3d_Parent_01_C::Decal_Fadeout_Time' has a wrong offset!");
static_assert(offsetof(AB_Decal3d_Parent_01_C, Decal_RT_Delay) == 0x0002C8, "Member 'AB_Decal3d_Parent_01_C::Decal_RT_Delay' has a wrong offset!");
static_assert(offsetof(AB_Decal3d_Parent_01_C, Decal_Opacity) == 0x0002CC, "Member 'AB_Decal3d_Parent_01_C::Decal_Opacity' has a wrong offset!");
static_assert(offsetof(AB_Decal3d_Parent_01_C, Decal_Scale) == 0x0002D0, "Member 'AB_Decal3d_Parent_01_C::Decal_Scale' has a wrong offset!");
static_assert(offsetof(AB_Decal3d_Parent_01_C, Decal_X_Opacity_Hardness) == 0x0002DC, "Member 'AB_Decal3d_Parent_01_C::Decal_X_Opacity_Hardness' has a wrong offset!");
static_assert(offsetof(AB_Decal3d_Parent_01_C, Decal_Y_Opacity_Hardness) == 0x0002E0, "Member 'AB_Decal3d_Parent_01_C::Decal_Y_Opacity_Hardness' has a wrong offset!");
static_assert(offsetof(AB_Decal3d_Parent_01_C, Decal_Z_Falloff_Hardness) == 0x0002E4, "Member 'AB_Decal3d_Parent_01_C::Decal_Z_Falloff_Hardness' has a wrong offset!");
static_assert(offsetof(AB_Decal3d_Parent_01_C, Decal_Texture) == 0x0002E8, "Member 'AB_Decal3d_Parent_01_C::Decal_Texture' has a wrong offset!");

}

#pragma pack(pop)
