#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_FireCracker_Gun

#include "Basic.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function B_FireCracker_Gun.B_FireCracker_Gun_C.ExecuteUbergraph_B_FireCracker_Gun
// 0x0014 (0x0014 - 0x0000)
struct B_FireCracker_Gun_C_ExecuteUbergraph_B_FireCracker_Gun final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bPersistentFire;                      // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class USK_FireCrackerGun_Skeleton_AnimBlueprint_C* K2Node_DynamicCast_AsSK_Fire_Cracker_Gun_Skeleton_Anim_Blueprint; // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_FireCracker_Gun_C_ExecuteUbergraph_B_FireCracker_Gun) == 0x000004, "Wrong alignment on B_FireCracker_Gun_C_ExecuteUbergraph_B_FireCracker_Gun");
static_assert(sizeof(B_FireCracker_Gun_C_ExecuteUbergraph_B_FireCracker_Gun) == 0x000014, "Wrong size on B_FireCracker_Gun_C_ExecuteUbergraph_B_FireCracker_Gun");
static_assert(offsetof(B_FireCracker_Gun_C_ExecuteUbergraph_B_FireCracker_Gun, EntryPoint) == 0x000000, "Member 'B_FireCracker_Gun_C_ExecuteUbergraph_B_FireCracker_Gun::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_FireCracker_Gun_C_ExecuteUbergraph_B_FireCracker_Gun, Temp_bool_Has_Been_Initd_Variable) == 0x000004, "Member 'B_FireCracker_Gun_C_ExecuteUbergraph_B_FireCracker_Gun::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(B_FireCracker_Gun_C_ExecuteUbergraph_B_FireCracker_Gun, Temp_bool_IsClosed_Variable) == 0x000005, "Member 'B_FireCracker_Gun_C_ExecuteUbergraph_B_FireCracker_Gun::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(B_FireCracker_Gun_C_ExecuteUbergraph_B_FireCracker_Gun, K2Node_Event_bPersistentFire) == 0x000006, "Member 'B_FireCracker_Gun_C_ExecuteUbergraph_B_FireCracker_Gun::K2Node_Event_bPersistentFire' has a wrong offset!");
static_assert(offsetof(B_FireCracker_Gun_C_ExecuteUbergraph_B_FireCracker_Gun, CallFunc_GetAnimInstance_ReturnValue) == 0x000008, "Member 'B_FireCracker_Gun_C_ExecuteUbergraph_B_FireCracker_Gun::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_FireCracker_Gun_C_ExecuteUbergraph_B_FireCracker_Gun, K2Node_DynamicCast_AsSK_Fire_Cracker_Gun_Skeleton_Anim_Blueprint) == 0x00000C, "Member 'B_FireCracker_Gun_C_ExecuteUbergraph_B_FireCracker_Gun::K2Node_DynamicCast_AsSK_Fire_Cracker_Gun_Skeleton_Anim_Blueprint' has a wrong offset!");
static_assert(offsetof(B_FireCracker_Gun_C_ExecuteUbergraph_B_FireCracker_Gun, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'B_FireCracker_Gun_C_ExecuteUbergraph_B_FireCracker_Gun::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function B_FireCracker_Gun.B_FireCracker_Gun_C.OnPlayWeaponFireFX
// 0x0001 (0x0001 - 0x0000)
struct B_FireCracker_Gun_C_OnPlayWeaponFireFX final
{
public:
	bool                                          bPersistentFire;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_FireCracker_Gun_C_OnPlayWeaponFireFX) == 0x000001, "Wrong alignment on B_FireCracker_Gun_C_OnPlayWeaponFireFX");
static_assert(sizeof(B_FireCracker_Gun_C_OnPlayWeaponFireFX) == 0x000001, "Wrong size on B_FireCracker_Gun_C_OnPlayWeaponFireFX");
static_assert(offsetof(B_FireCracker_Gun_C_OnPlayWeaponFireFX, bPersistentFire) == 0x000000, "Member 'B_FireCracker_Gun_C_OnPlayWeaponFireFX::bPersistentFire' has a wrong offset!");

}

#pragma pack(pop)
