#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_FireCracker_Gun

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "B_Ranged_Generic_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass B_FireCracker_Gun.B_FireCracker_Gun_C
// 0x0028 (0x079C - 0x0774)
class AB_FireCracker_Gun_C final : public AB_Ranged_Generic_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_B_FireCracker_Gun_C;                // 0x0774(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               P_Pistol_Firecracker_FuseLight;                    // 0x0778(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UParticleSystemComponent*               ParticleScreenLight;                               // 0x077C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	float                                         springVal_springValCurve_D2668C68430C8B91DB30A5B63C821A2F; // 0x0780(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ETimelineDirection                            springVal__Direction_D2668C68430C8B91DB30A5B63C821A2F; // 0x0784(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_785[0x3];                                      // 0x0785(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     springVal;                                         // 0x0788(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FDataTableRowHandle                    DataRow;                                           // 0x078C(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          CanPlay_;                                          // 0x0798(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_B_FireCracker_Gun(int32 EntryPoint);
	void OnWeaponAttached();
	void OnPlayWeaponFireFX(bool bPersistentFire);
	void ReceiveBeginPlay();
	void springVal__UpdateFunc();
	void springVal__FinishedFunc();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_FireCracker_Gun_C">();
	}
	static class AB_FireCracker_Gun_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_FireCracker_Gun_C>();
	}
};
static_assert(alignof(AB_FireCracker_Gun_C) == 0x000004, "Wrong alignment on AB_FireCracker_Gun_C");
static_assert(sizeof(AB_FireCracker_Gun_C) == 0x00079C, "Wrong size on AB_FireCracker_Gun_C");
static_assert(offsetof(AB_FireCracker_Gun_C, UberGraphFrame_B_FireCracker_Gun_C) == 0x000774, "Member 'AB_FireCracker_Gun_C::UberGraphFrame_B_FireCracker_Gun_C' has a wrong offset!");
static_assert(offsetof(AB_FireCracker_Gun_C, P_Pistol_Firecracker_FuseLight) == 0x000778, "Member 'AB_FireCracker_Gun_C::P_Pistol_Firecracker_FuseLight' has a wrong offset!");
static_assert(offsetof(AB_FireCracker_Gun_C, ParticleScreenLight) == 0x00077C, "Member 'AB_FireCracker_Gun_C::ParticleScreenLight' has a wrong offset!");
static_assert(offsetof(AB_FireCracker_Gun_C, springVal_springValCurve_D2668C68430C8B91DB30A5B63C821A2F) == 0x000780, "Member 'AB_FireCracker_Gun_C::springVal_springValCurve_D2668C68430C8B91DB30A5B63C821A2F' has a wrong offset!");
static_assert(offsetof(AB_FireCracker_Gun_C, springVal__Direction_D2668C68430C8B91DB30A5B63C821A2F) == 0x000784, "Member 'AB_FireCracker_Gun_C::springVal__Direction_D2668C68430C8B91DB30A5B63C821A2F' has a wrong offset!");
static_assert(offsetof(AB_FireCracker_Gun_C, springVal) == 0x000788, "Member 'AB_FireCracker_Gun_C::springVal' has a wrong offset!");
static_assert(offsetof(AB_FireCracker_Gun_C, DataRow) == 0x00078C, "Member 'AB_FireCracker_Gun_C::DataRow' has a wrong offset!");
static_assert(offsetof(AB_FireCracker_Gun_C, CanPlay_) == 0x000798, "Member 'AB_FireCracker_Gun_C::CanPlay_' has a wrong offset!");

}

#pragma pack(pop)
