#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Pistol_Zapper

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "B_Pistol_Generic_classes.hpp"
#include "FortniteGame_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass B_Pistol_Zapper.B_Pistol_Zapper_C
// 0x005C (0x07D0 - 0x0774)
class AB_Pistol_Zapper_C final : public AB_Pistol_Generic_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_B_Pistol_Zapper_C;                  // 0x0774(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               P_ZapZap_CoreReloadArcs_01;                        // 0x0778(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UParticleSystemComponent*               P_ZapZap_CoreReload_01;                            // 0x077C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UParticleSystemComponent*               P_ZapZap_Core_01;                                  // 0x0780(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	struct FVector                                Scale_Glow_Up_Size_D24648EE45B04D4B02AE1187715E1632; // 0x0784(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         Scale_Glow_Up_LERP_Particle_D24648EE45B04D4B02AE1187715E1632; // 0x0790(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         Scale_Glow_Up_LERP_Color_D24648EE45B04D4B02AE1187715E1632; // 0x0794(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ETimelineDirection                            Scale_Glow_Up__Direction_D24648EE45B04D4B02AE1187715E1632; // 0x0798(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_799[0x3];                                      // 0x0799(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Scale_Glow_Up;                                     // 0x079C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UMaterialInstanceDynamic*               WeaponMesh_MID;                                    // 0x07A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FLinearColor                           GlowColor_Charged;                                 // 0x07A4(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          AmmoCountChangedBeUsed_;                           // 0x07B4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7B5[0x3];                                      // 0x07B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         GetTimeToNextFire_B_Pistol_Zapper_C;               // 0x07B8(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         bAmmoCountDelay;                                   // 0x07BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         Core_Reload_Start_Speed;                           // 0x07C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         Core_Reload_End_Speed;                             // 0x07C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         Core_Reload_Start_Spawn_Rate;                      // 0x07C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         Core_Reload_End_Spawn_Rate;                        // 0x07CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_B_Pistol_Zapper(int32 EntryPoint);
	void OnAmmoCountChanged();
	void Muzzle_Play_Reload_FX(EFortReloadFXState Selection);
	void ReceiveBeginPlay();
	void OnPlayWeaponFireFX(bool bPersistentFire);
	void Scale_Glow_Up__Event__EventFunc();
	void Scale_Glow_Up__UpdateFunc();
	void Scale_Glow_Up__FinishedFunc();
	void UserConstructionScript();
	void UpdateVisuals(bool Ammo_Check);
	void StopAndResetTimeline();
	void DisableAllVisuals();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Pistol_Zapper_C">();
	}
	static class AB_Pistol_Zapper_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Pistol_Zapper_C>();
	}
};
static_assert(alignof(AB_Pistol_Zapper_C) == 0x000004, "Wrong alignment on AB_Pistol_Zapper_C");
static_assert(sizeof(AB_Pistol_Zapper_C) == 0x0007D0, "Wrong size on AB_Pistol_Zapper_C");
static_assert(offsetof(AB_Pistol_Zapper_C, UberGraphFrame_B_Pistol_Zapper_C) == 0x000774, "Member 'AB_Pistol_Zapper_C::UberGraphFrame_B_Pistol_Zapper_C' has a wrong offset!");
static_assert(offsetof(AB_Pistol_Zapper_C, P_ZapZap_CoreReloadArcs_01) == 0x000778, "Member 'AB_Pistol_Zapper_C::P_ZapZap_CoreReloadArcs_01' has a wrong offset!");
static_assert(offsetof(AB_Pistol_Zapper_C, P_ZapZap_CoreReload_01) == 0x00077C, "Member 'AB_Pistol_Zapper_C::P_ZapZap_CoreReload_01' has a wrong offset!");
static_assert(offsetof(AB_Pistol_Zapper_C, P_ZapZap_Core_01) == 0x000780, "Member 'AB_Pistol_Zapper_C::P_ZapZap_Core_01' has a wrong offset!");
static_assert(offsetof(AB_Pistol_Zapper_C, Scale_Glow_Up_Size_D24648EE45B04D4B02AE1187715E1632) == 0x000784, "Member 'AB_Pistol_Zapper_C::Scale_Glow_Up_Size_D24648EE45B04D4B02AE1187715E1632' has a wrong offset!");
static_assert(offsetof(AB_Pistol_Zapper_C, Scale_Glow_Up_LERP_Particle_D24648EE45B04D4B02AE1187715E1632) == 0x000790, "Member 'AB_Pistol_Zapper_C::Scale_Glow_Up_LERP_Particle_D24648EE45B04D4B02AE1187715E1632' has a wrong offset!");
static_assert(offsetof(AB_Pistol_Zapper_C, Scale_Glow_Up_LERP_Color_D24648EE45B04D4B02AE1187715E1632) == 0x000794, "Member 'AB_Pistol_Zapper_C::Scale_Glow_Up_LERP_Color_D24648EE45B04D4B02AE1187715E1632' has a wrong offset!");
static_assert(offsetof(AB_Pistol_Zapper_C, Scale_Glow_Up__Direction_D24648EE45B04D4B02AE1187715E1632) == 0x000798, "Member 'AB_Pistol_Zapper_C::Scale_Glow_Up__Direction_D24648EE45B04D4B02AE1187715E1632' has a wrong offset!");
static_assert(offsetof(AB_Pistol_Zapper_C, Scale_Glow_Up) == 0x00079C, "Member 'AB_Pistol_Zapper_C::Scale_Glow_Up' has a wrong offset!");
static_assert(offsetof(AB_Pistol_Zapper_C, WeaponMesh_MID) == 0x0007A0, "Member 'AB_Pistol_Zapper_C::WeaponMesh_MID' has a wrong offset!");
static_assert(offsetof(AB_Pistol_Zapper_C, GlowColor_Charged) == 0x0007A4, "Member 'AB_Pistol_Zapper_C::GlowColor_Charged' has a wrong offset!");
static_assert(offsetof(AB_Pistol_Zapper_C, AmmoCountChangedBeUsed_) == 0x0007B4, "Member 'AB_Pistol_Zapper_C::AmmoCountChangedBeUsed_' has a wrong offset!");
static_assert(offsetof(AB_Pistol_Zapper_C, GetTimeToNextFire_B_Pistol_Zapper_C) == 0x0007B8, "Member 'AB_Pistol_Zapper_C::GetTimeToNextFire_B_Pistol_Zapper_C' has a wrong offset!");
static_assert(offsetof(AB_Pistol_Zapper_C, bAmmoCountDelay) == 0x0007BC, "Member 'AB_Pistol_Zapper_C::bAmmoCountDelay' has a wrong offset!");
static_assert(offsetof(AB_Pistol_Zapper_C, Core_Reload_Start_Speed) == 0x0007C0, "Member 'AB_Pistol_Zapper_C::Core_Reload_Start_Speed' has a wrong offset!");
static_assert(offsetof(AB_Pistol_Zapper_C, Core_Reload_End_Speed) == 0x0007C4, "Member 'AB_Pistol_Zapper_C::Core_Reload_End_Speed' has a wrong offset!");
static_assert(offsetof(AB_Pistol_Zapper_C, Core_Reload_Start_Spawn_Rate) == 0x0007C8, "Member 'AB_Pistol_Zapper_C::Core_Reload_Start_Spawn_Rate' has a wrong offset!");
static_assert(offsetof(AB_Pistol_Zapper_C, Core_Reload_End_Spawn_Rate) == 0x0007CC, "Member 'AB_Pistol_Zapper_C::Core_Reload_End_Spawn_Rate' has a wrong offset!");

}

#pragma pack(pop)
