#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Pistol_DragonGun

#include "Basic.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function B_Pistol_DragonGun.B_Pistol_DragonGun_C.ExecuteUbergraph_B_Pistol_DragonGun
// 0x0008 (0x0008 - 0x0000)
struct B_Pistol_DragonGun_C_ExecuteUbergraph_B_Pistol_DragonGun final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_Condition;                            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Pistol_DragonGun_C_ExecuteUbergraph_B_Pistol_DragonGun) == 0x000004, "Wrong alignment on B_Pistol_DragonGun_C_ExecuteUbergraph_B_Pistol_DragonGun");
static_assert(sizeof(B_Pistol_DragonGun_C_ExecuteUbergraph_B_Pistol_DragonGun) == 0x000008, "Wrong size on B_Pistol_DragonGun_C_ExecuteUbergraph_B_Pistol_DragonGun");
static_assert(offsetof(B_Pistol_DragonGun_C_ExecuteUbergraph_B_Pistol_DragonGun, EntryPoint) == 0x000000, "Member 'B_Pistol_DragonGun_C_ExecuteUbergraph_B_Pistol_DragonGun::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Pistol_DragonGun_C_ExecuteUbergraph_B_Pistol_DragonGun, K2Node_Event_Condition) == 0x000004, "Member 'B_Pistol_DragonGun_C_ExecuteUbergraph_B_Pistol_DragonGun::K2Node_Event_Condition' has a wrong offset!");

// Function B_Pistol_DragonGun.B_Pistol_DragonGun_C.Muzzle Flash FX
// 0x0001 (0x0001 - 0x0000)
struct B_Pistol_DragonGun_C_Muzzle_Flash_FX final
{
public:
	bool                                          Condition;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Pistol_DragonGun_C_Muzzle_Flash_FX) == 0x000001, "Wrong alignment on B_Pistol_DragonGun_C_Muzzle_Flash_FX");
static_assert(sizeof(B_Pistol_DragonGun_C_Muzzle_Flash_FX) == 0x000001, "Wrong size on B_Pistol_DragonGun_C_Muzzle_Flash_FX");
static_assert(offsetof(B_Pistol_DragonGun_C_Muzzle_Flash_FX, Condition) == 0x000000, "Member 'B_Pistol_DragonGun_C_Muzzle_Flash_FX::Condition' has a wrong offset!");

}

#pragma pack(pop)
