#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Pistol_DragonGun

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "B_Pistol_Generic_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass B_Pistol_DragonGun.B_Pistol_DragonGun_C
// 0x000C (0x0780 - 0x0774)
class AB_Pistol_DragonGun_C final : public AB_Pistol_Generic_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_B_Pistol_DragonGun_C;               // 0x0774(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               P_DragonPistol_NostrilSmoke_01_R;                  // 0x0778(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UParticleSystemComponent*               P_DragonPistol_NostrilSmoke_01_L;                  // 0x077C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)

public:
	void ExecuteUbergraph_B_Pistol_DragonGun(int32 EntryPoint);
	void Muzzle_Flash_FX(bool Condition);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Pistol_DragonGun_C">();
	}
	static class AB_Pistol_DragonGun_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Pistol_DragonGun_C>();
	}
};
static_assert(alignof(AB_Pistol_DragonGun_C) == 0x000004, "Wrong alignment on AB_Pistol_DragonGun_C");
static_assert(sizeof(AB_Pistol_DragonGun_C) == 0x000780, "Wrong size on AB_Pistol_DragonGun_C");
static_assert(offsetof(AB_Pistol_DragonGun_C, UberGraphFrame_B_Pistol_DragonGun_C) == 0x000774, "Member 'AB_Pistol_DragonGun_C::UberGraphFrame_B_Pistol_DragonGun_C' has a wrong offset!");
static_assert(offsetof(AB_Pistol_DragonGun_C, P_DragonPistol_NostrilSmoke_01_R) == 0x000778, "Member 'AB_Pistol_DragonGun_C::P_DragonPistol_NostrilSmoke_01_R' has a wrong offset!");
static_assert(offsetof(AB_Pistol_DragonGun_C, P_DragonPistol_NostrilSmoke_01_L) == 0x00077C, "Member 'AB_Pistol_DragonGun_C::P_DragonPistol_NostrilSmoke_01_L' has a wrong offset!");

}

#pragma pack(pop)
