#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Pistol_Plasma

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function B_Pistol_Plasma.B_Pistol_Plasma_C.ExecuteUbergraph_B_Pistol_Plasma
// 0x0008 (0x0008 - 0x0000)
struct B_Pistol_Plasma_C_ExecuteUbergraph_B_Pistol_Plasma final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bPersistentFire;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortReloadFXState                            K2Node_Event_ReloadStage;                          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Pistol_Plasma_C_ExecuteUbergraph_B_Pistol_Plasma) == 0x000004, "Wrong alignment on B_Pistol_Plasma_C_ExecuteUbergraph_B_Pistol_Plasma");
static_assert(sizeof(B_Pistol_Plasma_C_ExecuteUbergraph_B_Pistol_Plasma) == 0x000008, "Wrong size on B_Pistol_Plasma_C_ExecuteUbergraph_B_Pistol_Plasma");
static_assert(offsetof(B_Pistol_Plasma_C_ExecuteUbergraph_B_Pistol_Plasma, EntryPoint) == 0x000000, "Member 'B_Pistol_Plasma_C_ExecuteUbergraph_B_Pistol_Plasma::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Pistol_Plasma_C_ExecuteUbergraph_B_Pistol_Plasma, K2Node_Event_bPersistentFire) == 0x000004, "Member 'B_Pistol_Plasma_C_ExecuteUbergraph_B_Pistol_Plasma::K2Node_Event_bPersistentFire' has a wrong offset!");
static_assert(offsetof(B_Pistol_Plasma_C_ExecuteUbergraph_B_Pistol_Plasma, K2Node_Event_ReloadStage) == 0x000005, "Member 'B_Pistol_Plasma_C_ExecuteUbergraph_B_Pistol_Plasma::K2Node_Event_ReloadStage' has a wrong offset!");

// Function B_Pistol_Plasma.B_Pistol_Plasma_C.OnPlayReloadFX
// 0x0001 (0x0001 - 0x0000)
struct B_Pistol_Plasma_C_OnPlayReloadFX final
{
public:
	EFortReloadFXState                            ReloadStage;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Pistol_Plasma_C_OnPlayReloadFX) == 0x000001, "Wrong alignment on B_Pistol_Plasma_C_OnPlayReloadFX");
static_assert(sizeof(B_Pistol_Plasma_C_OnPlayReloadFX) == 0x000001, "Wrong size on B_Pistol_Plasma_C_OnPlayReloadFX");
static_assert(offsetof(B_Pistol_Plasma_C_OnPlayReloadFX, ReloadStage) == 0x000000, "Member 'B_Pistol_Plasma_C_OnPlayReloadFX::ReloadStage' has a wrong offset!");

// Function B_Pistol_Plasma.B_Pistol_Plasma_C.OnPlayWeaponFireFX
// 0x0001 (0x0001 - 0x0000)
struct B_Pistol_Plasma_C_OnPlayWeaponFireFX final
{
public:
	bool                                          bPersistentFire;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Pistol_Plasma_C_OnPlayWeaponFireFX) == 0x000001, "Wrong alignment on B_Pistol_Plasma_C_OnPlayWeaponFireFX");
static_assert(sizeof(B_Pistol_Plasma_C_OnPlayWeaponFireFX) == 0x000001, "Wrong size on B_Pistol_Plasma_C_OnPlayWeaponFireFX");
static_assert(offsetof(B_Pistol_Plasma_C_OnPlayWeaponFireFX, bPersistentFire) == 0x000000, "Member 'B_Pistol_Plasma_C_OnPlayWeaponFireFX::bPersistentFire' has a wrong offset!");

// Function B_Pistol_Plasma.B_Pistol_Plasma_C.UserConstructionScript
// 0x0004 (0x0004 - 0x0000)
struct B_Pistol_Plasma_C_UserConstructionScript final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Pistol_Plasma_C_UserConstructionScript) == 0x000004, "Wrong alignment on B_Pistol_Plasma_C_UserConstructionScript");
static_assert(sizeof(B_Pistol_Plasma_C_UserConstructionScript) == 0x000004, "Wrong size on B_Pistol_Plasma_C_UserConstructionScript");
static_assert(offsetof(B_Pistol_Plasma_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000000, "Member 'B_Pistol_Plasma_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

// Function B_Pistol_Plasma.B_Pistol_Plasma_C.SetAmmoBarVariables
// 0x0034 (0x0034 - 0x0000)
struct B_Pistol_Plasma_C_SetAmmoBarVariables final
{
public:
	int32                                         CallFunc_GetRemainingAmmo_ReturnValue;             // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetBulletsPerClip_ReturnValue;            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetBulletsPerClip_ReturnValue2;           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue2;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue3;             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue4;             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue2;           // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue2;         // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetMagazineAmmoCount_ReturnValue;         // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Pistol_Plasma_C_SetAmmoBarVariables) == 0x000004, "Wrong alignment on B_Pistol_Plasma_C_SetAmmoBarVariables");
static_assert(sizeof(B_Pistol_Plasma_C_SetAmmoBarVariables) == 0x000034, "Wrong size on B_Pistol_Plasma_C_SetAmmoBarVariables");
static_assert(offsetof(B_Pistol_Plasma_C_SetAmmoBarVariables, CallFunc_GetRemainingAmmo_ReturnValue) == 0x000000, "Member 'B_Pistol_Plasma_C_SetAmmoBarVariables::CallFunc_GetRemainingAmmo_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pistol_Plasma_C_SetAmmoBarVariables, CallFunc_GetBulletsPerClip_ReturnValue) == 0x000004, "Member 'B_Pistol_Plasma_C_SetAmmoBarVariables::CallFunc_GetBulletsPerClip_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pistol_Plasma_C_SetAmmoBarVariables, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000008, "Member 'B_Pistol_Plasma_C_SetAmmoBarVariables::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pistol_Plasma_C_SetAmmoBarVariables, CallFunc_Conv_IntToFloat_ReturnValue) == 0x00000C, "Member 'B_Pistol_Plasma_C_SetAmmoBarVariables::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pistol_Plasma_C_SetAmmoBarVariables, CallFunc_GetBulletsPerClip_ReturnValue2) == 0x000010, "Member 'B_Pistol_Plasma_C_SetAmmoBarVariables::CallFunc_GetBulletsPerClip_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Pistol_Plasma_C_SetAmmoBarVariables, CallFunc_Conv_IntToFloat_ReturnValue2) == 0x000014, "Member 'B_Pistol_Plasma_C_SetAmmoBarVariables::CallFunc_Conv_IntToFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Pistol_Plasma_C_SetAmmoBarVariables, CallFunc_Conv_IntToFloat_ReturnValue3) == 0x000018, "Member 'B_Pistol_Plasma_C_SetAmmoBarVariables::CallFunc_Conv_IntToFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(B_Pistol_Plasma_C_SetAmmoBarVariables, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00001C, "Member 'B_Pistol_Plasma_C_SetAmmoBarVariables::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pistol_Plasma_C_SetAmmoBarVariables, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000020, "Member 'B_Pistol_Plasma_C_SetAmmoBarVariables::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pistol_Plasma_C_SetAmmoBarVariables, CallFunc_Conv_IntToFloat_ReturnValue4) == 0x000024, "Member 'B_Pistol_Plasma_C_SetAmmoBarVariables::CallFunc_Conv_IntToFloat_ReturnValue4' has a wrong offset!");
static_assert(offsetof(B_Pistol_Plasma_C_SetAmmoBarVariables, CallFunc_Divide_FloatFloat_ReturnValue2) == 0x000028, "Member 'B_Pistol_Plasma_C_SetAmmoBarVariables::CallFunc_Divide_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Pistol_Plasma_C_SetAmmoBarVariables, CallFunc_Subtract_FloatFloat_ReturnValue2) == 0x00002C, "Member 'B_Pistol_Plasma_C_SetAmmoBarVariables::CallFunc_Subtract_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Pistol_Plasma_C_SetAmmoBarVariables, CallFunc_GetMagazineAmmoCount_ReturnValue) == 0x000030, "Member 'B_Pistol_Plasma_C_SetAmmoBarVariables::CallFunc_GetMagazineAmmoCount_ReturnValue' has a wrong offset!");

}

#pragma pack(pop)
