#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Pistol_Plasma

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "B_Ranged_Generic_classes.hpp"
#include "FortniteGame_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass B_Pistol_Plasma.B_Pistol_Plasma_C
// 0x0058 (0x07CC - 0x0774)
class AB_Pistol_Plasma_C final : public AB_Ranged_Generic_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_B_Pistol_Plasma_C;                  // 0x0774(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	struct FDataTableRowHandle                    DataRow;                                           // 0x0778(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UMaterialInstanceDynamic*               ScreenMat;                                         // 0x0784(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FLinearColor                           Screen_Empty_Color__Light_;                        // 0x0788(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           Screen_Reload_Color__Light_;                       // 0x0798(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           Screen_Full_Color__Light_;                         // 0x07A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CurrentClipCount;                                  // 0x07B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	int32                                         PreviousClipCount;                                 // 0x07BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         ScaleBarStart;                                     // 0x07C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         ScaleBarEnd;                                       // 0x07C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsEmpty_;                                          // 0x07C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          JustReloaded_;                                     // 0x07C9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_B_Pistol_Plasma(int32 EntryPoint);
	void OnPlayReloadFX(EFortReloadFXState ReloadStage);
	void OnPlayWeaponFireFX(bool bPersistentFire);
	void ReceiveBeginPlay();
	void UserConstructionScript();
	void SetAmmoBarVariables();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Pistol_Plasma_C">();
	}
	static class AB_Pistol_Plasma_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Pistol_Plasma_C>();
	}
};
static_assert(alignof(AB_Pistol_Plasma_C) == 0x000004, "Wrong alignment on AB_Pistol_Plasma_C");
static_assert(sizeof(AB_Pistol_Plasma_C) == 0x0007CC, "Wrong size on AB_Pistol_Plasma_C");
static_assert(offsetof(AB_Pistol_Plasma_C, UberGraphFrame_B_Pistol_Plasma_C) == 0x000774, "Member 'AB_Pistol_Plasma_C::UberGraphFrame_B_Pistol_Plasma_C' has a wrong offset!");
static_assert(offsetof(AB_Pistol_Plasma_C, DataRow) == 0x000778, "Member 'AB_Pistol_Plasma_C::DataRow' has a wrong offset!");
static_assert(offsetof(AB_Pistol_Plasma_C, ScreenMat) == 0x000784, "Member 'AB_Pistol_Plasma_C::ScreenMat' has a wrong offset!");
static_assert(offsetof(AB_Pistol_Plasma_C, Screen_Empty_Color__Light_) == 0x000788, "Member 'AB_Pistol_Plasma_C::Screen_Empty_Color__Light_' has a wrong offset!");
static_assert(offsetof(AB_Pistol_Plasma_C, Screen_Reload_Color__Light_) == 0x000798, "Member 'AB_Pistol_Plasma_C::Screen_Reload_Color__Light_' has a wrong offset!");
static_assert(offsetof(AB_Pistol_Plasma_C, Screen_Full_Color__Light_) == 0x0007A8, "Member 'AB_Pistol_Plasma_C::Screen_Full_Color__Light_' has a wrong offset!");
static_assert(offsetof(AB_Pistol_Plasma_C, CurrentClipCount) == 0x0007B8, "Member 'AB_Pistol_Plasma_C::CurrentClipCount' has a wrong offset!");
static_assert(offsetof(AB_Pistol_Plasma_C, PreviousClipCount) == 0x0007BC, "Member 'AB_Pistol_Plasma_C::PreviousClipCount' has a wrong offset!");
static_assert(offsetof(AB_Pistol_Plasma_C, ScaleBarStart) == 0x0007C0, "Member 'AB_Pistol_Plasma_C::ScaleBarStart' has a wrong offset!");
static_assert(offsetof(AB_Pistol_Plasma_C, ScaleBarEnd) == 0x0007C4, "Member 'AB_Pistol_Plasma_C::ScaleBarEnd' has a wrong offset!");
static_assert(offsetof(AB_Pistol_Plasma_C, IsEmpty_) == 0x0007C8, "Member 'AB_Pistol_Plasma_C::IsEmpty_' has a wrong offset!");
static_assert(offsetof(AB_Pistol_Plasma_C, JustReloaded_) == 0x0007C9, "Member 'AB_Pistol_Plasma_C::JustReloaded_' has a wrong offset!");

}

#pragma pack(pop)
