#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Placement_Track

#include "Basic.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function B_Placement_Track.B_Placement_Track_C.ExecuteUbergraph_B_Placement_Track
// 0x000C (0x000C - 0x0000)
struct B_Placement_Track_C_ExecuteUbergraph_B_Placement_Track final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bSafeToPlace;                         // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Placement_Track_C_ExecuteUbergraph_B_Placement_Track) == 0x000004, "Wrong alignment on B_Placement_Track_C_ExecuteUbergraph_B_Placement_Track");
static_assert(sizeof(B_Placement_Track_C_ExecuteUbergraph_B_Placement_Track) == 0x00000C, "Wrong size on B_Placement_Track_C_ExecuteUbergraph_B_Placement_Track");
static_assert(offsetof(B_Placement_Track_C_ExecuteUbergraph_B_Placement_Track, EntryPoint) == 0x000000, "Member 'B_Placement_Track_C_ExecuteUbergraph_B_Placement_Track::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Placement_Track_C_ExecuteUbergraph_B_Placement_Track, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'B_Placement_Track_C_ExecuteUbergraph_B_Placement_Track::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(B_Placement_Track_C_ExecuteUbergraph_B_Placement_Track, K2Node_Event_bSafeToPlace) == 0x000008, "Member 'B_Placement_Track_C_ExecuteUbergraph_B_Placement_Track::K2Node_Event_bSafeToPlace' has a wrong offset!");

// Function B_Placement_Track.B_Placement_Track_C.OnUpdateVisuals
// 0x0008 (0x0008 - 0x0000)
struct B_Placement_Track_C_OnUpdateVisuals final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bSafeToPlace;                                      // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Placement_Track_C_OnUpdateVisuals) == 0x000004, "Wrong alignment on B_Placement_Track_C_OnUpdateVisuals");
static_assert(sizeof(B_Placement_Track_C_OnUpdateVisuals) == 0x000008, "Wrong size on B_Placement_Track_C_OnUpdateVisuals");
static_assert(offsetof(B_Placement_Track_C_OnUpdateVisuals, DeltaSeconds) == 0x000000, "Member 'B_Placement_Track_C_OnUpdateVisuals::DeltaSeconds' has a wrong offset!");
static_assert(offsetof(B_Placement_Track_C_OnUpdateVisuals, bSafeToPlace) == 0x000004, "Member 'B_Placement_Track_C_OnUpdateVisuals::bSafeToPlace' has a wrong offset!");

// Function B_Placement_Track.B_Placement_Track_C.UserConstructionScript
// 0x0010 (0x0010 - 0x0000)
struct B_Placement_Track_C_UserConstructionScript final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_CreatePreviewMID_ReturnValue;             // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UMaterialInstanceDynamic*               CallFunc_CreatePreviewMID_ReturnValue2;            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UMaterialInstanceDynamic*               CallFunc_CreatePreviewMID_ReturnValue3;            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UMaterialInstanceDynamic*               CallFunc_CreatePreviewMID_ReturnValue4;            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Placement_Track_C_UserConstructionScript) == 0x000004, "Wrong alignment on B_Placement_Track_C_UserConstructionScript");
static_assert(sizeof(B_Placement_Track_C_UserConstructionScript) == 0x000010, "Wrong size on B_Placement_Track_C_UserConstructionScript");
static_assert(offsetof(B_Placement_Track_C_UserConstructionScript, CallFunc_CreatePreviewMID_ReturnValue) == 0x000000, "Member 'B_Placement_Track_C_UserConstructionScript::CallFunc_CreatePreviewMID_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Placement_Track_C_UserConstructionScript, CallFunc_CreatePreviewMID_ReturnValue2) == 0x000004, "Member 'B_Placement_Track_C_UserConstructionScript::CallFunc_CreatePreviewMID_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Placement_Track_C_UserConstructionScript, CallFunc_CreatePreviewMID_ReturnValue3) == 0x000008, "Member 'B_Placement_Track_C_UserConstructionScript::CallFunc_CreatePreviewMID_ReturnValue3' has a wrong offset!");
static_assert(offsetof(B_Placement_Track_C_UserConstructionScript, CallFunc_CreatePreviewMID_ReturnValue4) == 0x00000C, "Member 'B_Placement_Track_C_UserConstructionScript::CallFunc_CreatePreviewMID_ReturnValue4' has a wrong offset!");

}

#pragma pack(pop)
