#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Placement_Track

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass B_Placement_Track.B_Placement_Track_C
// 0x001C (0x03CC - 0x03B0)
class AB_Placement_Track_C final : public AFortTrackPreview
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03B0(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   TrackMesh2;                                        // 0x03B4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   TrackMesh1;                                        // 0x03B8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UBoxComponent*                          PlacementCollision2;                               // 0x03BC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UBoxComponent*                          PlacementCollision1;                               // 0x03C0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class USceneComponent*                        Root;                                              // 0x03C4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UTexture2D*                             PreviewTex;                                        // 0x03C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_B_Placement_Track(int32 EntryPoint);
	void OnUpdateVisuals(float DeltaSeconds, bool bSafeToPlace);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Placement_Track_C">();
	}
	static class AB_Placement_Track_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Placement_Track_C>();
	}
};
static_assert(alignof(AB_Placement_Track_C) == 0x000004, "Wrong alignment on AB_Placement_Track_C");
static_assert(sizeof(AB_Placement_Track_C) == 0x0003CC, "Wrong size on AB_Placement_Track_C");
static_assert(offsetof(AB_Placement_Track_C, UberGraphFrame) == 0x0003B0, "Member 'AB_Placement_Track_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_Placement_Track_C, TrackMesh2) == 0x0003B4, "Member 'AB_Placement_Track_C::TrackMesh2' has a wrong offset!");
static_assert(offsetof(AB_Placement_Track_C, TrackMesh1) == 0x0003B8, "Member 'AB_Placement_Track_C::TrackMesh1' has a wrong offset!");
static_assert(offsetof(AB_Placement_Track_C, PlacementCollision2) == 0x0003BC, "Member 'AB_Placement_Track_C::PlacementCollision2' has a wrong offset!");
static_assert(offsetof(AB_Placement_Track_C, PlacementCollision1) == 0x0003C0, "Member 'AB_Placement_Track_C::PlacementCollision1' has a wrong offset!");
static_assert(offsetof(AB_Placement_Track_C, Root) == 0x0003C4, "Member 'AB_Placement_Track_C::Root' has a wrong offset!");
static_assert(offsetof(AB_Placement_Track_C, PreviewTex) == 0x0003C8, "Member 'AB_Placement_Track_C::PreviewTex' has a wrong offset!");

}

#pragma pack(pop)
