#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Prj_M80

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass B_Prj_M80.B_Prj_M80_C
// 0x0028 (0x0440 - 0x0418)
class AB_Prj_M80_C final : public AFortProjectileBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0418(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        Cue_Fuse_Loop_Sound;                               // 0x041C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UParticleSystemComponent*               P_M80Projectile;                                   // 0x0420(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	struct FVector                                HitLocation;                                       // 0x0424(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UParticleSystem*                        P_ImpactEffects;                                   // 0x0430(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class USoundBase*                             Cue_ExplosionSound;                                // 0x0434(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         Explo_Delay_Min;                                   // 0x0438(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         Explo_Delay_Max;                                   // 0x043C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_B_Prj_M80(int32 EntryPoint);
	void ReceiveBeginPlay();
	void OnExploded(const TArray<class AActor*>& HitActors, const TArray<struct FHitResult>& HitResults);
	void ReceiveHit(class UPrimitiveComponent* MyComp, class AActor* Other, class UPrimitiveComponent* OtherComp, bool bSelfMoved, const struct FVector& HitLocation_0, const struct FVector& HitNormal, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Prj_M80_C">();
	}
	static class AB_Prj_M80_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Prj_M80_C>();
	}
};
static_assert(alignof(AB_Prj_M80_C) == 0x000004, "Wrong alignment on AB_Prj_M80_C");
static_assert(sizeof(AB_Prj_M80_C) == 0x000440, "Wrong size on AB_Prj_M80_C");
static_assert(offsetof(AB_Prj_M80_C, UberGraphFrame) == 0x000418, "Member 'AB_Prj_M80_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_Prj_M80_C, Cue_Fuse_Loop_Sound) == 0x00041C, "Member 'AB_Prj_M80_C::Cue_Fuse_Loop_Sound' has a wrong offset!");
static_assert(offsetof(AB_Prj_M80_C, P_M80Projectile) == 0x000420, "Member 'AB_Prj_M80_C::P_M80Projectile' has a wrong offset!");
static_assert(offsetof(AB_Prj_M80_C, HitLocation) == 0x000424, "Member 'AB_Prj_M80_C::HitLocation' has a wrong offset!");
static_assert(offsetof(AB_Prj_M80_C, P_ImpactEffects) == 0x000430, "Member 'AB_Prj_M80_C::P_ImpactEffects' has a wrong offset!");
static_assert(offsetof(AB_Prj_M80_C, Cue_ExplosionSound) == 0x000434, "Member 'AB_Prj_M80_C::Cue_ExplosionSound' has a wrong offset!");
static_assert(offsetof(AB_Prj_M80_C, Explo_Delay_Min) == 0x000438, "Member 'AB_Prj_M80_C::Explo_Delay_Min' has a wrong offset!");
static_assert(offsetof(AB_Prj_M80_C, Explo_Delay_Max) == 0x00043C, "Member 'AB_Prj_M80_C::Explo_Delay_Max' has a wrong offset!");

}

#pragma pack(pop)
