#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Prj_SpacePistol_Laser

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "SpacePistolStruct_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function B_Prj_SpacePistol_Laser.B_Prj_SpacePistol_Laser_C.ExecuteUbergraph_B_Prj_SpacePistol_Laser
// 0x04E0 (0x04E0 - 0x0000)
struct B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_Event_OtherActor;                           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEffectContextHandle           CallFunc_MakeEffectContext_ReturnValue;            // 0x0020(0x000C)()
	struct FGameplayCueParameters                 K2Node_MakeStruct_GameplayCueParameters;           // 0x002C(0x0084)()
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x00B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x00C4(0x0004)()
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortTeamAffiliation                          CallFunc_GetTeamAffiliation_ReturnValue;           // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CE[0x2];                                       // 0x00CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_Event_HitActors;                            // 0x00D0(0x000C)(ConstParm, ZeroConstructor, ReferenceParm)
	TArray<struct FHitResult>                     K2Node_Event_HitResults;                           // 0x00DC(0x000C)(ConstParm, ZeroConstructor, ReferenceParm, ContainsInstancedReference)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_Array_Get_Item;                           // 0x00EC(0x0080)(ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_172[0x2];                                      // 0x0172(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0178(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0184(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0190(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x019C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x01B4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x01C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x01CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D9[0x3];                                      // 0x01D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotFromX_ReturnValue;                 // 0x01DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x01E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotFromX_ReturnValue2;                // 0x01F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x0204(0x0080)(ConstParm, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit2;             // 0x0284(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap2;          // 0x0285(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_286[0x2];                                      // 0x0286(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time2;                     // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_Location2;                 // 0x028C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint2;              // 0x0298(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_Normal2;                   // 0x02A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal2;             // 0x02B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat2;                  // 0x02BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BreakHitResult_HitActor2;                 // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent2;             // 0x02C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   CallFunc_BreakHitResult_HitBoneName2;              // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_BreakHitResult_HitItem2;                  // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_TraceStart2;               // 0x02D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd2;                 // 0x02E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x02EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotFromX_ReturnValue3;                // 0x02F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0304(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue2;         // 0x0308(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0314(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_315[0x3];                                      // 0x0315(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotFromX_ReturnValue4;                // 0x0318(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0324(0x0080)(ContainsInstancedReference)
	uint8                                         Pad_3A4[0xC];                                      // 0x03A4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x03B0(0x0030)(IsPlainOldData, NoDestructor)
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x03E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue2;     // 0x03E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F1[0x3];                                      // 0x03F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x03F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0400(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x040C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotFromX_ReturnValue5;                // 0x0410(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult2;      // 0x041C(0x0080)(ContainsInstancedReference)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x049C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSpacePistolStruct                     K2Node_MakeStruct_SpacePistolStruct;               // 0x04A0(0x000C)()
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x04AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x04B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue2;           // 0x04B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B5[0x3];                                      // 0x04B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x04B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue2;       // 0x04C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue3;           // 0x04D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser) == 0x000010, "Wrong alignment on B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser");
static_assert(sizeof(B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser) == 0x0004E0, "Wrong size on B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser, EntryPoint) == 0x000000, "Member 'B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser, Temp_int_Array_Index_Variable) == 0x000008, "Member 'B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser, K2Node_Event_OtherActor) == 0x000010, "Member 'B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser::K2Node_Event_OtherActor' has a wrong offset!");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser, K2Node_DynamicCast_AsFort_Pawn) == 0x000014, "Member 'B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser::K2Node_DynamicCast_AsFort_Pawn' has a wrong offset!");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000019, "Member 'B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x00001C, "Member 'B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser, CallFunc_MakeEffectContext_ReturnValue) == 0x000020, "Member 'B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser::CallFunc_MakeEffectContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser, K2Node_MakeStruct_GameplayCueParameters) == 0x00002C, "Member 'B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser::K2Node_MakeStruct_GameplayCueParameters' has a wrong offset!");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser, CallFunc_Add_IntInt_ReturnValue2) == 0x0000B0, "Member 'B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser, CallFunc_HasAuthority_ReturnValue) == 0x0000B4, "Member 'B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0000B8, "Member 'B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x0000C4, "Member 'B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser, CallFunc_SpawnSoundAttached_ReturnValue) == 0x0000C8, "Member 'B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser, CallFunc_GetTeamAffiliation_ReturnValue) == 0x0000CC, "Member 'B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser::CallFunc_GetTeamAffiliation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser, K2Node_SwitchEnum_CmpSuccess) == 0x0000CD, "Member 'B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser, K2Node_Event_HitActors) == 0x0000D0, "Member 'B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser::K2Node_Event_HitActors' has a wrong offset!");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser, K2Node_Event_HitResults) == 0x0000DC, "Member 'B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser::K2Node_Event_HitResults' has a wrong offset!");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser, K2Node_Event_DeltaSeconds) == 0x0000E8, "Member 'B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser, CallFunc_Array_Get_Item) == 0x0000EC, "Member 'B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser, CallFunc_Array_Length_ReturnValue) == 0x00016C, "Member 'B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser, CallFunc_BreakHitResult_bBlockingHit) == 0x000170, "Member 'B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser, CallFunc_BreakHitResult_bInitialOverlap) == 0x000171, "Member 'B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser, CallFunc_BreakHitResult_Time) == 0x000174, "Member 'B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser, CallFunc_BreakHitResult_Location) == 0x000178, "Member 'B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser, CallFunc_BreakHitResult_ImpactPoint) == 0x000184, "Member 'B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser, CallFunc_BreakHitResult_Normal) == 0x000190, "Member 'B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser, CallFunc_BreakHitResult_ImpactNormal) == 0x00019C, "Member 'B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser, CallFunc_BreakHitResult_PhysMat) == 0x0001A8, "Member 'B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser, CallFunc_BreakHitResult_HitActor) == 0x0001AC, "Member 'B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser, CallFunc_BreakHitResult_HitComponent) == 0x0001B0, "Member 'B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser, CallFunc_BreakHitResult_HitBoneName) == 0x0001B4, "Member 'B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser, CallFunc_BreakHitResult_HitItem) == 0x0001BC, "Member 'B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser, CallFunc_BreakHitResult_TraceStart) == 0x0001C0, "Member 'B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser, CallFunc_BreakHitResult_TraceEnd) == 0x0001CC, "Member 'B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser, CallFunc_Less_IntInt_ReturnValue) == 0x0001D8, "Member 'B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser, CallFunc_MakeRotFromX_ReturnValue) == 0x0001DC, "Member 'B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser::CallFunc_MakeRotFromX_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser, CallFunc_MakeVector_ReturnValue) == 0x0001E8, "Member 'B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser, CallFunc_VSize_ReturnValue) == 0x0001F4, "Member 'B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser, CallFunc_MakeRotFromX_ReturnValue2) == 0x0001F8, "Member 'B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser::CallFunc_MakeRotFromX_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser, K2Node_Event_Hit) == 0x000204, "Member 'B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser, CallFunc_BreakHitResult_bBlockingHit2) == 0x000284, "Member 'B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser::CallFunc_BreakHitResult_bBlockingHit2' has a wrong offset!");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser, CallFunc_BreakHitResult_bInitialOverlap2) == 0x000285, "Member 'B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser::CallFunc_BreakHitResult_bInitialOverlap2' has a wrong offset!");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser, CallFunc_BreakHitResult_Time2) == 0x000288, "Member 'B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser::CallFunc_BreakHitResult_Time2' has a wrong offset!");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser, CallFunc_BreakHitResult_Location2) == 0x00028C, "Member 'B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser::CallFunc_BreakHitResult_Location2' has a wrong offset!");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser, CallFunc_BreakHitResult_ImpactPoint2) == 0x000298, "Member 'B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser::CallFunc_BreakHitResult_ImpactPoint2' has a wrong offset!");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser, CallFunc_BreakHitResult_Normal2) == 0x0002A4, "Member 'B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser::CallFunc_BreakHitResult_Normal2' has a wrong offset!");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser, CallFunc_BreakHitResult_ImpactNormal2) == 0x0002B0, "Member 'B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser::CallFunc_BreakHitResult_ImpactNormal2' has a wrong offset!");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser, CallFunc_BreakHitResult_PhysMat2) == 0x0002BC, "Member 'B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser::CallFunc_BreakHitResult_PhysMat2' has a wrong offset!");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser, CallFunc_BreakHitResult_HitActor2) == 0x0002C0, "Member 'B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser::CallFunc_BreakHitResult_HitActor2' has a wrong offset!");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser, CallFunc_BreakHitResult_HitComponent2) == 0x0002C4, "Member 'B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser::CallFunc_BreakHitResult_HitComponent2' has a wrong offset!");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser, CallFunc_BreakHitResult_HitBoneName2) == 0x0002C8, "Member 'B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser::CallFunc_BreakHitResult_HitBoneName2' has a wrong offset!");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser, CallFunc_BreakHitResult_HitItem2) == 0x0002D0, "Member 'B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser::CallFunc_BreakHitResult_HitItem2' has a wrong offset!");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser, CallFunc_BreakHitResult_TraceStart2) == 0x0002D4, "Member 'B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser::CallFunc_BreakHitResult_TraceStart2' has a wrong offset!");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser, CallFunc_BreakHitResult_TraceEnd2) == 0x0002E0, "Member 'B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser::CallFunc_BreakHitResult_TraceEnd2' has a wrong offset!");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0002EC, "Member 'B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser, CallFunc_MakeRotFromX_ReturnValue3) == 0x0002F8, "Member 'B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser::CallFunc_MakeRotFromX_ReturnValue3' has a wrong offset!");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000304, "Member 'B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser, CallFunc_K2_GetActorLocation_ReturnValue2) == 0x000308, "Member 'B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser::CallFunc_K2_GetActorLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser, CallFunc_IsValid_ReturnValue) == 0x000314, "Member 'B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser, CallFunc_MakeRotFromX_ReturnValue4) == 0x000318, "Member 'B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser::CallFunc_MakeRotFromX_ReturnValue4' has a wrong offset!");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x000324, "Member 'B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser, CallFunc_MakeTransform_ReturnValue) == 0x0003B0, "Member 'B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser, CallFunc_AddComponent_ReturnValue) == 0x0003E0, "Member 'B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser, CallFunc_K2_GetComponentLocation_ReturnValue2) == 0x0003E4, "Member 'B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser::CallFunc_K2_GetComponentLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser, CallFunc_IsDedicatedServer_ReturnValue) == 0x0003F0, "Member 'B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0003F4, "Member 'B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser, CallFunc_Normal_ReturnValue) == 0x000400, "Member 'B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x00040C, "Member 'B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser, CallFunc_MakeRotFromX_ReturnValue5) == 0x000410, "Member 'B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser::CallFunc_MakeRotFromX_ReturnValue5' has a wrong offset!");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser, CallFunc_K2_SetWorldRotation_SweepHitResult2) == 0x00041C, "Member 'B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser::CallFunc_K2_SetWorldRotation_SweepHitResult2' has a wrong offset!");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x00049C, "Member 'B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser, K2Node_MakeStruct_SpacePistolStruct) == 0x0004A0, "Member 'B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser::K2Node_MakeStruct_SpacePistolStruct' has a wrong offset!");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser, CallFunc_Array_Add_ReturnValue) == 0x0004AC, "Member 'B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x0004B0, "Member 'B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser, CallFunc_IsDedicatedServer_ReturnValue2) == 0x0004B4, "Member 'B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser::CallFunc_IsDedicatedServer_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0004B8, "Member 'B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser, CallFunc_Subtract_VectorVector_ReturnValue2) == 0x0004C4, "Member 'B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser::CallFunc_Subtract_VectorVector_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser, CallFunc_IsDedicatedServer_ReturnValue3) == 0x0004D0, "Member 'B_Prj_SpacePistol_Laser_C_ExecuteUbergraph_B_Prj_SpacePistol_Laser::CallFunc_IsDedicatedServer_ReturnValue3' has a wrong offset!");

// Function B_Prj_SpacePistol_Laser.B_Prj_SpacePistol_Laser_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct B_Prj_SpacePistol_Laser_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Prj_SpacePistol_Laser_C_ReceiveTick) == 0x000004, "Wrong alignment on B_Prj_SpacePistol_Laser_C_ReceiveTick");
static_assert(sizeof(B_Prj_SpacePistol_Laser_C_ReceiveTick) == 0x000004, "Wrong size on B_Prj_SpacePistol_Laser_C_ReceiveTick");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'B_Prj_SpacePistol_Laser_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function B_Prj_SpacePistol_Laser.B_Prj_SpacePistol_Laser_C.ReceiveActorBeginOverlap
// 0x0004 (0x0004 - 0x0000)
struct B_Prj_SpacePistol_Laser_C_ReceiveActorBeginOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Prj_SpacePistol_Laser_C_ReceiveActorBeginOverlap) == 0x000004, "Wrong alignment on B_Prj_SpacePistol_Laser_C_ReceiveActorBeginOverlap");
static_assert(sizeof(B_Prj_SpacePistol_Laser_C_ReceiveActorBeginOverlap) == 0x000004, "Wrong size on B_Prj_SpacePistol_Laser_C_ReceiveActorBeginOverlap");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_ReceiveActorBeginOverlap, OtherActor) == 0x000000, "Member 'B_Prj_SpacePistol_Laser_C_ReceiveActorBeginOverlap::OtherActor' has a wrong offset!");

// Function B_Prj_SpacePistol_Laser.B_Prj_SpacePistol_Laser_C.OnExploded
// 0x0018 (0x0018 - 0x0000)
struct B_Prj_SpacePistol_Laser_C_OnExploded final
{
public:
	TArray<class AActor*>                         HitActors;                                         // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm)
	TArray<struct FHitResult>                     HitResults;                                        // 0x000C(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(B_Prj_SpacePistol_Laser_C_OnExploded) == 0x000004, "Wrong alignment on B_Prj_SpacePistol_Laser_C_OnExploded");
static_assert(sizeof(B_Prj_SpacePistol_Laser_C_OnExploded) == 0x000018, "Wrong size on B_Prj_SpacePistol_Laser_C_OnExploded");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_OnExploded, HitActors) == 0x000000, "Member 'B_Prj_SpacePistol_Laser_C_OnExploded::HitActors' has a wrong offset!");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_OnExploded, HitResults) == 0x00000C, "Member 'B_Prj_SpacePistol_Laser_C_OnExploded::HitResults' has a wrong offset!");

// Function B_Prj_SpacePistol_Laser.B_Prj_SpacePistol_Laser_C.OnBounce
// 0x0080 (0x0080 - 0x0000)
struct B_Prj_SpacePistol_Laser_C_OnBounce final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(B_Prj_SpacePistol_Laser_C_OnBounce) == 0x000004, "Wrong alignment on B_Prj_SpacePistol_Laser_C_OnBounce");
static_assert(sizeof(B_Prj_SpacePistol_Laser_C_OnBounce) == 0x000080, "Wrong size on B_Prj_SpacePistol_Laser_C_OnBounce");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_OnBounce, Hit) == 0x000000, "Member 'B_Prj_SpacePistol_Laser_C_OnBounce::Hit' has a wrong offset!");

// Function B_Prj_SpacePistol_Laser.B_Prj_SpacePistol_Laser_C.CalculateBeamDistance
// 0x0010 (0x0010 - 0x0000)
struct B_Prj_SpacePistol_Laser_C_CalculateBeamDistance final
{
public:
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Prj_SpacePistol_Laser_C_CalculateBeamDistance) == 0x000004, "Wrong alignment on B_Prj_SpacePistol_Laser_C_CalculateBeamDistance");
static_assert(sizeof(B_Prj_SpacePistol_Laser_C_CalculateBeamDistance) == 0x000010, "Wrong size on B_Prj_SpacePistol_Laser_C_CalculateBeamDistance");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_CalculateBeamDistance, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000000, "Member 'B_Prj_SpacePistol_Laser_C_CalculateBeamDistance::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_CalculateBeamDistance, CallFunc_VSize_ReturnValue) == 0x00000C, "Member 'B_Prj_SpacePistol_Laser_C_CalculateBeamDistance::CallFunc_VSize_ReturnValue' has a wrong offset!");

// Function B_Prj_SpacePistol_Laser.B_Prj_SpacePistol_Laser_C.KillOldStaticMesh
// 0x0068 (0x0068 - 0x0000)
struct B_Prj_SpacePistol_Laser_C_KillOldStaticMesh final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSpacePistolStruct                     CallFunc_Array_Get_Item;                           // 0x000C(0x000C)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Get_Item2;                          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSpacePistolStruct                     CallFunc_Array_Get_Item3;                          // 0x0030(0x000C)()
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpacePistolStruct                     K2Node_MakeStruct_SpacePistolStruct;               // 0x0054(0x000C)()
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Prj_SpacePistol_Laser_C_KillOldStaticMesh) == 0x000004, "Wrong alignment on B_Prj_SpacePistol_Laser_C_KillOldStaticMesh");
static_assert(sizeof(B_Prj_SpacePistol_Laser_C_KillOldStaticMesh) == 0x000068, "Wrong size on B_Prj_SpacePistol_Laser_C_KillOldStaticMesh");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_KillOldStaticMesh, Temp_int_Array_Index_Variable) == 0x000000, "Member 'B_Prj_SpacePistol_Laser_C_KillOldStaticMesh::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_KillOldStaticMesh, Temp_int_Variable) == 0x000004, "Member 'B_Prj_SpacePistol_Laser_C_KillOldStaticMesh::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(B_Prj_SpacePistol_Laser_C_KillOldStaticMesh, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'B_Prj_SpacePistol_Laser_C_KillOldStaticMesh::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
