#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Prj_PlasmaBall

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass B_Prj_PlasmaBall.B_Prj_PlasmaBall_C
// 0x0034 (0x044C - 0x0418)
class AB_Prj_PlasmaBall_C final : public AFortProjectileBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0418(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class USphereComponent*                       Radius_Sphere;                                     // 0x041C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UParticleSystemComponent*               P_Trail;                                           // 0x0420(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UMaterialInstanceDynamic*               Mine_Material;                                     // 0x0424(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class USoundBase*                             BottleRocketFireCue;                               // 0x0428(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UParticleSystem*                        P_Explosion;                                       // 0x042C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class USoundBase*                             ExplosionCue;                                      // 0x0430(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         Lifetime_Min;                                      // 0x0434(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         Lifetime_Max;                                      // 0x0438(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         RandomColor;                                       // 0x043C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                Death_Effects_Location;                            // 0x0440(0x000C)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)

public:
	void ExecuteUbergraph_B_Prj_PlasmaBall(int32 EntryPoint);
	void OnTouched(class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FHitResult& HitResult);
	void OnExploded(const TArray<class AActor*>& HitActors, const TArray<struct FHitResult>& HitResults);
	void ReceiveBeginPlay();
	void UserConstructionScript();
	void ChooseRandomColor();
	void SetTrailColor();
	void OnRep_DeathLocation();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Prj_PlasmaBall_C">();
	}
	static class AB_Prj_PlasmaBall_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Prj_PlasmaBall_C>();
	}
};
static_assert(alignof(AB_Prj_PlasmaBall_C) == 0x000004, "Wrong alignment on AB_Prj_PlasmaBall_C");
static_assert(sizeof(AB_Prj_PlasmaBall_C) == 0x00044C, "Wrong size on AB_Prj_PlasmaBall_C");
static_assert(offsetof(AB_Prj_PlasmaBall_C, UberGraphFrame) == 0x000418, "Member 'AB_Prj_PlasmaBall_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_Prj_PlasmaBall_C, Radius_Sphere) == 0x00041C, "Member 'AB_Prj_PlasmaBall_C::Radius_Sphere' has a wrong offset!");
static_assert(offsetof(AB_Prj_PlasmaBall_C, P_Trail) == 0x000420, "Member 'AB_Prj_PlasmaBall_C::P_Trail' has a wrong offset!");
static_assert(offsetof(AB_Prj_PlasmaBall_C, Mine_Material) == 0x000424, "Member 'AB_Prj_PlasmaBall_C::Mine_Material' has a wrong offset!");
static_assert(offsetof(AB_Prj_PlasmaBall_C, BottleRocketFireCue) == 0x000428, "Member 'AB_Prj_PlasmaBall_C::BottleRocketFireCue' has a wrong offset!");
static_assert(offsetof(AB_Prj_PlasmaBall_C, P_Explosion) == 0x00042C, "Member 'AB_Prj_PlasmaBall_C::P_Explosion' has a wrong offset!");
static_assert(offsetof(AB_Prj_PlasmaBall_C, ExplosionCue) == 0x000430, "Member 'AB_Prj_PlasmaBall_C::ExplosionCue' has a wrong offset!");
static_assert(offsetof(AB_Prj_PlasmaBall_C, Lifetime_Min) == 0x000434, "Member 'AB_Prj_PlasmaBall_C::Lifetime_Min' has a wrong offset!");
static_assert(offsetof(AB_Prj_PlasmaBall_C, Lifetime_Max) == 0x000438, "Member 'AB_Prj_PlasmaBall_C::Lifetime_Max' has a wrong offset!");
static_assert(offsetof(AB_Prj_PlasmaBall_C, RandomColor) == 0x00043C, "Member 'AB_Prj_PlasmaBall_C::RandomColor' has a wrong offset!");
static_assert(offsetof(AB_Prj_PlasmaBall_C, Death_Effects_Location) == 0x000440, "Member 'AB_Prj_PlasmaBall_C::Death_Effects_Location' has a wrong offset!");

}

#pragma pack(pop)
