#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Prj_TIOD

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function B_Prj_TIOD.B_Prj_TIOD_C.ExecuteUbergraph_B_Prj_TIOD
// 0x01E0 (0x01E0 - 0x0000)
struct B_Prj_TIOD_C_ExecuteUbergraph_B_Prj_TIOD final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue2;                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x0008(0x0080)(ConstParm, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A[0x2];                                       // 0x008A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x00CC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x00D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x00E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotFromX_ReturnValue;                 // 0x00F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_108[0x8];                                      // 0x0108(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0110(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_TransformLocation_ReturnValue;            // 0x0140(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x014C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0158(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0164(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0170(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_GetBaseAimRotation_ReturnValue;           // 0x0180(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue2;               // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Conv_RotatorToVector_ReturnValue;         // 0x0190(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_GetBaseAimRotation_ReturnValue2;          // 0x019C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x01A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X;                            // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Y;                            // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Z;                            // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue2;         // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue3;         // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x01CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Prj_TIOD_C_ExecuteUbergraph_B_Prj_TIOD) == 0x000010, "Wrong alignment on B_Prj_TIOD_C_ExecuteUbergraph_B_Prj_TIOD");
static_assert(sizeof(B_Prj_TIOD_C_ExecuteUbergraph_B_Prj_TIOD) == 0x0001E0, "Wrong size on B_Prj_TIOD_C_ExecuteUbergraph_B_Prj_TIOD");
static_assert(offsetof(B_Prj_TIOD_C_ExecuteUbergraph_B_Prj_TIOD, EntryPoint) == 0x000000, "Member 'B_Prj_TIOD_C_ExecuteUbergraph_B_Prj_TIOD::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Prj_TIOD_C_ExecuteUbergraph_B_Prj_TIOD, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'B_Prj_TIOD_C_ExecuteUbergraph_B_Prj_TIOD::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_TIOD_C_ExecuteUbergraph_B_Prj_TIOD, Temp_bool_Has_Been_Initd_Variable) == 0x000005, "Member 'B_Prj_TIOD_C_ExecuteUbergraph_B_Prj_TIOD::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(B_Prj_TIOD_C_ExecuteUbergraph_B_Prj_TIOD, CallFunc_HasAuthority_ReturnValue2) == 0x000006, "Member 'B_Prj_TIOD_C_ExecuteUbergraph_B_Prj_TIOD::CallFunc_HasAuthority_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Prj_TIOD_C_ExecuteUbergraph_B_Prj_TIOD, K2Node_Event_Hit) == 0x000008, "Member 'B_Prj_TIOD_C_ExecuteUbergraph_B_Prj_TIOD::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(B_Prj_TIOD_C_ExecuteUbergraph_B_Prj_TIOD, CallFunc_BreakHitResult_bBlockingHit) == 0x000088, "Member 'B_Prj_TIOD_C_ExecuteUbergraph_B_Prj_TIOD::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(B_Prj_TIOD_C_ExecuteUbergraph_B_Prj_TIOD, CallFunc_BreakHitResult_bInitialOverlap) == 0x000089, "Member 'B_Prj_TIOD_C_ExecuteUbergraph_B_Prj_TIOD::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(B_Prj_TIOD_C_ExecuteUbergraph_B_Prj_TIOD, CallFunc_BreakHitResult_Time) == 0x00008C, "Member 'B_Prj_TIOD_C_ExecuteUbergraph_B_Prj_TIOD::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(B_Prj_TIOD_C_ExecuteUbergraph_B_Prj_TIOD, CallFunc_BreakHitResult_Location) == 0x000090, "Member 'B_Prj_TIOD_C_ExecuteUbergraph_B_Prj_TIOD::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(B_Prj_TIOD_C_ExecuteUbergraph_B_Prj_TIOD, CallFunc_BreakHitResult_ImpactPoint) == 0x00009C, "Member 'B_Prj_TIOD_C_ExecuteUbergraph_B_Prj_TIOD::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(B_Prj_TIOD_C_ExecuteUbergraph_B_Prj_TIOD, CallFunc_BreakHitResult_Normal) == 0x0000A8, "Member 'B_Prj_TIOD_C_ExecuteUbergraph_B_Prj_TIOD::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(B_Prj_TIOD_C_ExecuteUbergraph_B_Prj_TIOD, CallFunc_BreakHitResult_ImpactNormal) == 0x0000B4, "Member 'B_Prj_TIOD_C_ExecuteUbergraph_B_Prj_TIOD::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(B_Prj_TIOD_C_ExecuteUbergraph_B_Prj_TIOD, CallFunc_BreakHitResult_PhysMat) == 0x0000C0, "Member 'B_Prj_TIOD_C_ExecuteUbergraph_B_Prj_TIOD::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(B_Prj_TIOD_C_ExecuteUbergraph_B_Prj_TIOD, CallFunc_BreakHitResult_HitActor) == 0x0000C4, "Member 'B_Prj_TIOD_C_ExecuteUbergraph_B_Prj_TIOD::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(B_Prj_TIOD_C_ExecuteUbergraph_B_Prj_TIOD, CallFunc_BreakHitResult_HitComponent) == 0x0000C8, "Member 'B_Prj_TIOD_C_ExecuteUbergraph_B_Prj_TIOD::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(B_Prj_TIOD_C_ExecuteUbergraph_B_Prj_TIOD, CallFunc_BreakHitResult_HitBoneName) == 0x0000CC, "Member 'B_Prj_TIOD_C_ExecuteUbergraph_B_Prj_TIOD::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(B_Prj_TIOD_C_ExecuteUbergraph_B_Prj_TIOD, CallFunc_BreakHitResult_HitItem) == 0x0000D4, "Member 'B_Prj_TIOD_C_ExecuteUbergraph_B_Prj_TIOD::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(B_Prj_TIOD_C_ExecuteUbergraph_B_Prj_TIOD, CallFunc_BreakHitResult_TraceStart) == 0x0000D8, "Member 'B_Prj_TIOD_C_ExecuteUbergraph_B_Prj_TIOD::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(B_Prj_TIOD_C_ExecuteUbergraph_B_Prj_TIOD, CallFunc_BreakHitResult_TraceEnd) == 0x0000E4, "Member 'B_Prj_TIOD_C_ExecuteUbergraph_B_Prj_TIOD::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(B_Prj_TIOD_C_ExecuteUbergraph_B_Prj_TIOD, CallFunc_MakeRotFromX_ReturnValue) == 0x0000F0, "Member 'B_Prj_TIOD_C_ExecuteUbergraph_B_Prj_TIOD::CallFunc_MakeRotFromX_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_TIOD_C_ExecuteUbergraph_B_Prj_TIOD, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x0000FC, "Member 'B_Prj_TIOD_C_ExecuteUbergraph_B_Prj_TIOD::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_TIOD_C_ExecuteUbergraph_B_Prj_TIOD, Temp_bool_IsClosed_Variable) == 0x000100, "Member 'B_Prj_TIOD_C_ExecuteUbergraph_B_Prj_TIOD::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(B_Prj_TIOD_C_ExecuteUbergraph_B_Prj_TIOD, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000104, "Member 'B_Prj_TIOD_C_ExecuteUbergraph_B_Prj_TIOD::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_TIOD_C_ExecuteUbergraph_B_Prj_TIOD, CallFunc_GetTransform_ReturnValue) == 0x000110, "Member 'B_Prj_TIOD_C_ExecuteUbergraph_B_Prj_TIOD::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_TIOD_C_ExecuteUbergraph_B_Prj_TIOD, CallFunc_TransformLocation_ReturnValue) == 0x000140, "Member 'B_Prj_TIOD_C_ExecuteUbergraph_B_Prj_TIOD::CallFunc_TransformLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_TIOD_C_ExecuteUbergraph_B_Prj_TIOD, CallFunc_BreakTransform_Location) == 0x00014C, "Member 'B_Prj_TIOD_C_ExecuteUbergraph_B_Prj_TIOD::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(B_Prj_TIOD_C_ExecuteUbergraph_B_Prj_TIOD, CallFunc_BreakTransform_Rotation) == 0x000158, "Member 'B_Prj_TIOD_C_ExecuteUbergraph_B_Prj_TIOD::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(B_Prj_TIOD_C_ExecuteUbergraph_B_Prj_TIOD, CallFunc_BreakTransform_Scale) == 0x000164, "Member 'B_Prj_TIOD_C_ExecuteUbergraph_B_Prj_TIOD::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(B_Prj_TIOD_C_ExecuteUbergraph_B_Prj_TIOD, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000170, "Member 'B_Prj_TIOD_C_ExecuteUbergraph_B_Prj_TIOD::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_TIOD_C_ExecuteUbergraph_B_Prj_TIOD, CallFunc_GetInstigator_ReturnValue) == 0x00017C, "Member 'B_Prj_TIOD_C_ExecuteUbergraph_B_Prj_TIOD::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_TIOD_C_ExecuteUbergraph_B_Prj_TIOD, CallFunc_GetBaseAimRotation_ReturnValue) == 0x000180, "Member 'B_Prj_TIOD_C_ExecuteUbergraph_B_Prj_TIOD::CallFunc_GetBaseAimRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_TIOD_C_ExecuteUbergraph_B_Prj_TIOD, CallFunc_GetInstigator_ReturnValue2) == 0x00018C, "Member 'B_Prj_TIOD_C_ExecuteUbergraph_B_Prj_TIOD::CallFunc_GetInstigator_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Prj_TIOD_C_ExecuteUbergraph_B_Prj_TIOD, CallFunc_Conv_RotatorToVector_ReturnValue) == 0x000190, "Member 'B_Prj_TIOD_C_ExecuteUbergraph_B_Prj_TIOD::CallFunc_Conv_RotatorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_TIOD_C_ExecuteUbergraph_B_Prj_TIOD, CallFunc_GetBaseAimRotation_ReturnValue2) == 0x00019C, "Member 'B_Prj_TIOD_C_ExecuteUbergraph_B_Prj_TIOD::CallFunc_GetBaseAimRotation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Prj_TIOD_C_ExecuteUbergraph_B_Prj_TIOD, CallFunc_Normal_ReturnValue) == 0x0001A8, "Member 'B_Prj_TIOD_C_ExecuteUbergraph_B_Prj_TIOD::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_TIOD_C_ExecuteUbergraph_B_Prj_TIOD, CallFunc_BreakVector_X) == 0x0001B4, "Member 'B_Prj_TIOD_C_ExecuteUbergraph_B_Prj_TIOD::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(B_Prj_TIOD_C_ExecuteUbergraph_B_Prj_TIOD, CallFunc_BreakVector_Y) == 0x0001B8, "Member 'B_Prj_TIOD_C_ExecuteUbergraph_B_Prj_TIOD::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(B_Prj_TIOD_C_ExecuteUbergraph_B_Prj_TIOD, CallFunc_BreakVector_Z) == 0x0001BC, "Member 'B_Prj_TIOD_C_ExecuteUbergraph_B_Prj_TIOD::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(B_Prj_TIOD_C_ExecuteUbergraph_B_Prj_TIOD, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0001C0, "Member 'B_Prj_TIOD_C_ExecuteUbergraph_B_Prj_TIOD::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_TIOD_C_ExecuteUbergraph_B_Prj_TIOD, CallFunc_Multiply_FloatFloat_ReturnValue2) == 0x0001C4, "Member 'B_Prj_TIOD_C_ExecuteUbergraph_B_Prj_TIOD::CallFunc_Multiply_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Prj_TIOD_C_ExecuteUbergraph_B_Prj_TIOD, CallFunc_Multiply_FloatFloat_ReturnValue3) == 0x0001C8, "Member 'B_Prj_TIOD_C_ExecuteUbergraph_B_Prj_TIOD::CallFunc_Multiply_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(B_Prj_TIOD_C_ExecuteUbergraph_B_Prj_TIOD, CallFunc_MakeVector_ReturnValue) == 0x0001CC, "Member 'B_Prj_TIOD_C_ExecuteUbergraph_B_Prj_TIOD::CallFunc_MakeVector_ReturnValue' has a wrong offset!");

// Function B_Prj_TIOD.B_Prj_TIOD_C.OnStop
// 0x0080 (0x0080 - 0x0000)
struct B_Prj_TIOD_C_OnStop final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(B_Prj_TIOD_C_OnStop) == 0x000004, "Wrong alignment on B_Prj_TIOD_C_OnStop");
static_assert(sizeof(B_Prj_TIOD_C_OnStop) == 0x000080, "Wrong size on B_Prj_TIOD_C_OnStop");
static_assert(offsetof(B_Prj_TIOD_C_OnStop, Hit) == 0x000000, "Member 'B_Prj_TIOD_C_OnStop::Hit' has a wrong offset!");

}

#pragma pack(pop)
