#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Prj_TIOD

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass B_Prj_TIOD.B_Prj_TIOD_C
// 0x0098 (0x04B0 - 0x0418)
class AB_Prj_TIOD_C final : public AFortProj_M80
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0418(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        ZapEnergyBall_AudioComponent;                      // 0x041C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   SelectionMesh1;                                    // 0x0420(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   Mesh;                                              // 0x0424(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UParticleSystemComponent*               PS_Trail;                                          // 0x0428(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   SelectionMesh;                                     // 0x042C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	float                                         UpdateTime;                                        // 0x0430(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         Projectile_Lifetime;                               // 0x0434(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         Movement_Speed_To_Target;                          // 0x0438(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         Distance_From_Target_To_Explode;                   // 0x043C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         Z_Offset_Target;                                   // 0x0440(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         Delay_Before_LockON;                               // 0x0444(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_448[0x8];                                      // 0x0448(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Start_Transform;                                   // 0x0450(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                Start_Location;                                    // 0x0480(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                Start_Vector;                                      // 0x048C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               Player_Init_Rot;                                   // 0x0498(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_B_Prj_TIOD(int32 EntryPoint);
	void ReceiveBeginPlay();
	void OnStop(const struct FHitResult& Hit);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Prj_TIOD_C">();
	}
	static class AB_Prj_TIOD_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Prj_TIOD_C>();
	}
};
static_assert(alignof(AB_Prj_TIOD_C) == 0x000010, "Wrong alignment on AB_Prj_TIOD_C");
static_assert(sizeof(AB_Prj_TIOD_C) == 0x0004B0, "Wrong size on AB_Prj_TIOD_C");
static_assert(offsetof(AB_Prj_TIOD_C, UberGraphFrame) == 0x000418, "Member 'AB_Prj_TIOD_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_Prj_TIOD_C, ZapEnergyBall_AudioComponent) == 0x00041C, "Member 'AB_Prj_TIOD_C::ZapEnergyBall_AudioComponent' has a wrong offset!");
static_assert(offsetof(AB_Prj_TIOD_C, SelectionMesh1) == 0x000420, "Member 'AB_Prj_TIOD_C::SelectionMesh1' has a wrong offset!");
static_assert(offsetof(AB_Prj_TIOD_C, Mesh) == 0x000424, "Member 'AB_Prj_TIOD_C::Mesh' has a wrong offset!");
static_assert(offsetof(AB_Prj_TIOD_C, PS_Trail) == 0x000428, "Member 'AB_Prj_TIOD_C::PS_Trail' has a wrong offset!");
static_assert(offsetof(AB_Prj_TIOD_C, SelectionMesh) == 0x00042C, "Member 'AB_Prj_TIOD_C::SelectionMesh' has a wrong offset!");
static_assert(offsetof(AB_Prj_TIOD_C, UpdateTime) == 0x000430, "Member 'AB_Prj_TIOD_C::UpdateTime' has a wrong offset!");
static_assert(offsetof(AB_Prj_TIOD_C, Projectile_Lifetime) == 0x000434, "Member 'AB_Prj_TIOD_C::Projectile_Lifetime' has a wrong offset!");
static_assert(offsetof(AB_Prj_TIOD_C, Movement_Speed_To_Target) == 0x000438, "Member 'AB_Prj_TIOD_C::Movement_Speed_To_Target' has a wrong offset!");
static_assert(offsetof(AB_Prj_TIOD_C, Distance_From_Target_To_Explode) == 0x00043C, "Member 'AB_Prj_TIOD_C::Distance_From_Target_To_Explode' has a wrong offset!");
static_assert(offsetof(AB_Prj_TIOD_C, Z_Offset_Target) == 0x000440, "Member 'AB_Prj_TIOD_C::Z_Offset_Target' has a wrong offset!");
static_assert(offsetof(AB_Prj_TIOD_C, Delay_Before_LockON) == 0x000444, "Member 'AB_Prj_TIOD_C::Delay_Before_LockON' has a wrong offset!");
static_assert(offsetof(AB_Prj_TIOD_C, Start_Transform) == 0x000450, "Member 'AB_Prj_TIOD_C::Start_Transform' has a wrong offset!");
static_assert(offsetof(AB_Prj_TIOD_C, Start_Location) == 0x000480, "Member 'AB_Prj_TIOD_C::Start_Location' has a wrong offset!");
static_assert(offsetof(AB_Prj_TIOD_C, Start_Vector) == 0x00048C, "Member 'AB_Prj_TIOD_C::Start_Vector' has a wrong offset!");
static_assert(offsetof(AB_Prj_TIOD_C, Player_Init_Rot) == 0x000498, "Member 'AB_Prj_TIOD_C::Player_Init_Rot' has a wrong offset!");

}

#pragma pack(pop)
