#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Prj_Zapper2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function B_Prj_Zapper2.B_Prj_Zapper2_C.ExecuteUbergraph_B_Prj_Zapper2
// 0x0128 (0x0128 - 0x0000)
struct B_Prj_Zapper2_C_ExecuteUbergraph_B_Prj_Zapper2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_Damage;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	const class UDamageType*                      K2Node_Event_DamageType;                           // 0x0008(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AController*                            K2Node_Event_InstigatedBy;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x0018(0x0080)(ConstParm, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A[0x2];                                       // 0x009A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x00A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x00AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x00B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x00C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x00DC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x00E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x00F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0104(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0110(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x011C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Prj_Zapper2_C_ExecuteUbergraph_B_Prj_Zapper2) == 0x000004, "Wrong alignment on B_Prj_Zapper2_C_ExecuteUbergraph_B_Prj_Zapper2");
static_assert(sizeof(B_Prj_Zapper2_C_ExecuteUbergraph_B_Prj_Zapper2) == 0x000128, "Wrong size on B_Prj_Zapper2_C_ExecuteUbergraph_B_Prj_Zapper2");
static_assert(offsetof(B_Prj_Zapper2_C_ExecuteUbergraph_B_Prj_Zapper2, EntryPoint) == 0x000000, "Member 'B_Prj_Zapper2_C_ExecuteUbergraph_B_Prj_Zapper2::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Prj_Zapper2_C_ExecuteUbergraph_B_Prj_Zapper2, K2Node_Event_Damage) == 0x000004, "Member 'B_Prj_Zapper2_C_ExecuteUbergraph_B_Prj_Zapper2::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(B_Prj_Zapper2_C_ExecuteUbergraph_B_Prj_Zapper2, K2Node_Event_DamageType) == 0x000008, "Member 'B_Prj_Zapper2_C_ExecuteUbergraph_B_Prj_Zapper2::K2Node_Event_DamageType' has a wrong offset!");
static_assert(offsetof(B_Prj_Zapper2_C_ExecuteUbergraph_B_Prj_Zapper2, K2Node_Event_InstigatedBy) == 0x00000C, "Member 'B_Prj_Zapper2_C_ExecuteUbergraph_B_Prj_Zapper2::K2Node_Event_InstigatedBy' has a wrong offset!");
static_assert(offsetof(B_Prj_Zapper2_C_ExecuteUbergraph_B_Prj_Zapper2, K2Node_Event_DamageCauser) == 0x000010, "Member 'B_Prj_Zapper2_C_ExecuteUbergraph_B_Prj_Zapper2::K2Node_Event_DamageCauser' has a wrong offset!");
static_assert(offsetof(B_Prj_Zapper2_C_ExecuteUbergraph_B_Prj_Zapper2, Temp_bool_Has_Been_Initd_Variable) == 0x000014, "Member 'B_Prj_Zapper2_C_ExecuteUbergraph_B_Prj_Zapper2::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(B_Prj_Zapper2_C_ExecuteUbergraph_B_Prj_Zapper2, K2Node_Event_Hit) == 0x000018, "Member 'B_Prj_Zapper2_C_ExecuteUbergraph_B_Prj_Zapper2::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(B_Prj_Zapper2_C_ExecuteUbergraph_B_Prj_Zapper2, CallFunc_BreakHitResult_bBlockingHit) == 0x000098, "Member 'B_Prj_Zapper2_C_ExecuteUbergraph_B_Prj_Zapper2::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(B_Prj_Zapper2_C_ExecuteUbergraph_B_Prj_Zapper2, CallFunc_BreakHitResult_bInitialOverlap) == 0x000099, "Member 'B_Prj_Zapper2_C_ExecuteUbergraph_B_Prj_Zapper2::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(B_Prj_Zapper2_C_ExecuteUbergraph_B_Prj_Zapper2, CallFunc_BreakHitResult_Time) == 0x00009C, "Member 'B_Prj_Zapper2_C_ExecuteUbergraph_B_Prj_Zapper2::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(B_Prj_Zapper2_C_ExecuteUbergraph_B_Prj_Zapper2, CallFunc_BreakHitResult_Location) == 0x0000A0, "Member 'B_Prj_Zapper2_C_ExecuteUbergraph_B_Prj_Zapper2::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(B_Prj_Zapper2_C_ExecuteUbergraph_B_Prj_Zapper2, CallFunc_BreakHitResult_ImpactPoint) == 0x0000AC, "Member 'B_Prj_Zapper2_C_ExecuteUbergraph_B_Prj_Zapper2::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(B_Prj_Zapper2_C_ExecuteUbergraph_B_Prj_Zapper2, CallFunc_BreakHitResult_Normal) == 0x0000B8, "Member 'B_Prj_Zapper2_C_ExecuteUbergraph_B_Prj_Zapper2::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(B_Prj_Zapper2_C_ExecuteUbergraph_B_Prj_Zapper2, CallFunc_BreakHitResult_ImpactNormal) == 0x0000C4, "Member 'B_Prj_Zapper2_C_ExecuteUbergraph_B_Prj_Zapper2::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(B_Prj_Zapper2_C_ExecuteUbergraph_B_Prj_Zapper2, CallFunc_BreakHitResult_PhysMat) == 0x0000D0, "Member 'B_Prj_Zapper2_C_ExecuteUbergraph_B_Prj_Zapper2::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(B_Prj_Zapper2_C_ExecuteUbergraph_B_Prj_Zapper2, CallFunc_BreakHitResult_HitActor) == 0x0000D4, "Member 'B_Prj_Zapper2_C_ExecuteUbergraph_B_Prj_Zapper2::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(B_Prj_Zapper2_C_ExecuteUbergraph_B_Prj_Zapper2, CallFunc_BreakHitResult_HitComponent) == 0x0000D8, "Member 'B_Prj_Zapper2_C_ExecuteUbergraph_B_Prj_Zapper2::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(B_Prj_Zapper2_C_ExecuteUbergraph_B_Prj_Zapper2, CallFunc_BreakHitResult_HitBoneName) == 0x0000DC, "Member 'B_Prj_Zapper2_C_ExecuteUbergraph_B_Prj_Zapper2::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(B_Prj_Zapper2_C_ExecuteUbergraph_B_Prj_Zapper2, CallFunc_BreakHitResult_HitItem) == 0x0000E4, "Member 'B_Prj_Zapper2_C_ExecuteUbergraph_B_Prj_Zapper2::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(B_Prj_Zapper2_C_ExecuteUbergraph_B_Prj_Zapper2, CallFunc_BreakHitResult_TraceStart) == 0x0000E8, "Member 'B_Prj_Zapper2_C_ExecuteUbergraph_B_Prj_Zapper2::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(B_Prj_Zapper2_C_ExecuteUbergraph_B_Prj_Zapper2, CallFunc_BreakHitResult_TraceEnd) == 0x0000F4, "Member 'B_Prj_Zapper2_C_ExecuteUbergraph_B_Prj_Zapper2::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(B_Prj_Zapper2_C_ExecuteUbergraph_B_Prj_Zapper2, Temp_bool_IsClosed_Variable) == 0x000100, "Member 'B_Prj_Zapper2_C_ExecuteUbergraph_B_Prj_Zapper2::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(B_Prj_Zapper2_C_ExecuteUbergraph_B_Prj_Zapper2, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000104, "Member 'B_Prj_Zapper2_C_ExecuteUbergraph_B_Prj_Zapper2::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Zapper2_C_ExecuteUbergraph_B_Prj_Zapper2, CallFunc_Add_VectorVector_ReturnValue) == 0x000110, "Member 'B_Prj_Zapper2_C_ExecuteUbergraph_B_Prj_Zapper2::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Zapper2_C_ExecuteUbergraph_B_Prj_Zapper2, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x00011C, "Member 'B_Prj_Zapper2_C_ExecuteUbergraph_B_Prj_Zapper2::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");

// Function B_Prj_Zapper2.B_Prj_Zapper2_C.OnStop
// 0x0080 (0x0080 - 0x0000)
struct B_Prj_Zapper2_C_OnStop final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(B_Prj_Zapper2_C_OnStop) == 0x000004, "Wrong alignment on B_Prj_Zapper2_C_OnStop");
static_assert(sizeof(B_Prj_Zapper2_C_OnStop) == 0x000080, "Wrong size on B_Prj_Zapper2_C_OnStop");
static_assert(offsetof(B_Prj_Zapper2_C_OnStop, Hit) == 0x000000, "Member 'B_Prj_Zapper2_C_OnStop::Hit' has a wrong offset!");

// Function B_Prj_Zapper2.B_Prj_Zapper2_C.ReceiveAnyDamage
// 0x0010 (0x0010 - 0x0000)
struct B_Prj_Zapper2_C_ReceiveAnyDamage final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	const class UDamageType*                      DamageType;                                        // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AController*                            InstigatedBy;                                      // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 DamageCauser;                                      // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Prj_Zapper2_C_ReceiveAnyDamage) == 0x000004, "Wrong alignment on B_Prj_Zapper2_C_ReceiveAnyDamage");
static_assert(sizeof(B_Prj_Zapper2_C_ReceiveAnyDamage) == 0x000010, "Wrong size on B_Prj_Zapper2_C_ReceiveAnyDamage");
static_assert(offsetof(B_Prj_Zapper2_C_ReceiveAnyDamage, Damage) == 0x000000, "Member 'B_Prj_Zapper2_C_ReceiveAnyDamage::Damage' has a wrong offset!");
static_assert(offsetof(B_Prj_Zapper2_C_ReceiveAnyDamage, DamageType) == 0x000004, "Member 'B_Prj_Zapper2_C_ReceiveAnyDamage::DamageType' has a wrong offset!");
static_assert(offsetof(B_Prj_Zapper2_C_ReceiveAnyDamage, InstigatedBy) == 0x000008, "Member 'B_Prj_Zapper2_C_ReceiveAnyDamage::InstigatedBy' has a wrong offset!");
static_assert(offsetof(B_Prj_Zapper2_C_ReceiveAnyDamage, DamageCauser) == 0x00000C, "Member 'B_Prj_Zapper2_C_ReceiveAnyDamage::DamageCauser' has a wrong offset!");

// Function B_Prj_Zapper2.B_Prj_Zapper2_C.OnRep_Impact Location
// 0x0004 (0x0004 - 0x0000)
struct B_Prj_Zapper2_C_OnRep_Impact_Location final
{
public:
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Prj_Zapper2_C_OnRep_Impact_Location) == 0x000004, "Wrong alignment on B_Prj_Zapper2_C_OnRep_Impact_Location");
static_assert(sizeof(B_Prj_Zapper2_C_OnRep_Impact_Location) == 0x000004, "Wrong size on B_Prj_Zapper2_C_OnRep_Impact_Location");
static_assert(offsetof(B_Prj_Zapper2_C_OnRep_Impact_Location, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000000, "Member 'B_Prj_Zapper2_C_OnRep_Impact_Location::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");

}

#pragma pack(pop)
