#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Prj_Ranged_GrenadeLauncher

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function B_Prj_Ranged_GrenadeLauncher.B_Prj_Ranged_GrenadeLauncher_C.ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher
// 0x0364 (0x0364 - 0x0000)
struct B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             K2Node_Event_Hit2;                                 // 0x0004(0x0080)(ConstParm, ContainsInstancedReference)
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x0084(0x0080)(ConstParm, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0105(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_106[0x2];                                      // 0x0106(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x010C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0118(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0124(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0130(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0154(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0160(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit2;             // 0x016C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap2;          // 0x016D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16E[0x2];                                      // 0x016E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time2;                     // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_Location2;                 // 0x0174(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint2;              // 0x0180(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_Normal2;                   // 0x018C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal2;             // 0x0198(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat2;                  // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BreakHitResult_HitActor2;                 // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent2;             // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   CallFunc_BreakHitResult_HitBoneName2;              // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_BreakHitResult_HitItem2;                  // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_TraceStart2;               // 0x01BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd2;                 // 0x01C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotFromX_ReturnValue;                 // 0x01D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E1[0x3];                                      // 0x01E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotFromX_ReturnValue2;                // 0x01E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBeingKilled_ReturnValue;                // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F1[0x3];                                      // 0x01F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_Event_HitActors;                            // 0x01F4(0x000C)(ConstParm, ZeroConstructor, ReferenceParm)
	TArray<struct FHitResult>                     K2Node_Event_HitResults;                           // 0x0200(0x000C)(ConstParm, ZeroConstructor, ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0214(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_215[0x3];                                      // 0x0215(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x021C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21D[0x3];                                      // 0x021D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0224(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_225[0x3];                                      // 0x0225(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_Array_Get_Item;                           // 0x022C(0x0080)(ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit3;             // 0x02AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap3;          // 0x02AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2AE[0x2];                                      // 0x02AE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time3;                     // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_Location3;                 // 0x02B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint3;              // 0x02C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_Normal3;                   // 0x02CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal3;             // 0x02D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat3;                  // 0x02E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BreakHitResult_HitActor3;                 // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent3;             // 0x02EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   CallFunc_BreakHitResult_HitBoneName3;              // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_BreakHitResult_HitItem3;                  // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_TraceStart3;               // 0x02FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd3;                 // 0x0308(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotFromX_ReturnValue3;                // 0x0314(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x0321(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_322[0x2];                                      // 0x0322(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0324(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0328(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue2;      // 0x0334(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue3;      // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APawn*                                  K2Node_DynamicCast_AsPawn;                         // 0x033C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_341[0x3];                                      // 0x0341(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_SpawnBounceFX_HitActor;                   // 0x0344(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPhysicalSurface                              CallFunc_SpawnBounceFX_SurfaceType;                // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_349[0x3];                                      // 0x0349(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_SpawnBounceFX_HitResultRotation;          // 0x034C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0358(0x0004)()
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue2;                 // 0x035C(0x0004)()
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue4;      // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher) == 0x000004, "Wrong alignment on B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher");
static_assert(sizeof(B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher) == 0x000364, "Wrong size on B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher, EntryPoint) == 0x000000, "Member 'B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher, K2Node_Event_Hit2) == 0x000004, "Member 'B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher::K2Node_Event_Hit2' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher, K2Node_Event_Hit) == 0x000084, "Member 'B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher, CallFunc_BreakHitResult_bBlockingHit) == 0x000104, "Member 'B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher, CallFunc_BreakHitResult_bInitialOverlap) == 0x000105, "Member 'B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher, CallFunc_BreakHitResult_Time) == 0x000108, "Member 'B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher, CallFunc_BreakHitResult_Location) == 0x00010C, "Member 'B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher, CallFunc_BreakHitResult_ImpactPoint) == 0x000118, "Member 'B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher, CallFunc_BreakHitResult_Normal) == 0x000124, "Member 'B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher, CallFunc_BreakHitResult_ImpactNormal) == 0x000130, "Member 'B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher, CallFunc_BreakHitResult_PhysMat) == 0x00013C, "Member 'B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher, CallFunc_BreakHitResult_HitActor) == 0x000140, "Member 'B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher, CallFunc_BreakHitResult_HitComponent) == 0x000144, "Member 'B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher, CallFunc_BreakHitResult_HitBoneName) == 0x000148, "Member 'B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher, CallFunc_BreakHitResult_HitItem) == 0x000150, "Member 'B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher, CallFunc_BreakHitResult_TraceStart) == 0x000154, "Member 'B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher, CallFunc_BreakHitResult_TraceEnd) == 0x000160, "Member 'B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher, CallFunc_BreakHitResult_bBlockingHit2) == 0x00016C, "Member 'B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher::CallFunc_BreakHitResult_bBlockingHit2' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher, CallFunc_BreakHitResult_bInitialOverlap2) == 0x00016D, "Member 'B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher::CallFunc_BreakHitResult_bInitialOverlap2' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher, CallFunc_BreakHitResult_Time2) == 0x000170, "Member 'B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher::CallFunc_BreakHitResult_Time2' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher, CallFunc_BreakHitResult_Location2) == 0x000174, "Member 'B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher::CallFunc_BreakHitResult_Location2' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher, CallFunc_BreakHitResult_ImpactPoint2) == 0x000180, "Member 'B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher::CallFunc_BreakHitResult_ImpactPoint2' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher, CallFunc_BreakHitResult_Normal2) == 0x00018C, "Member 'B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher::CallFunc_BreakHitResult_Normal2' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher, CallFunc_BreakHitResult_ImpactNormal2) == 0x000198, "Member 'B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher::CallFunc_BreakHitResult_ImpactNormal2' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher, CallFunc_BreakHitResult_PhysMat2) == 0x0001A4, "Member 'B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher::CallFunc_BreakHitResult_PhysMat2' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher, CallFunc_BreakHitResult_HitActor2) == 0x0001A8, "Member 'B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher::CallFunc_BreakHitResult_HitActor2' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher, CallFunc_BreakHitResult_HitComponent2) == 0x0001AC, "Member 'B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher::CallFunc_BreakHitResult_HitComponent2' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher, CallFunc_BreakHitResult_HitBoneName2) == 0x0001B0, "Member 'B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher::CallFunc_BreakHitResult_HitBoneName2' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher, CallFunc_BreakHitResult_HitItem2) == 0x0001B8, "Member 'B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher::CallFunc_BreakHitResult_HitItem2' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher, CallFunc_BreakHitResult_TraceStart2) == 0x0001BC, "Member 'B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher::CallFunc_BreakHitResult_TraceStart2' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher, CallFunc_BreakHitResult_TraceEnd2) == 0x0001C8, "Member 'B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher::CallFunc_BreakHitResult_TraceEnd2' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher, CallFunc_MakeRotFromX_ReturnValue) == 0x0001D4, "Member 'B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher::CallFunc_MakeRotFromX_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0001E0, "Member 'B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher, CallFunc_MakeRotFromX_ReturnValue2) == 0x0001E4, "Member 'B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher::CallFunc_MakeRotFromX_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher, CallFunc_IsBeingKilled_ReturnValue) == 0x0001F0, "Member 'B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher::CallFunc_IsBeingKilled_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher, K2Node_Event_HitActors) == 0x0001F4, "Member 'B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher::K2Node_Event_HitActors' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher, K2Node_Event_HitResults) == 0x000200, "Member 'B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher::K2Node_Event_HitResults' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher, CallFunc_Array_Length_ReturnValue) == 0x00020C, "Member 'B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x000210, "Member 'B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher, Temp_bool_Has_Been_Initd_Variable) == 0x000214, "Member 'B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher, Temp_int_Loop_Counter_Variable) == 0x000218, "Member 'B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher, CallFunc_Less_IntInt_ReturnValue) == 0x00021C, "Member 'B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher, CallFunc_Add_IntInt_ReturnValue) == 0x000220, "Member 'B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher, Temp_bool_IsClosed_Variable) == 0x000224, "Member 'B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher, Temp_int_Array_Index_Variable) == 0x000228, "Member 'B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher, CallFunc_Array_Get_Item) == 0x00022C, "Member 'B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher, CallFunc_BreakHitResult_bBlockingHit3) == 0x0002AC, "Member 'B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher::CallFunc_BreakHitResult_bBlockingHit3' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher, CallFunc_BreakHitResult_bInitialOverlap3) == 0x0002AD, "Member 'B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher::CallFunc_BreakHitResult_bInitialOverlap3' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher, CallFunc_BreakHitResult_Time3) == 0x0002B0, "Member 'B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher::CallFunc_BreakHitResult_Time3' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher, CallFunc_BreakHitResult_Location3) == 0x0002B4, "Member 'B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher::CallFunc_BreakHitResult_Location3' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher, CallFunc_BreakHitResult_ImpactPoint3) == 0x0002C0, "Member 'B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher::CallFunc_BreakHitResult_ImpactPoint3' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher, CallFunc_BreakHitResult_Normal3) == 0x0002CC, "Member 'B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher::CallFunc_BreakHitResult_Normal3' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher, CallFunc_BreakHitResult_ImpactNormal3) == 0x0002D8, "Member 'B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher::CallFunc_BreakHitResult_ImpactNormal3' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher, CallFunc_BreakHitResult_PhysMat3) == 0x0002E4, "Member 'B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher::CallFunc_BreakHitResult_PhysMat3' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher, CallFunc_BreakHitResult_HitActor3) == 0x0002E8, "Member 'B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher::CallFunc_BreakHitResult_HitActor3' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher, CallFunc_BreakHitResult_HitComponent3) == 0x0002EC, "Member 'B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher::CallFunc_BreakHitResult_HitComponent3' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher, CallFunc_BreakHitResult_HitBoneName3) == 0x0002F0, "Member 'B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher::CallFunc_BreakHitResult_HitBoneName3' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher, CallFunc_BreakHitResult_HitItem3) == 0x0002F8, "Member 'B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher::CallFunc_BreakHitResult_HitItem3' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher, CallFunc_BreakHitResult_TraceStart3) == 0x0002FC, "Member 'B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher::CallFunc_BreakHitResult_TraceStart3' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher, CallFunc_BreakHitResult_TraceEnd3) == 0x000308, "Member 'B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher::CallFunc_BreakHitResult_TraceEnd3' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher, CallFunc_MakeRotFromX_ReturnValue3) == 0x000314, "Member 'B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher::CallFunc_MakeRotFromX_ReturnValue3' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher, K2Node_SwitchEnum_CmpSuccess) == 0x000320, "Member 'B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher, K2Node_SwitchEnum2_CmpSuccess) == 0x000321, "Member 'B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher::K2Node_SwitchEnum2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000324, "Member 'B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000328, "Member 'B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher, CallFunc_SpawnEmitterAtLocation_ReturnValue2) == 0x000334, "Member 'B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher::CallFunc_SpawnEmitterAtLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher, CallFunc_SpawnEmitterAtLocation_ReturnValue3) == 0x000338, "Member 'B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher::CallFunc_SpawnEmitterAtLocation_ReturnValue3' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher, K2Node_DynamicCast_AsPawn) == 0x00033C, "Member 'B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher::K2Node_DynamicCast_AsPawn' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher, K2Node_DynamicCast_bSuccess) == 0x000340, "Member 'B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher, CallFunc_SpawnBounceFX_HitActor) == 0x000344, "Member 'B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher::CallFunc_SpawnBounceFX_HitActor' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher, CallFunc_SpawnBounceFX_SurfaceType) == 0x000348, "Member 'B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher::CallFunc_SpawnBounceFX_SurfaceType' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher, CallFunc_SpawnBounceFX_HitResultRotation) == 0x00034C, "Member 'B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher::CallFunc_SpawnBounceFX_HitResultRotation' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher, CallFunc_K2_SetTimer_ReturnValue) == 0x000358, "Member 'B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher, CallFunc_K2_SetTimer_ReturnValue2) == 0x00035C, "Member 'B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher::CallFunc_K2_SetTimer_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher, CallFunc_SpawnEmitterAtLocation_ReturnValue4) == 0x000360, "Member 'B_Prj_Ranged_GrenadeLauncher_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher::CallFunc_SpawnEmitterAtLocation_ReturnValue4' has a wrong offset!");

// Function B_Prj_Ranged_GrenadeLauncher.B_Prj_Ranged_GrenadeLauncher_C.OnExploded
// 0x0018 (0x0018 - 0x0000)
struct B_Prj_Ranged_GrenadeLauncher_C_OnExploded final
{
public:
	TArray<class AActor*>                         HitActors;                                         // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm)
	TArray<struct FHitResult>                     HitResults;                                        // 0x000C(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(B_Prj_Ranged_GrenadeLauncher_C_OnExploded) == 0x000004, "Wrong alignment on B_Prj_Ranged_GrenadeLauncher_C_OnExploded");
static_assert(sizeof(B_Prj_Ranged_GrenadeLauncher_C_OnExploded) == 0x000018, "Wrong size on B_Prj_Ranged_GrenadeLauncher_C_OnExploded");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_C_OnExploded, HitActors) == 0x000000, "Member 'B_Prj_Ranged_GrenadeLauncher_C_OnExploded::HitActors' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_C_OnExploded, HitResults) == 0x00000C, "Member 'B_Prj_Ranged_GrenadeLauncher_C_OnExploded::HitResults' has a wrong offset!");

// Function B_Prj_Ranged_GrenadeLauncher.B_Prj_Ranged_GrenadeLauncher_C.OnStop
// 0x0080 (0x0080 - 0x0000)
struct B_Prj_Ranged_GrenadeLauncher_C_OnStop final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(B_Prj_Ranged_GrenadeLauncher_C_OnStop) == 0x000004, "Wrong alignment on B_Prj_Ranged_GrenadeLauncher_C_OnStop");
static_assert(sizeof(B_Prj_Ranged_GrenadeLauncher_C_OnStop) == 0x000080, "Wrong size on B_Prj_Ranged_GrenadeLauncher_C_OnStop");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_C_OnStop, Hit) == 0x000000, "Member 'B_Prj_Ranged_GrenadeLauncher_C_OnStop::Hit' has a wrong offset!");

// Function B_Prj_Ranged_GrenadeLauncher.B_Prj_Ranged_GrenadeLauncher_C.OnBounce
// 0x0080 (0x0080 - 0x0000)
struct B_Prj_Ranged_GrenadeLauncher_C_OnBounce final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(B_Prj_Ranged_GrenadeLauncher_C_OnBounce) == 0x000004, "Wrong alignment on B_Prj_Ranged_GrenadeLauncher_C_OnBounce");
static_assert(sizeof(B_Prj_Ranged_GrenadeLauncher_C_OnBounce) == 0x000080, "Wrong size on B_Prj_Ranged_GrenadeLauncher_C_OnBounce");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_C_OnBounce, Hit) == 0x000000, "Member 'B_Prj_Ranged_GrenadeLauncher_C_OnBounce::Hit' has a wrong offset!");

// Function B_Prj_Ranged_GrenadeLauncher.B_Prj_Ranged_GrenadeLauncher_C.UserConstructionScript
// 0x0040 (0x0040 - 0x0000)
struct B_Prj_Ranged_GrenadeLauncher_C_UserConstructionScript final
{
public:
	struct FTransform                             Temp_struct_Variable;                              // 0x0000(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class UParticleSystemComponent*               CallFunc_AddComponent_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Prj_Ranged_GrenadeLauncher_C_UserConstructionScript) == 0x000010, "Wrong alignment on B_Prj_Ranged_GrenadeLauncher_C_UserConstructionScript");
static_assert(sizeof(B_Prj_Ranged_GrenadeLauncher_C_UserConstructionScript) == 0x000040, "Wrong size on B_Prj_Ranged_GrenadeLauncher_C_UserConstructionScript");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_C_UserConstructionScript, Temp_struct_Variable) == 0x000000, "Member 'B_Prj_Ranged_GrenadeLauncher_C_UserConstructionScript::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_C_UserConstructionScript, CallFunc_AddComponent_ReturnValue) == 0x000030, "Member 'B_Prj_Ranged_GrenadeLauncher_C_UserConstructionScript::CallFunc_AddComponent_ReturnValue' has a wrong offset!");

// Function B_Prj_Ranged_GrenadeLauncher.B_Prj_Ranged_GrenadeLauncher_C.SpawnBounceFX
// 0x0118 (0x0118 - 0x0000)
struct B_Prj_Ranged_GrenadeLauncher_C_SpawnBounceFX final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x0080)(Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class AActor*                                 HitActor;                                          // 0x0080(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EPhysicalSurface                              SurfaceType;                                       // 0x0084(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               HitResultRotation;                                 // 0x0088(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EPhysicalSurface                              CallFunc_GetFortPhysicalSurface_ReturnValue;       // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0095(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0096(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_97[0x1];                                       // 0x0097(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x00E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x00F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FD[0x3];                                       // 0x00FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0100(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10D[0x3];                                      // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue2;      // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Prj_Ranged_GrenadeLauncher_C_SpawnBounceFX) == 0x000004, "Wrong alignment on B_Prj_Ranged_GrenadeLauncher_C_SpawnBounceFX");
static_assert(sizeof(B_Prj_Ranged_GrenadeLauncher_C_SpawnBounceFX) == 0x000118, "Wrong size on B_Prj_Ranged_GrenadeLauncher_C_SpawnBounceFX");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_C_SpawnBounceFX, Hit) == 0x000000, "Member 'B_Prj_Ranged_GrenadeLauncher_C_SpawnBounceFX::Hit' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_C_SpawnBounceFX, HitActor) == 0x000080, "Member 'B_Prj_Ranged_GrenadeLauncher_C_SpawnBounceFX::HitActor' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_C_SpawnBounceFX, SurfaceType) == 0x000084, "Member 'B_Prj_Ranged_GrenadeLauncher_C_SpawnBounceFX::SurfaceType' has a wrong offset!");
