#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Prj_FireCrackerGun

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function B_Prj_FireCrackerGun.B_Prj_FireCrackerGun_C.ExecuteUbergraph_B_Prj_FireCrackerGun
// 0x0128 (0x0128 - 0x0000)
struct B_Prj_FireCrackerGun_C_ExecuteUbergraph_B_Prj_FireCrackerGun final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x0008(0x0080)(ConstParm, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A[0x2];                                       // 0x008A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x00CC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x00D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x00E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable2;                // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable2;                      // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FA[0x2];                                       // 0x00FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_Event_HitActors;                            // 0x00FC(0x000C)(ConstParm, ZeroConstructor, ReferenceParm)
	TArray<struct FHitResult>                     K2Node_Event_HitResults;                           // 0x0108(0x000C)(ConstParm, ZeroConstructor, ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortTeamAffiliation                          CallFunc_GetTeamAffiliation_ReturnValue;           // 0x0115(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0116(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_117[0x1];                                      // 0x0117(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x011C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Prj_FireCrackerGun_C_ExecuteUbergraph_B_Prj_FireCrackerGun) == 0x000004, "Wrong alignment on B_Prj_FireCrackerGun_C_ExecuteUbergraph_B_Prj_FireCrackerGun");
static_assert(sizeof(B_Prj_FireCrackerGun_C_ExecuteUbergraph_B_Prj_FireCrackerGun) == 0x000128, "Wrong size on B_Prj_FireCrackerGun_C_ExecuteUbergraph_B_Prj_FireCrackerGun");
static_assert(offsetof(B_Prj_FireCrackerGun_C_ExecuteUbergraph_B_Prj_FireCrackerGun, EntryPoint) == 0x000000, "Member 'B_Prj_FireCrackerGun_C_ExecuteUbergraph_B_Prj_FireCrackerGun::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Prj_FireCrackerGun_C_ExecuteUbergraph_B_Prj_FireCrackerGun, Temp_bool_IsClosed_Variable) == 0x000004, "Member 'B_Prj_FireCrackerGun_C_ExecuteUbergraph_B_Prj_FireCrackerGun::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(B_Prj_FireCrackerGun_C_ExecuteUbergraph_B_Prj_FireCrackerGun, Temp_bool_Has_Been_Initd_Variable) == 0x000005, "Member 'B_Prj_FireCrackerGun_C_ExecuteUbergraph_B_Prj_FireCrackerGun::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(B_Prj_FireCrackerGun_C_ExecuteUbergraph_B_Prj_FireCrackerGun, K2Node_Event_Hit) == 0x000008, "Member 'B_Prj_FireCrackerGun_C_ExecuteUbergraph_B_Prj_FireCrackerGun::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(B_Prj_FireCrackerGun_C_ExecuteUbergraph_B_Prj_FireCrackerGun, CallFunc_BreakHitResult_bBlockingHit) == 0x000088, "Member 'B_Prj_FireCrackerGun_C_ExecuteUbergraph_B_Prj_FireCrackerGun::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(B_Prj_FireCrackerGun_C_ExecuteUbergraph_B_Prj_FireCrackerGun, CallFunc_BreakHitResult_bInitialOverlap) == 0x000089, "Member 'B_Prj_FireCrackerGun_C_ExecuteUbergraph_B_Prj_FireCrackerGun::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(B_Prj_FireCrackerGun_C_ExecuteUbergraph_B_Prj_FireCrackerGun, CallFunc_BreakHitResult_Time) == 0x00008C, "Member 'B_Prj_FireCrackerGun_C_ExecuteUbergraph_B_Prj_FireCrackerGun::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(B_Prj_FireCrackerGun_C_ExecuteUbergraph_B_Prj_FireCrackerGun, CallFunc_BreakHitResult_Location) == 0x000090, "Member 'B_Prj_FireCrackerGun_C_ExecuteUbergraph_B_Prj_FireCrackerGun::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(B_Prj_FireCrackerGun_C_ExecuteUbergraph_B_Prj_FireCrackerGun, CallFunc_BreakHitResult_ImpactPoint) == 0x00009C, "Member 'B_Prj_FireCrackerGun_C_ExecuteUbergraph_B_Prj_FireCrackerGun::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(B_Prj_FireCrackerGun_C_ExecuteUbergraph_B_Prj_FireCrackerGun, CallFunc_BreakHitResult_Normal) == 0x0000A8, "Member 'B_Prj_FireCrackerGun_C_ExecuteUbergraph_B_Prj_FireCrackerGun::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(B_Prj_FireCrackerGun_C_ExecuteUbergraph_B_Prj_FireCrackerGun, CallFunc_BreakHitResult_ImpactNormal) == 0x0000B4, "Member 'B_Prj_FireCrackerGun_C_ExecuteUbergraph_B_Prj_FireCrackerGun::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(B_Prj_FireCrackerGun_C_ExecuteUbergraph_B_Prj_FireCrackerGun, CallFunc_BreakHitResult_PhysMat) == 0x0000C0, "Member 'B_Prj_FireCrackerGun_C_ExecuteUbergraph_B_Prj_FireCrackerGun::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(B_Prj_FireCrackerGun_C_ExecuteUbergraph_B_Prj_FireCrackerGun, CallFunc_BreakHitResult_HitActor) == 0x0000C4, "Member 'B_Prj_FireCrackerGun_C_ExecuteUbergraph_B_Prj_FireCrackerGun::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(B_Prj_FireCrackerGun_C_ExecuteUbergraph_B_Prj_FireCrackerGun, CallFunc_BreakHitResult_HitComponent) == 0x0000C8, "Member 'B_Prj_FireCrackerGun_C_ExecuteUbergraph_B_Prj_FireCrackerGun::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(B_Prj_FireCrackerGun_C_ExecuteUbergraph_B_Prj_FireCrackerGun, CallFunc_BreakHitResult_HitBoneName) == 0x0000CC, "Member 'B_Prj_FireCrackerGun_C_ExecuteUbergraph_B_Prj_FireCrackerGun::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(B_Prj_FireCrackerGun_C_ExecuteUbergraph_B_Prj_FireCrackerGun, CallFunc_BreakHitResult_HitItem) == 0x0000D4, "Member 'B_Prj_FireCrackerGun_C_ExecuteUbergraph_B_Prj_FireCrackerGun::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(B_Prj_FireCrackerGun_C_ExecuteUbergraph_B_Prj_FireCrackerGun, CallFunc_BreakHitResult_TraceStart) == 0x0000D8, "Member 'B_Prj_FireCrackerGun_C_ExecuteUbergraph_B_Prj_FireCrackerGun::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(B_Prj_FireCrackerGun_C_ExecuteUbergraph_B_Prj_FireCrackerGun, CallFunc_BreakHitResult_TraceEnd) == 0x0000E4, "Member 'B_Prj_FireCrackerGun_C_ExecuteUbergraph_B_Prj_FireCrackerGun::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(B_Prj_FireCrackerGun_C_ExecuteUbergraph_B_Prj_FireCrackerGun, Temp_bool_Has_Been_Initd_Variable2) == 0x0000F0, "Member 'B_Prj_FireCrackerGun_C_ExecuteUbergraph_B_Prj_FireCrackerGun::Temp_bool_Has_Been_Initd_Variable2' has a wrong offset!");
static_assert(offsetof(B_Prj_FireCrackerGun_C_ExecuteUbergraph_B_Prj_FireCrackerGun, K2Node_DynamicCast_AsFort_Pawn) == 0x0000F4, "Member 'B_Prj_FireCrackerGun_C_ExecuteUbergraph_B_Prj_FireCrackerGun::K2Node_DynamicCast_AsFort_Pawn' has a wrong offset!");
static_assert(offsetof(B_Prj_FireCrackerGun_C_ExecuteUbergraph_B_Prj_FireCrackerGun, K2Node_DynamicCast_bSuccess) == 0x0000F8, "Member 'B_Prj_FireCrackerGun_C_ExecuteUbergraph_B_Prj_FireCrackerGun::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_Prj_FireCrackerGun_C_ExecuteUbergraph_B_Prj_FireCrackerGun, Temp_bool_IsClosed_Variable2) == 0x0000F9, "Member 'B_Prj_FireCrackerGun_C_ExecuteUbergraph_B_Prj_FireCrackerGun::Temp_bool_IsClosed_Variable2' has a wrong offset!");
static_assert(offsetof(B_Prj_FireCrackerGun_C_ExecuteUbergraph_B_Prj_FireCrackerGun, K2Node_Event_HitActors) == 0x0000FC, "Member 'B_Prj_FireCrackerGun_C_ExecuteUbergraph_B_Prj_FireCrackerGun::K2Node_Event_HitActors' has a wrong offset!");
static_assert(offsetof(B_Prj_FireCrackerGun_C_ExecuteUbergraph_B_Prj_FireCrackerGun, K2Node_Event_HitResults) == 0x000108, "Member 'B_Prj_FireCrackerGun_C_ExecuteUbergraph_B_Prj_FireCrackerGun::K2Node_Event_HitResults' has a wrong offset!");
static_assert(offsetof(B_Prj_FireCrackerGun_C_ExecuteUbergraph_B_Prj_FireCrackerGun, CallFunc_HasAuthority_ReturnValue) == 0x000114, "Member 'B_Prj_FireCrackerGun_C_ExecuteUbergraph_B_Prj_FireCrackerGun::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_FireCrackerGun_C_ExecuteUbergraph_B_Prj_FireCrackerGun, CallFunc_GetTeamAffiliation_ReturnValue) == 0x000115, "Member 'B_Prj_FireCrackerGun_C_ExecuteUbergraph_B_Prj_FireCrackerGun::CallFunc_GetTeamAffiliation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_FireCrackerGun_C_ExecuteUbergraph_B_Prj_FireCrackerGun, K2Node_SwitchEnum_CmpSuccess) == 0x000116, "Member 'B_Prj_FireCrackerGun_C_ExecuteUbergraph_B_Prj_FireCrackerGun::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(B_Prj_FireCrackerGun_C_ExecuteUbergraph_B_Prj_FireCrackerGun, CallFunc_RandomFloatInRange_ReturnValue) == 0x000118, "Member 'B_Prj_FireCrackerGun_C_ExecuteUbergraph_B_Prj_FireCrackerGun::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_FireCrackerGun_C_ExecuteUbergraph_B_Prj_FireCrackerGun, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00011C, "Member 'B_Prj_FireCrackerGun_C_ExecuteUbergraph_B_Prj_FireCrackerGun::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");

// Function B_Prj_FireCrackerGun.B_Prj_FireCrackerGun_C.OnExploded
// 0x0018 (0x0018 - 0x0000)
struct B_Prj_FireCrackerGun_C_OnExploded final
{
public:
	TArray<class AActor*>                         HitActors;                                         // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm)
	TArray<struct FHitResult>                     HitResults;                                        // 0x000C(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(B_Prj_FireCrackerGun_C_OnExploded) == 0x000004, "Wrong alignment on B_Prj_FireCrackerGun_C_OnExploded");
static_assert(sizeof(B_Prj_FireCrackerGun_C_OnExploded) == 0x000018, "Wrong size on B_Prj_FireCrackerGun_C_OnExploded");
static_assert(offsetof(B_Prj_FireCrackerGun_C_OnExploded, HitActors) == 0x000000, "Member 'B_Prj_FireCrackerGun_C_OnExploded::HitActors' has a wrong offset!");
static_assert(offsetof(B_Prj_FireCrackerGun_C_OnExploded, HitResults) == 0x00000C, "Member 'B_Prj_FireCrackerGun_C_OnExploded::HitResults' has a wrong offset!");

// Function B_Prj_FireCrackerGun.B_Prj_FireCrackerGun_C.OnBounce
// 0x0080 (0x0080 - 0x0000)
struct B_Prj_FireCrackerGun_C_OnBounce final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(B_Prj_FireCrackerGun_C_OnBounce) == 0x000004, "Wrong alignment on B_Prj_FireCrackerGun_C_OnBounce");
static_assert(sizeof(B_Prj_FireCrackerGun_C_OnBounce) == 0x000080, "Wrong size on B_Prj_FireCrackerGun_C_OnBounce");
static_assert(offsetof(B_Prj_FireCrackerGun_C_OnBounce, Hit) == 0x000000, "Member 'B_Prj_FireCrackerGun_C_OnBounce::Hit' has a wrong offset!");

// Function B_Prj_FireCrackerGun.B_Prj_FireCrackerGun_C.UserConstructionScript
// 0x0004 (0x0004 - 0x0000)
struct B_Prj_FireCrackerGun_C_UserConstructionScript final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Prj_FireCrackerGun_C_UserConstructionScript) == 0x000004, "Wrong alignment on B_Prj_FireCrackerGun_C_UserConstructionScript");
static_assert(sizeof(B_Prj_FireCrackerGun_C_UserConstructionScript) == 0x000004, "Wrong size on B_Prj_FireCrackerGun_C_UserConstructionScript");
static_assert(offsetof(B_Prj_FireCrackerGun_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000000, "Member 'B_Prj_FireCrackerGun_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

// Function B_Prj_FireCrackerGun.B_Prj_FireCrackerGun_C.ChooseRandomColor
// 0x0008 (0x0008 - 0x0000)
struct B_Prj_FireCrackerGun_C_ChooseRandomColor final
{
public:
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Prj_FireCrackerGun_C_ChooseRandomColor) == 0x000004, "Wrong alignment on B_Prj_FireCrackerGun_C_ChooseRandomColor");
static_assert(sizeof(B_Prj_FireCrackerGun_C_ChooseRandomColor) == 0x000008, "Wrong size on B_Prj_FireCrackerGun_C_ChooseRandomColor");
static_assert(offsetof(B_Prj_FireCrackerGun_C_ChooseRandomColor, CallFunc_RandomIntegerInRange_ReturnValue) == 0x000000, "Member 'B_Prj_FireCrackerGun_C_ChooseRandomColor::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_FireCrackerGun_C_ChooseRandomColor, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000004, "Member 'B_Prj_FireCrackerGun_C_ChooseRandomColor::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");

// Function B_Prj_FireCrackerGun.B_Prj_FireCrackerGun_C.SetTrailColor
// 0x000C (0x000C - 0x0000)
struct B_Prj_FireCrackerGun_C_SetTrailColor final
{
public:
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Prj_FireCrackerGun_C_SetTrailColor) == 0x000004, "Wrong alignment on B_Prj_FireCrackerGun_C_SetTrailColor");
static_assert(sizeof(B_Prj_FireCrackerGun_C_SetTrailColor) == 0x00000C, "Wrong size on B_Prj_FireCrackerGun_C_SetTrailColor");
static_assert(offsetof(B_Prj_FireCrackerGun_C_SetTrailColor, CallFunc_MakeVector_ReturnValue) == 0x000000, "Member 'B_Prj_FireCrackerGun_C_SetTrailColor::CallFunc_MakeVector_ReturnValue' has a wrong offset!");

// Function B_Prj_FireCrackerGun.B_Prj_FireCrackerGun_C.OnRep_DeathLocation
// 0x001C (0x001C - 0x0000)
struct B_Prj_FireCrackerGun_C_OnRep_DeathLocation final
{
public:
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Prj_FireCrackerGun_C_OnRep_DeathLocation) == 0x000004, "Wrong alignment on B_Prj_FireCrackerGun_C_OnRep_DeathLocation");
static_assert(sizeof(B_Prj_FireCrackerGun_C_OnRep_DeathLocation) == 0x00001C, "Wrong size on B_Prj_FireCrackerGun_C_OnRep_DeathLocation");
static_assert(offsetof(B_Prj_FireCrackerGun_C_OnRep_DeathLocation, CallFunc_MakeVector_ReturnValue) == 0x000000, "Member 'B_Prj_FireCrackerGun_C_OnRep_DeathLocation::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_FireCrackerGun_C_OnRep_DeathLocation, CallFunc_K2_GetActorRotation_ReturnValue) == 0x00000C, "Member 'B_Prj_FireCrackerGun_C_OnRep_DeathLocation::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_FireCrackerGun_C_OnRep_DeathLocation, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000018, "Member 'B_Prj_FireCrackerGun_C_OnRep_DeathLocation::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");

}

#pragma pack(pop)
