#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Prj_SpacePistol_Laser

#include "Basic.hpp"

#include "SpacePistolStruct_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass B_Prj_SpacePistol_Laser.B_Prj_SpacePistol_Laser_C
// 0x010C (0x0524 - 0x0418)
class AB_Prj_SpacePistol_Laser_C final : public AFortProjectileBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0418(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        raygun_projectile_loop_Cue;                        // 0x041C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UBoxComponent*                          ImpactSpawnLocation;                               // 0x0420(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   MeshProjectile;                                    // 0x0424(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UParticleSystemComponent*               Ribbon_Trail_PSC;                                  // 0x0428(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UParticleSystemComponent*               Water_Explosion_PSC;                               // 0x042C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UParticleSystem*                        Ribbon_Trail_PS;                                   // 0x0430(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UParticleSystem*                        Water_Explosion_PS;                                // 0x0434(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UParticleSystem*                        Explosion_Generic_PS;                              // 0x0438(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UParticleSystemComponent*               Explosion_Generic_PSC;                             // 0x043C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class USoundBase*                             Explosion_Generic_Sound;                           // 0x0440(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                StopLocation;                                      // 0x0444(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	TArray<EObjectTypeQuery>                      ObjectsToTraceAgainst;                             // 0x0450(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class UParticleSystem*                        Explosion_Flesh_Damage_PS;                         // 0x045C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               StopRotX;                                          // 0x0460(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         TrailLifetime;                                     // 0x046C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UParticleSystemComponent*               Explosion_Flesh_Damage_PSC;                        // 0x0470(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	int32                                         NumberOfBounces;                                   // 0x0474(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UClass*                                 NewVar;                                            // 0x0478(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UStaticMeshComponent*                   Ribbon_Mesh_Trail_Array;                           // 0x047C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	TArray<class UStaticMeshComponent*>           Ribbon_Mesh_Array;                                 // 0x0480(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<float>                                 Ribbon_Start_Time_Array;                           // 0x048C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class UMaterialInstanceDynamic*>       Ribbon_MID_Array;                                  // 0x0498(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	float                                         BeamWidth;                                         // 0x04A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	TArray<float>                                 Ribbon_End_Time_Array;                             // 0x04A8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FVector>                        Ribbon_Start_Location_Array;                       // 0x04B4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FVector>                        Ribbon_End_Location_Array;                         // 0x04C0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class UMaterialInstanceDynamic*               Current_MID;                                       // 0x04CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         Current_Length;                                    // 0x04D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                Current_Start_Location;                            // 0x04D4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                Current_Location;                                  // 0x04E0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UStaticMeshComponent*                   Current_Beam_Mesh;                                 // 0x04EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               Current_Beam_Rotation;                             // 0x04F0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	TArray<float>                                 Array_Of_Start_Times;                              // 0x04FC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<int32>                                 Ints_to_destroy;                                   // 0x0508(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FSpacePistolStruct>             MeshStartTimeStruct;                               // 0x0514(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	float                                         MaxElementLifeTime;                                // 0x0520(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_B_Prj_SpacePistol_Laser(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void SpawnRibbonTrail();
	void ReceiveActorBeginOverlap(class AActor* OtherActor);
	void OnExploded(const TArray<class AActor*>& HitActors, const TArray<struct FHitResult>& HitResults);
	void ReceiveBeginPlay();
	void OnBounce(const struct FHitResult& Hit);
	void UserConstructionScript();
	void CalculateBeamDistance();
	void KillOldStaticMesh();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Prj_SpacePistol_Laser_C">();
	}
	static class AB_Prj_SpacePistol_Laser_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Prj_SpacePistol_Laser_C>();
	}
};
static_assert(alignof(AB_Prj_SpacePistol_Laser_C) == 0x000004, "Wrong alignment on AB_Prj_SpacePistol_Laser_C");
static_assert(sizeof(AB_Prj_SpacePistol_Laser_C) == 0x000524, "Wrong size on AB_Prj_SpacePistol_Laser_C");
static_assert(offsetof(AB_Prj_SpacePistol_Laser_C, UberGraphFrame) == 0x000418, "Member 'AB_Prj_SpacePistol_Laser_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_Prj_SpacePistol_Laser_C, raygun_projectile_loop_Cue) == 0x00041C, "Member 'AB_Prj_SpacePistol_Laser_C::raygun_projectile_loop_Cue' has a wrong offset!");
static_assert(offsetof(AB_Prj_SpacePistol_Laser_C, ImpactSpawnLocation) == 0x000420, "Member 'AB_Prj_SpacePistol_Laser_C::ImpactSpawnLocation' has a wrong offset!");
static_assert(offsetof(AB_Prj_SpacePistol_Laser_C, MeshProjectile) == 0x000424, "Member 'AB_Prj_SpacePistol_Laser_C::MeshProjectile' has a wrong offset!");
static_assert(offsetof(AB_Prj_SpacePistol_Laser_C, Ribbon_Trail_PSC) == 0x000428, "Member 'AB_Prj_SpacePistol_Laser_C::Ribbon_Trail_PSC' has a wrong offset!");
static_assert(offsetof(AB_Prj_SpacePistol_Laser_C, Water_Explosion_PSC) == 0x00042C, "Member 'AB_Prj_SpacePistol_Laser_C::Water_Explosion_PSC' has a wrong offset!");
static_assert(offsetof(AB_Prj_SpacePistol_Laser_C, Ribbon_Trail_PS) == 0x000430, "Member 'AB_Prj_SpacePistol_Laser_C::Ribbon_Trail_PS' has a wrong offset!");
static_assert(offsetof(AB_Prj_SpacePistol_Laser_C, Water_Explosion_PS) == 0x000434, "Member 'AB_Prj_SpacePistol_Laser_C::Water_Explosion_PS' has a wrong offset!");
static_assert(offsetof(AB_Prj_SpacePistol_Laser_C, Explosion_Generic_PS) == 0x000438, "Member 'AB_Prj_SpacePistol_Laser_C::Explosion_Generic_PS' has a wrong offset!");
static_assert(offsetof(AB_Prj_SpacePistol_Laser_C, Explosion_Generic_PSC) == 0x00043C, "Member 'AB_Prj_SpacePistol_Laser_C::Explosion_Generic_PSC' has a wrong offset!");
static_assert(offsetof(AB_Prj_SpacePistol_Laser_C, Explosion_Generic_Sound) == 0x000440, "Member 'AB_Prj_SpacePistol_Laser_C::Explosion_Generic_Sound' has a wrong offset!");
static_assert(offsetof(AB_Prj_SpacePistol_Laser_C, StopLocation) == 0x000444, "Member 'AB_Prj_SpacePistol_Laser_C::StopLocation' has a wrong offset!");
static_assert(offsetof(AB_Prj_SpacePistol_Laser_C, ObjectsToTraceAgainst) == 0x000450, "Member 'AB_Prj_SpacePistol_Laser_C::ObjectsToTraceAgainst' has a wrong offset!");
static_assert(offsetof(AB_Prj_SpacePistol_Laser_C, Explosion_Flesh_Damage_PS) == 0x00045C, "Member 'AB_Prj_SpacePistol_Laser_C::Explosion_Flesh_Damage_PS' has a wrong offset!");
static_assert(offsetof(AB_Prj_SpacePistol_Laser_C, StopRotX) == 0x000460, "Member 'AB_Prj_SpacePistol_Laser_C::StopRotX' has a wrong offset!");
static_assert(offsetof(AB_Prj_SpacePistol_Laser_C, TrailLifetime) == 0x00046C, "Member 'AB_Prj_SpacePistol_Laser_C::TrailLifetime' has a wrong offset!");
static_assert(offsetof(AB_Prj_SpacePistol_Laser_C, Explosion_Flesh_Damage_PSC) == 0x000470, "Member 'AB_Prj_SpacePistol_Laser_C::Explosion_Flesh_Damage_PSC' has a wrong offset!");
static_assert(offsetof(AB_Prj_SpacePistol_Laser_C, NumberOfBounces) == 0x000474, "Member 'AB_Prj_SpacePistol_Laser_C::NumberOfBounces' has a wrong offset!");
static_assert(offsetof(AB_Prj_SpacePistol_Laser_C, NewVar) == 0x000478, "Member 'AB_Prj_SpacePistol_Laser_C::NewVar' has a wrong offset!");
static_assert(offsetof(AB_Prj_SpacePistol_Laser_C, Ribbon_Mesh_Trail_Array) == 0x00047C, "Member 'AB_Prj_SpacePistol_Laser_C::Ribbon_Mesh_Trail_Array' has a wrong offset!");
static_assert(offsetof(AB_Prj_SpacePistol_Laser_C, Ribbon_Mesh_Array) == 0x000480, "Member 'AB_Prj_SpacePistol_Laser_C::Ribbon_Mesh_Array' has a wrong offset!");
static_assert(offsetof(AB_Prj_SpacePistol_Laser_C, Ribbon_Start_Time_Array) == 0x00048C, "Member 'AB_Prj_SpacePistol_Laser_C::Ribbon_Start_Time_Array' has a wrong offset!");
static_assert(offsetof(AB_Prj_SpacePistol_Laser_C, Ribbon_MID_Array) == 0x000498, "Member 'AB_Prj_SpacePistol_Laser_C::Ribbon_MID_Array' has a wrong offset!");
static_assert(offsetof(AB_Prj_SpacePistol_Laser_C, BeamWidth) == 0x0004A4, "Member 'AB_Prj_SpacePistol_Laser_C::BeamWidth' has a wrong offset!");
static_assert(offsetof(AB_Prj_SpacePistol_Laser_C, Ribbon_End_Time_Array) == 0x0004A8, "Member 'AB_Prj_SpacePistol_Laser_C::Ribbon_End_Time_Array' has a wrong offset!");
static_assert(offsetof(AB_Prj_SpacePistol_Laser_C, Ribbon_Start_Location_Array) == 0x0004B4, "Member 'AB_Prj_SpacePistol_Laser_C::Ribbon_Start_Location_Array' has a wrong offset!");
static_assert(offsetof(AB_Prj_SpacePistol_Laser_C, Ribbon_End_Location_Array) == 0x0004C0, "Member 'AB_Prj_SpacePistol_Laser_C::Ribbon_End_Location_Array' has a wrong offset!");
static_assert(offsetof(AB_Prj_SpacePistol_Laser_C, Current_MID) == 0x0004CC, "Member 'AB_Prj_SpacePistol_Laser_C::Current_MID' has a wrong offset!");
static_assert(offsetof(AB_Prj_SpacePistol_Laser_C, Current_Length) == 0x0004D0, "Member 'AB_Prj_SpacePistol_Laser_C::Current_Length' has a wrong offset!");
static_assert(offsetof(AB_Prj_SpacePistol_Laser_C, Current_Start_Location) == 0x0004D4, "Member 'AB_Prj_SpacePistol_Laser_C::Current_Start_Location' has a wrong offset!");
static_assert(offsetof(AB_Prj_SpacePistol_Laser_C, Current_Location) == 0x0004E0, "Member 'AB_Prj_SpacePistol_Laser_C::Current_Location' has a wrong offset!");
static_assert(offsetof(AB_Prj_SpacePistol_Laser_C, Current_Beam_Mesh) == 0x0004EC, "Member 'AB_Prj_SpacePistol_Laser_C::Current_Beam_Mesh' has a wrong offset!");
static_assert(offsetof(AB_Prj_SpacePistol_Laser_C, Current_Beam_Rotation) == 0x0004F0, "Member 'AB_Prj_SpacePistol_Laser_C::Current_Beam_Rotation' has a wrong offset!");
static_assert(offsetof(AB_Prj_SpacePistol_Laser_C, Array_Of_Start_Times) == 0x0004FC, "Member 'AB_Prj_SpacePistol_Laser_C::Array_Of_Start_Times' has a wrong offset!");
static_assert(offsetof(AB_Prj_SpacePistol_Laser_C, Ints_to_destroy) == 0x000508, "Member 'AB_Prj_SpacePistol_Laser_C::Ints_to_destroy' has a wrong offset!");
static_assert(offsetof(AB_Prj_SpacePistol_Laser_C, MeshStartTimeStruct) == 0x000514, "Member 'AB_Prj_SpacePistol_Laser_C::MeshStartTimeStruct' has a wrong offset!");
static_assert(offsetof(AB_Prj_SpacePistol_Laser_C, MaxElementLifeTime) == 0x000520, "Member 'AB_Prj_SpacePistol_Laser_C::MaxElementLifeTime' has a wrong offset!");

}

#pragma pack(pop)
