#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Prj_PlasmaBall

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function B_Prj_PlasmaBall.B_Prj_PlasmaBall_C.ExecuteUbergraph_B_Prj_PlasmaBall
// 0x00B4 (0x00B4 - 0x0000)
struct B_Prj_PlasmaBall_C_ExecuteUbergraph_B_Prj_PlasmaBall final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_Event_OtherActor;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    K2Node_Event_OtherComp;                            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             K2Node_Event_HitResult;                            // 0x000C(0x0080)(ConstParm, ContainsInstancedReference)
	TArray<class AActor*>                         K2Node_Event_HitActors;                            // 0x008C(0x000C)(ConstParm, ZeroConstructor, ReferenceParm)
	TArray<struct FHitResult>                     K2Node_Event_HitResults;                           // 0x0098(0x000C)(ConstParm, ZeroConstructor, ReferenceParm, ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Prj_PlasmaBall_C_ExecuteUbergraph_B_Prj_PlasmaBall) == 0x000004, "Wrong alignment on B_Prj_PlasmaBall_C_ExecuteUbergraph_B_Prj_PlasmaBall");
static_assert(sizeof(B_Prj_PlasmaBall_C_ExecuteUbergraph_B_Prj_PlasmaBall) == 0x0000B4, "Wrong size on B_Prj_PlasmaBall_C_ExecuteUbergraph_B_Prj_PlasmaBall");
static_assert(offsetof(B_Prj_PlasmaBall_C_ExecuteUbergraph_B_Prj_PlasmaBall, EntryPoint) == 0x000000, "Member 'B_Prj_PlasmaBall_C_ExecuteUbergraph_B_Prj_PlasmaBall::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Prj_PlasmaBall_C_ExecuteUbergraph_B_Prj_PlasmaBall, K2Node_Event_OtherActor) == 0x000004, "Member 'B_Prj_PlasmaBall_C_ExecuteUbergraph_B_Prj_PlasmaBall::K2Node_Event_OtherActor' has a wrong offset!");
static_assert(offsetof(B_Prj_PlasmaBall_C_ExecuteUbergraph_B_Prj_PlasmaBall, K2Node_Event_OtherComp) == 0x000008, "Member 'B_Prj_PlasmaBall_C_ExecuteUbergraph_B_Prj_PlasmaBall::K2Node_Event_OtherComp' has a wrong offset!");
static_assert(offsetof(B_Prj_PlasmaBall_C_ExecuteUbergraph_B_Prj_PlasmaBall, K2Node_Event_HitResult) == 0x00000C, "Member 'B_Prj_PlasmaBall_C_ExecuteUbergraph_B_Prj_PlasmaBall::K2Node_Event_HitResult' has a wrong offset!");
static_assert(offsetof(B_Prj_PlasmaBall_C_ExecuteUbergraph_B_Prj_PlasmaBall, K2Node_Event_HitActors) == 0x00008C, "Member 'B_Prj_PlasmaBall_C_ExecuteUbergraph_B_Prj_PlasmaBall::K2Node_Event_HitActors' has a wrong offset!");
static_assert(offsetof(B_Prj_PlasmaBall_C_ExecuteUbergraph_B_Prj_PlasmaBall, K2Node_Event_HitResults) == 0x000098, "Member 'B_Prj_PlasmaBall_C_ExecuteUbergraph_B_Prj_PlasmaBall::K2Node_Event_HitResults' has a wrong offset!");
static_assert(offsetof(B_Prj_PlasmaBall_C_ExecuteUbergraph_B_Prj_PlasmaBall, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000A4, "Member 'B_Prj_PlasmaBall_C_ExecuteUbergraph_B_Prj_PlasmaBall::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_PlasmaBall_C_ExecuteUbergraph_B_Prj_PlasmaBall, CallFunc_HasAuthority_ReturnValue) == 0x0000B0, "Member 'B_Prj_PlasmaBall_C_ExecuteUbergraph_B_Prj_PlasmaBall::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");

// Function B_Prj_PlasmaBall.B_Prj_PlasmaBall_C.OnTouched
// 0x0088 (0x0088 - 0x0000)
struct B_Prj_PlasmaBall_C_OnTouched final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             HitResult;                                         // 0x0008(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(B_Prj_PlasmaBall_C_OnTouched) == 0x000004, "Wrong alignment on B_Prj_PlasmaBall_C_OnTouched");
static_assert(sizeof(B_Prj_PlasmaBall_C_OnTouched) == 0x000088, "Wrong size on B_Prj_PlasmaBall_C_OnTouched");
static_assert(offsetof(B_Prj_PlasmaBall_C_OnTouched, OtherActor) == 0x000000, "Member 'B_Prj_PlasmaBall_C_OnTouched::OtherActor' has a wrong offset!");
static_assert(offsetof(B_Prj_PlasmaBall_C_OnTouched, OtherComp) == 0x000004, "Member 'B_Prj_PlasmaBall_C_OnTouched::OtherComp' has a wrong offset!");
static_assert(offsetof(B_Prj_PlasmaBall_C_OnTouched, HitResult) == 0x000008, "Member 'B_Prj_PlasmaBall_C_OnTouched::HitResult' has a wrong offset!");

// Function B_Prj_PlasmaBall.B_Prj_PlasmaBall_C.OnExploded
// 0x0018 (0x0018 - 0x0000)
struct B_Prj_PlasmaBall_C_OnExploded final
{
public:
	TArray<class AActor*>                         HitActors;                                         // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm)
	TArray<struct FHitResult>                     HitResults;                                        // 0x000C(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(B_Prj_PlasmaBall_C_OnExploded) == 0x000004, "Wrong alignment on B_Prj_PlasmaBall_C_OnExploded");
static_assert(sizeof(B_Prj_PlasmaBall_C_OnExploded) == 0x000018, "Wrong size on B_Prj_PlasmaBall_C_OnExploded");
static_assert(offsetof(B_Prj_PlasmaBall_C_OnExploded, HitActors) == 0x000000, "Member 'B_Prj_PlasmaBall_C_OnExploded::HitActors' has a wrong offset!");
static_assert(offsetof(B_Prj_PlasmaBall_C_OnExploded, HitResults) == 0x00000C, "Member 'B_Prj_PlasmaBall_C_OnExploded::HitResults' has a wrong offset!");

// Function B_Prj_PlasmaBall.B_Prj_PlasmaBall_C.ChooseRandomColor
// 0x0008 (0x0008 - 0x0000)
struct B_Prj_PlasmaBall_C_ChooseRandomColor final
{
public:
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Prj_PlasmaBall_C_ChooseRandomColor) == 0x000004, "Wrong alignment on B_Prj_PlasmaBall_C_ChooseRandomColor");
static_assert(sizeof(B_Prj_PlasmaBall_C_ChooseRandomColor) == 0x000008, "Wrong size on B_Prj_PlasmaBall_C_ChooseRandomColor");
static_assert(offsetof(B_Prj_PlasmaBall_C_ChooseRandomColor, CallFunc_RandomIntegerInRange_ReturnValue) == 0x000000, "Member 'B_Prj_PlasmaBall_C_ChooseRandomColor::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_PlasmaBall_C_ChooseRandomColor, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000004, "Member 'B_Prj_PlasmaBall_C_ChooseRandomColor::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");

// Function B_Prj_PlasmaBall.B_Prj_PlasmaBall_C.SetTrailColor
// 0x000C (0x000C - 0x0000)
struct B_Prj_PlasmaBall_C_SetTrailColor final
{
public:
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Prj_PlasmaBall_C_SetTrailColor) == 0x000004, "Wrong alignment on B_Prj_PlasmaBall_C_SetTrailColor");
static_assert(sizeof(B_Prj_PlasmaBall_C_SetTrailColor) == 0x00000C, "Wrong size on B_Prj_PlasmaBall_C_SetTrailColor");
static_assert(offsetof(B_Prj_PlasmaBall_C_SetTrailColor, CallFunc_MakeVector_ReturnValue) == 0x000000, "Member 'B_Prj_PlasmaBall_C_SetTrailColor::CallFunc_MakeVector_ReturnValue' has a wrong offset!");

// Function B_Prj_PlasmaBall.B_Prj_PlasmaBall_C.OnRep_DeathLocation
// 0x001C (0x001C - 0x0000)
struct B_Prj_PlasmaBall_C_OnRep_DeathLocation final
{
public:
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Prj_PlasmaBall_C_OnRep_DeathLocation) == 0x000004, "Wrong alignment on B_Prj_PlasmaBall_C_OnRep_DeathLocation");
static_assert(sizeof(B_Prj_PlasmaBall_C_OnRep_DeathLocation) == 0x00001C, "Wrong size on B_Prj_PlasmaBall_C_OnRep_DeathLocation");
static_assert(offsetof(B_Prj_PlasmaBall_C_OnRep_DeathLocation, CallFunc_MakeVector_ReturnValue) == 0x000000, "Member 'B_Prj_PlasmaBall_C_OnRep_DeathLocation::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_PlasmaBall_C_OnRep_DeathLocation, CallFunc_K2_GetActorRotation_ReturnValue) == 0x00000C, "Member 'B_Prj_PlasmaBall_C_OnRep_DeathLocation::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_PlasmaBall_C_OnRep_DeathLocation, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000018, "Member 'B_Prj_PlasmaBall_C_OnRep_DeathLocation::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");

}

#pragma pack(pop)
