#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Prj_Ranged_GrenadeLauncher

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass B_Prj_Ranged_GrenadeLauncher.B_Prj_Ranged_GrenadeLauncher_C
// 0x0100 (0x0518 - 0x0418)
class AB_Prj_Ranged_GrenadeLauncher_C final : public AFortProjectileBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0418(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Mesh;                                              // 0x041C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UParticleSystem*                        RibbonTrail_PS;                                    // 0x0420(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UParticleSystemComponent*               RibbonTrail_PSC;                                   // 0x0424(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         TrailLifetime;                                     // 0x0428(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	EPhysicalSurface                              WaterPhysMat;                                      // 0x042C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42D[0x3];                                      // 0x042D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        Bounce_WaterSplash_PS;                             // 0x0430(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UParticleSystemComponent*               WaterSplash_PSC;                                   // 0x0434(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UParticleSystemComponent*               Bounce_Generic_PSC;                                // 0x0438(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UParticleSystem*                        Bounce_Generic_PS;                                 // 0x043C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UParticleSystem*                        Explosion_PS;                                      // 0x0440(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UParticleSystemComponent*               Explosion_PSC;                                     // 0x0444(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                StopLocation;                                      // 0x0448(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	TArray<EObjectTypeQuery>                      ObjectsToTraceAgainst;                             // 0x0454(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	struct FRotator                               StopRotX;                                          // 0x0460(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class USoundBase*                             Grenade_Explosion_Sound;                           // 0x046C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UParticleSystem*                        Explosion_Flesh_Damage_PS;                         // 0x0470(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UParticleSystem*                        Explosion_Water_PS;                                // 0x0474(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UParticleSystemComponent*               Explosion_Water_PSC;                               // 0x0478(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class AActor*                                 SpawnBounceFXHitActor;                             // 0x047C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FHitResult                             OnBounceHitResult;                                 // 0x0480(0x0080)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	float                                         FuseTimer_Spawn;                                   // 0x0500(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         FuseTimerAfterBounce;                              // 0x0504(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UParticleSystemComponent*               WaterLandDelayRipplePSC;                           // 0x0508(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UParticleSystem*                        WaterLandDelayPS;                                  // 0x050C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UParticleSystemComponent*               GrenadeInWaterLocation;                            // 0x0510(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class USoundBase*                             Grenade_Explosion_Water_Sound;                     // 0x0514(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher(int32 EntryPoint);
	void DelayBeforeExplode_();
	void OnExploded(const TArray<class AActor*>& HitActors, const TArray<struct FHitResult>& HitResults);
	void FuseTimerMax();
	void FuseTimer();
	void ReceiveBeginPlay();
	void OnStop(const struct FHitResult& Hit);
	void OnBounce(const struct FHitResult& Hit);
	void UserConstructionScript();
	void SpawnBounceFX(struct FHitResult& Hit, class AActor** HitActor, EPhysicalSurface* SurfaceType, struct FRotator* HitResultRotation);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Prj_Ranged_GrenadeLauncher_C">();
	}
	static class AB_Prj_Ranged_GrenadeLauncher_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Prj_Ranged_GrenadeLauncher_C>();
	}
};
static_assert(alignof(AB_Prj_Ranged_GrenadeLauncher_C) == 0x000004, "Wrong alignment on AB_Prj_Ranged_GrenadeLauncher_C");
static_assert(sizeof(AB_Prj_Ranged_GrenadeLauncher_C) == 0x000518, "Wrong size on AB_Prj_Ranged_GrenadeLauncher_C");
static_assert(offsetof(AB_Prj_Ranged_GrenadeLauncher_C, UberGraphFrame) == 0x000418, "Member 'AB_Prj_Ranged_GrenadeLauncher_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_GrenadeLauncher_C, Mesh) == 0x00041C, "Member 'AB_Prj_Ranged_GrenadeLauncher_C::Mesh' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_GrenadeLauncher_C, RibbonTrail_PS) == 0x000420, "Member 'AB_Prj_Ranged_GrenadeLauncher_C::RibbonTrail_PS' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_GrenadeLauncher_C, RibbonTrail_PSC) == 0x000424, "Member 'AB_Prj_Ranged_GrenadeLauncher_C::RibbonTrail_PSC' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_GrenadeLauncher_C, TrailLifetime) == 0x000428, "Member 'AB_Prj_Ranged_GrenadeLauncher_C::TrailLifetime' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_GrenadeLauncher_C, WaterPhysMat) == 0x00042C, "Member 'AB_Prj_Ranged_GrenadeLauncher_C::WaterPhysMat' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_GrenadeLauncher_C, Bounce_WaterSplash_PS) == 0x000430, "Member 'AB_Prj_Ranged_GrenadeLauncher_C::Bounce_WaterSplash_PS' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_GrenadeLauncher_C, WaterSplash_PSC) == 0x000434, "Member 'AB_Prj_Ranged_GrenadeLauncher_C::WaterSplash_PSC' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_GrenadeLauncher_C, Bounce_Generic_PSC) == 0x000438, "Member 'AB_Prj_Ranged_GrenadeLauncher_C::Bounce_Generic_PSC' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_GrenadeLauncher_C, Bounce_Generic_PS) == 0x00043C, "Member 'AB_Prj_Ranged_GrenadeLauncher_C::Bounce_Generic_PS' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_GrenadeLauncher_C, Explosion_PS) == 0x000440, "Member 'AB_Prj_Ranged_GrenadeLauncher_C::Explosion_PS' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_GrenadeLauncher_C, Explosion_PSC) == 0x000444, "Member 'AB_Prj_Ranged_GrenadeLauncher_C::Explosion_PSC' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_GrenadeLauncher_C, StopLocation) == 0x000448, "Member 'AB_Prj_Ranged_GrenadeLauncher_C::StopLocation' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_GrenadeLauncher_C, ObjectsToTraceAgainst) == 0x000454, "Member 'AB_Prj_Ranged_GrenadeLauncher_C::ObjectsToTraceAgainst' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_GrenadeLauncher_C, StopRotX) == 0x000460, "Member 'AB_Prj_Ranged_GrenadeLauncher_C::StopRotX' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_GrenadeLauncher_C, Grenade_Explosion_Sound) == 0x00046C, "Member 'AB_Prj_Ranged_GrenadeLauncher_C::Grenade_Explosion_Sound' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_GrenadeLauncher_C, Explosion_Flesh_Damage_PS) == 0x000470, "Member 'AB_Prj_Ranged_GrenadeLauncher_C::Explosion_Flesh_Damage_PS' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_GrenadeLauncher_C, Explosion_Water_PS) == 0x000474, "Member 'AB_Prj_Ranged_GrenadeLauncher_C::Explosion_Water_PS' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_GrenadeLauncher_C, Explosion_Water_PSC) == 0x000478, "Member 'AB_Prj_Ranged_GrenadeLauncher_C::Explosion_Water_PSC' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_GrenadeLauncher_C, SpawnBounceFXHitActor) == 0x00047C, "Member 'AB_Prj_Ranged_GrenadeLauncher_C::SpawnBounceFXHitActor' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_GrenadeLauncher_C, OnBounceHitResult) == 0x000480, "Member 'AB_Prj_Ranged_GrenadeLauncher_C::OnBounceHitResult' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_GrenadeLauncher_C, FuseTimer_Spawn) == 0x000500, "Member 'AB_Prj_Ranged_GrenadeLauncher_C::FuseTimer_Spawn' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_GrenadeLauncher_C, FuseTimerAfterBounce) == 0x000504, "Member 'AB_Prj_Ranged_GrenadeLauncher_C::FuseTimerAfterBounce' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_GrenadeLauncher_C, WaterLandDelayRipplePSC) == 0x000508, "Member 'AB_Prj_Ranged_GrenadeLauncher_C::WaterLandDelayRipplePSC' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_GrenadeLauncher_C, WaterLandDelayPS) == 0x00050C, "Member 'AB_Prj_Ranged_GrenadeLauncher_C::WaterLandDelayPS' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_GrenadeLauncher_C, GrenadeInWaterLocation) == 0x000510, "Member 'AB_Prj_Ranged_GrenadeLauncher_C::GrenadeInWaterLocation' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_GrenadeLauncher_C, Grenade_Explosion_Water_Sound) == 0x000514, "Member 'AB_Prj_Ranged_GrenadeLauncher_C::Grenade_Explosion_Water_Sound' has a wrong offset!");

}

#pragma pack(pop)
