#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Prj_BottleRocket

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function B_Prj_BottleRocket.B_Prj_BottleRocket_C.ExecuteUbergraph_B_Prj_BottleRocket
// 0x0130 (0x0130 - 0x0000)
struct B_Prj_BottleRocket_C_ExecuteUbergraph_B_Prj_BottleRocket final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x0004(0x0080)(ConstParm, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_86[0x2];                                       // 0x0086(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0098(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x00A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x00D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x00E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_Event_HitActors;                            // 0x00F4(0x000C)(ConstParm, ZeroConstructor, ReferenceParm)
	TArray<struct FHitResult>                     K2Node_Event_HitResults;                           // 0x0100(0x000C)(ConstParm, ZeroConstructor, ReferenceParm, ContainsInstancedReference)
	EFortTeamAffiliation                          CallFunc_GetTeamAffiliation_ReturnValue;           // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x010D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10E[0x2];                                      // 0x010E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0110(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x011C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Prj_BottleRocket_C_ExecuteUbergraph_B_Prj_BottleRocket) == 0x000004, "Wrong alignment on B_Prj_BottleRocket_C_ExecuteUbergraph_B_Prj_BottleRocket");
static_assert(sizeof(B_Prj_BottleRocket_C_ExecuteUbergraph_B_Prj_BottleRocket) == 0x000130, "Wrong size on B_Prj_BottleRocket_C_ExecuteUbergraph_B_Prj_BottleRocket");
static_assert(offsetof(B_Prj_BottleRocket_C_ExecuteUbergraph_B_Prj_BottleRocket, EntryPoint) == 0x000000, "Member 'B_Prj_BottleRocket_C_ExecuteUbergraph_B_Prj_BottleRocket::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Prj_BottleRocket_C_ExecuteUbergraph_B_Prj_BottleRocket, K2Node_Event_Hit) == 0x000004, "Member 'B_Prj_BottleRocket_C_ExecuteUbergraph_B_Prj_BottleRocket::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(B_Prj_BottleRocket_C_ExecuteUbergraph_B_Prj_BottleRocket, CallFunc_BreakHitResult_bBlockingHit) == 0x000084, "Member 'B_Prj_BottleRocket_C_ExecuteUbergraph_B_Prj_BottleRocket::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(B_Prj_BottleRocket_C_ExecuteUbergraph_B_Prj_BottleRocket, CallFunc_BreakHitResult_bInitialOverlap) == 0x000085, "Member 'B_Prj_BottleRocket_C_ExecuteUbergraph_B_Prj_BottleRocket::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(B_Prj_BottleRocket_C_ExecuteUbergraph_B_Prj_BottleRocket, CallFunc_BreakHitResult_Time) == 0x000088, "Member 'B_Prj_BottleRocket_C_ExecuteUbergraph_B_Prj_BottleRocket::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(B_Prj_BottleRocket_C_ExecuteUbergraph_B_Prj_BottleRocket, CallFunc_BreakHitResult_Location) == 0x00008C, "Member 'B_Prj_BottleRocket_C_ExecuteUbergraph_B_Prj_BottleRocket::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(B_Prj_BottleRocket_C_ExecuteUbergraph_B_Prj_BottleRocket, CallFunc_BreakHitResult_ImpactPoint) == 0x000098, "Member 'B_Prj_BottleRocket_C_ExecuteUbergraph_B_Prj_BottleRocket::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(B_Prj_BottleRocket_C_ExecuteUbergraph_B_Prj_BottleRocket, CallFunc_BreakHitResult_Normal) == 0x0000A4, "Member 'B_Prj_BottleRocket_C_ExecuteUbergraph_B_Prj_BottleRocket::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(B_Prj_BottleRocket_C_ExecuteUbergraph_B_Prj_BottleRocket, CallFunc_BreakHitResult_ImpactNormal) == 0x0000B0, "Member 'B_Prj_BottleRocket_C_ExecuteUbergraph_B_Prj_BottleRocket::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(B_Prj_BottleRocket_C_ExecuteUbergraph_B_Prj_BottleRocket, CallFunc_BreakHitResult_PhysMat) == 0x0000BC, "Member 'B_Prj_BottleRocket_C_ExecuteUbergraph_B_Prj_BottleRocket::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(B_Prj_BottleRocket_C_ExecuteUbergraph_B_Prj_BottleRocket, CallFunc_BreakHitResult_HitActor) == 0x0000C0, "Member 'B_Prj_BottleRocket_C_ExecuteUbergraph_B_Prj_BottleRocket::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(B_Prj_BottleRocket_C_ExecuteUbergraph_B_Prj_BottleRocket, CallFunc_BreakHitResult_HitComponent) == 0x0000C4, "Member 'B_Prj_BottleRocket_C_ExecuteUbergraph_B_Prj_BottleRocket::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(B_Prj_BottleRocket_C_ExecuteUbergraph_B_Prj_BottleRocket, CallFunc_BreakHitResult_HitBoneName) == 0x0000C8, "Member 'B_Prj_BottleRocket_C_ExecuteUbergraph_B_Prj_BottleRocket::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(B_Prj_BottleRocket_C_ExecuteUbergraph_B_Prj_BottleRocket, CallFunc_BreakHitResult_HitItem) == 0x0000D0, "Member 'B_Prj_BottleRocket_C_ExecuteUbergraph_B_Prj_BottleRocket::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(B_Prj_BottleRocket_C_ExecuteUbergraph_B_Prj_BottleRocket, CallFunc_BreakHitResult_TraceStart) == 0x0000D4, "Member 'B_Prj_BottleRocket_C_ExecuteUbergraph_B_Prj_BottleRocket::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(B_Prj_BottleRocket_C_ExecuteUbergraph_B_Prj_BottleRocket, CallFunc_BreakHitResult_TraceEnd) == 0x0000E0, "Member 'B_Prj_BottleRocket_C_ExecuteUbergraph_B_Prj_BottleRocket::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(B_Prj_BottleRocket_C_ExecuteUbergraph_B_Prj_BottleRocket, K2Node_DynamicCast_AsFort_Pawn) == 0x0000EC, "Member 'B_Prj_BottleRocket_C_ExecuteUbergraph_B_Prj_BottleRocket::K2Node_DynamicCast_AsFort_Pawn' has a wrong offset!");
static_assert(offsetof(B_Prj_BottleRocket_C_ExecuteUbergraph_B_Prj_BottleRocket, K2Node_DynamicCast_bSuccess) == 0x0000F0, "Member 'B_Prj_BottleRocket_C_ExecuteUbergraph_B_Prj_BottleRocket::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_Prj_BottleRocket_C_ExecuteUbergraph_B_Prj_BottleRocket, K2Node_Event_HitActors) == 0x0000F4, "Member 'B_Prj_BottleRocket_C_ExecuteUbergraph_B_Prj_BottleRocket::K2Node_Event_HitActors' has a wrong offset!");
static_assert(offsetof(B_Prj_BottleRocket_C_ExecuteUbergraph_B_Prj_BottleRocket, K2Node_Event_HitResults) == 0x000100, "Member 'B_Prj_BottleRocket_C_ExecuteUbergraph_B_Prj_BottleRocket::K2Node_Event_HitResults' has a wrong offset!");
static_assert(offsetof(B_Prj_BottleRocket_C_ExecuteUbergraph_B_Prj_BottleRocket, CallFunc_GetTeamAffiliation_ReturnValue) == 0x00010C, "Member 'B_Prj_BottleRocket_C_ExecuteUbergraph_B_Prj_BottleRocket::CallFunc_GetTeamAffiliation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_BottleRocket_C_ExecuteUbergraph_B_Prj_BottleRocket, K2Node_SwitchEnum_CmpSuccess) == 0x00010D, "Member 'B_Prj_BottleRocket_C_ExecuteUbergraph_B_Prj_BottleRocket::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(B_Prj_BottleRocket_C_ExecuteUbergraph_B_Prj_BottleRocket, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000110, "Member 'B_Prj_BottleRocket_C_ExecuteUbergraph_B_Prj_BottleRocket::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_BottleRocket_C_ExecuteUbergraph_B_Prj_BottleRocket, CallFunc_K2_GetActorRotation_ReturnValue) == 0x00011C, "Member 'B_Prj_BottleRocket_C_ExecuteUbergraph_B_Prj_BottleRocket::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_BottleRocket_C_ExecuteUbergraph_B_Prj_BottleRocket, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000128, "Member 'B_Prj_BottleRocket_C_ExecuteUbergraph_B_Prj_BottleRocket::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_BottleRocket_C_ExecuteUbergraph_B_Prj_BottleRocket, CallFunc_RandomFloatInRange_ReturnValue) == 0x00012C, "Member 'B_Prj_BottleRocket_C_ExecuteUbergraph_B_Prj_BottleRocket::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");

// Function B_Prj_BottleRocket.B_Prj_BottleRocket_C.OnExploded
// 0x0018 (0x0018 - 0x0000)
struct B_Prj_BottleRocket_C_OnExploded final
{
public:
	TArray<class AActor*>                         HitActors;                                         // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm)
	TArray<struct FHitResult>                     HitResults;                                        // 0x000C(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(B_Prj_BottleRocket_C_OnExploded) == 0x000004, "Wrong alignment on B_Prj_BottleRocket_C_OnExploded");
static_assert(sizeof(B_Prj_BottleRocket_C_OnExploded) == 0x000018, "Wrong size on B_Prj_BottleRocket_C_OnExploded");
static_assert(offsetof(B_Prj_BottleRocket_C_OnExploded, HitActors) == 0x000000, "Member 'B_Prj_BottleRocket_C_OnExploded::HitActors' has a wrong offset!");
static_assert(offsetof(B_Prj_BottleRocket_C_OnExploded, HitResults) == 0x00000C, "Member 'B_Prj_BottleRocket_C_OnExploded::HitResults' has a wrong offset!");

// Function B_Prj_BottleRocket.B_Prj_BottleRocket_C.OnBounce
// 0x0080 (0x0080 - 0x0000)
struct B_Prj_BottleRocket_C_OnBounce final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(B_Prj_BottleRocket_C_OnBounce) == 0x000004, "Wrong alignment on B_Prj_BottleRocket_C_OnBounce");
static_assert(sizeof(B_Prj_BottleRocket_C_OnBounce) == 0x000080, "Wrong size on B_Prj_BottleRocket_C_OnBounce");
static_assert(offsetof(B_Prj_BottleRocket_C_OnBounce, Hit) == 0x000000, "Member 'B_Prj_BottleRocket_C_OnBounce::Hit' has a wrong offset!");

// Function B_Prj_BottleRocket.B_Prj_BottleRocket_C.UserConstructionScript
// 0x0004 (0x0004 - 0x0000)
struct B_Prj_BottleRocket_C_UserConstructionScript final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Prj_BottleRocket_C_UserConstructionScript) == 0x000004, "Wrong alignment on B_Prj_BottleRocket_C_UserConstructionScript");
static_assert(sizeof(B_Prj_BottleRocket_C_UserConstructionScript) == 0x000004, "Wrong size on B_Prj_BottleRocket_C_UserConstructionScript");
static_assert(offsetof(B_Prj_BottleRocket_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000000, "Member 'B_Prj_BottleRocket_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

}

#pragma pack(pop)
