#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Rifle_AMR_

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "B_Rifle_Generic_classes.hpp"
#include "FortniteGame_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass B_Rifle_AMR_.B_Rifle_AMR__C
// 0x0100 (0x0874 - 0x0774)
class AB_Rifle_AMR__C final : public AB_Rifle_Generic_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_B_Rifle_AMR__C;                     // 0x0774(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Sm_AMR_Glass_01;                                   // 0x0778(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UParticleSystemComponent*               ResidualArcsSide1;                                 // 0x077C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UParticleSystemComponent*               ResidualArcsTop2;                                  // 0x0780(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UParticleSystemComponent*               ResidualArcsTop1;                                  // 0x0784(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   AMRFan;                                            // 0x0788(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UParticleSystemComponent*               MuzzleLight;                                       // 0x078C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UAudioComponent*                        FullCharge_AudioComponent;                         // 0x0790(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UAudioComponent*                        Ambient_Charge_AudioComponent;                     // 0x0794(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UParticleSystemComponent*               ElectrodeParticles;                                // 0x0798(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UParticleSystemComponent*               CoreParticles;                                     // 0x079C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UAudioComponent*                        ChargeUpAudioComponent;                            // 0x07A0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	float                                         springVal_springValCurve_19C9CAF7430F18C57C30EEB8B27BB863; // 0x07A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ETimelineDirection                            springVal__Direction_19C9CAF7430F18C57C30EEB8B27BB863; // 0x07A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7A9[0x3];                                      // 0x07A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     springVal;                                         // 0x07AC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         SpeedupAnims_AnimSpeed_4BE614164949BF46F88AF89FFA49AC84; // 0x07B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ETimelineDirection                            SpeedupAnims__Direction_4BE614164949BF46F88AF89FFA49AC84; // 0x07B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7B5[0x3];                                      // 0x07B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     SpeedupAnims;                                      // 0x07B8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         ScaleUpParticles_SpawnRate_134097C245AF92F7626E499F105F4F08; // 0x07BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ETimelineDirection                            ScaleUpParticles__Direction_134097C245AF92F7626E499F105F4F08; // 0x07C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7C1[0x3];                                      // 0x07C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     ScaleUpParticles;                                  // 0x07C4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         SlowdownAnims_AnimSpeed_861C42174FEA1A3B1FFB238DCA1A8207; // 0x07C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ETimelineDirection                            SlowdownAnims__Direction_861C42174FEA1A3B1FFB238DCA1A8207; // 0x07CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7CD[0x3];                                      // 0x07CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     SlowdownAnims;                                     // 0x07D0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CameraShake_EmptyTrack_A501A62D44A8C5DE030C0FA3AC55D0FA; // 0x07D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ETimelineDirection                            CameraShake__Direction_A501A62D44A8C5DE030C0FA3AC55D0FA; // 0x07D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D9[0x3];                                      // 0x07D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     CameraShake;                                       // 0x07DC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         ScaleDownParticles_SpawnRate_E96B2C9C41611147588502950D688A78; // 0x07E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ETimelineDirection                            ScaleDownParticles__Direction_E96B2C9C41611147588502950D688A78; // 0x07E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7E5[0x3];                                      // 0x07E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     ScaleDownParticles;                                // 0x07E8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CoreParticlesTimeline_Spin__0D7994D0489B341BD5611B9B1C93A340; // 0x07EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ETimelineDirection                            CoreParticlesTimeline__Direction_0D7994D0489B341BD5611B9B1C93A340; // 0x07F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7F1[0x3];                                      // 0x07F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     CoreParticlesTimeline;                             // 0x07F4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         Reload_PItchChange_Reload_Pitch_2ACDF03E41971FCD38582BA4D7AEF983; // 0x07F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ETimelineDirection                            Reload_PItchChange__Direction_2ACDF03E41971FCD38582BA4D7AEF983; // 0x07FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7FD[0x3];                                      // 0x07FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Reload_PItchChange;                                // 0x0800(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CoreParticlesSpawnRate_Uncharged_;                 // 0x0804(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         CoreParticlesSpawnRate_Charged_;                   // 0x0808(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UParticleSystem*                        ChargedBeam;                                       // 0x080C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UParticleSystem*                        DefaultBeam;                                       // 0x0810(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         AnimationRate_Uncharged_;                          // 0x0814(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         AnimationRate_Charged_;                            // 0x0818(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         CoreParticlesTimeDilation_Uncharged_;              // 0x081C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         CoreParticlesTimeDilation_Charged_;                // 0x0820(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         CoreParticlesSpinRate_Charged_;                    // 0x0824(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         ElectrodeParticlesEnergizedSpawnRate_Uncharged_;   // 0x0828(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         ElectrodeParticlesEnergizedSpawnRate_Charged_;     // 0x082C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Reached_Min_Charge;                                // 0x0830(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_831[0x3];                                      // 0x0831(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               BarrelGlowMID;                                     // 0x0834(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FLinearColor                           BarrelGlowColor_Uncharged_;                        // 0x0838(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FLinearColor                           BarrelGlowColor_Charged_;                          // 0x0848(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UParticleSystem*                        MuzzleFlash_Uncharged_;                            // 0x0858(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UParticleSystem*                        MuzzleFlash_Charged_;                              // 0x085C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         Muzzle_Flash_Light_Intensity__Charged_;            // 0x0860(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         Muzzle_Flash_Light_Intensity__Uncharged_;          // 0x0864(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         TurbineSpinRate_Charged_;                          // 0x0868(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         TurbineSpinRate_Uncharged_;                        // 0x086C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         AnimationRate_Reloading_;                          // 0x0870(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_B_Rifle_AMR_(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void K2_OnUnEquip();
	void OnWeaponAttached();
	void BndEvt__MuzzlePSC_K2Node_ComponentBoundEvent_143_ParticleSpawnSignature__DelegateSignature(class FName EventName, float EmitterTime, const struct FVector& Location, const struct FVector& Velocity);
	void EndOfCharge();
	void StopMaxChargedParticles();
	void OnPlayWeaponFireFX(bool bPersistentFire);
	void OnReachedMaxCharge();
	void OnStartCharge();
	void OnEndCharge();
	void OnReachedMinCharge();
	void Muzzle_Play_Reload_FX(EFortReloadFXState Selection);
	void OnPlayReloadFX(EFortReloadFXState ReloadStage);
	void ReceiveBeginPlay();
	void CoreParticlesTimeline__UpdateFunc();
	void CoreParticlesTimeline__FinishedFunc();
	void SlowdownAnims__UpdateFunc();
	void SlowdownAnims__FinishedFunc();
	void SpeedupAnims__UpdateFunc();
	void SpeedupAnims__FinishedFunc();
	void springVal__UpdateFunc();
	void springVal__FinishedFunc();
	void CameraShake__UpdateFunc();
	void CameraShake__FinishedFunc();
	void ScaleUpParticles__UpdateFunc();
	void ScaleUpParticles__FinishedFunc();
	void ScaleDownParticles__UpdateFunc();
	void ScaleDownParticles__FinishedFunc();
	void Reload_PItchChange__UpdateFunc();
	void Reload_PItchChange__FinishedFunc();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Rifle_AMR__C">();
	}
	static class AB_Rifle_AMR__C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Rifle_AMR__C>();
	}
};
static_assert(alignof(AB_Rifle_AMR__C) == 0x000004, "Wrong alignment on AB_Rifle_AMR__C");
static_assert(sizeof(AB_Rifle_AMR__C) == 0x000874, "Wrong size on AB_Rifle_AMR__C");
static_assert(offsetof(AB_Rifle_AMR__C, UberGraphFrame_B_Rifle_AMR__C) == 0x000774, "Member 'AB_Rifle_AMR__C::UberGraphFrame_B_Rifle_AMR__C' has a wrong offset!");
static_assert(offsetof(AB_Rifle_AMR__C, Sm_AMR_Glass_01) == 0x000778, "Member 'AB_Rifle_AMR__C::Sm_AMR_Glass_01' has a wrong offset!");
static_assert(offsetof(AB_Rifle_AMR__C, ResidualArcsSide1) == 0x00077C, "Member 'AB_Rifle_AMR__C::ResidualArcsSide1' has a wrong offset!");
static_assert(offsetof(AB_Rifle_AMR__C, ResidualArcsTop2) == 0x000780, "Member 'AB_Rifle_AMR__C::ResidualArcsTop2' has a wrong offset!");
static_assert(offsetof(AB_Rifle_AMR__C, ResidualArcsTop1) == 0x000784, "Member 'AB_Rifle_AMR__C::ResidualArcsTop1' has a wrong offset!");
static_assert(offsetof(AB_Rifle_AMR__C, AMRFan) == 0x000788, "Member 'AB_Rifle_AMR__C::AMRFan' has a wrong offset!");
static_assert(offsetof(AB_Rifle_AMR__C, MuzzleLight) == 0x00078C, "Member 'AB_Rifle_AMR__C::MuzzleLight' has a wrong offset!");
static_assert(offsetof(AB_Rifle_AMR__C, FullCharge_AudioComponent) == 0x000790, "Member 'AB_Rifle_AMR__C::FullCharge_AudioComponent' has a wrong offset!");
static_assert(offsetof(AB_Rifle_AMR__C, Ambient_Charge_AudioComponent) == 0x000794, "Member 'AB_Rifle_AMR__C::Ambient_Charge_AudioComponent' has a wrong offset!");
static_assert(offsetof(AB_Rifle_AMR__C, ElectrodeParticles) == 0x000798, "Member 'AB_Rifle_AMR__C::ElectrodeParticles' has a wrong offset!");
static_assert(offsetof(AB_Rifle_AMR__C, CoreParticles) == 0x00079C, "Member 'AB_Rifle_AMR__C::CoreParticles' has a wrong offset!");
static_assert(offsetof(AB_Rifle_AMR__C, ChargeUpAudioComponent) == 0x0007A0, "Member 'AB_Rifle_AMR__C::ChargeUpAudioComponent' has a wrong offset!");
static_assert(offsetof(AB_Rifle_AMR__C, springVal_springValCurve_19C9CAF7430F18C57C30EEB8B27BB863) == 0x0007A4, "Member 'AB_Rifle_AMR__C::springVal_springValCurve_19C9CAF7430F18C57C30EEB8B27BB863' has a wrong offset!");
static_assert(offsetof(AB_Rifle_AMR__C, springVal__Direction_19C9CAF7430F18C57C30EEB8B27BB863) == 0x0007A8, "Member 'AB_Rifle_AMR__C::springVal__Direction_19C9CAF7430F18C57C30EEB8B27BB863' has a wrong offset!");
static_assert(offsetof(AB_Rifle_AMR__C, springVal) == 0x0007AC, "Member 'AB_Rifle_AMR__C::springVal' has a wrong offset!");
static_assert(offsetof(AB_Rifle_AMR__C, SpeedupAnims_AnimSpeed_4BE614164949BF46F88AF89FFA49AC84) == 0x0007B0, "Member 'AB_Rifle_AMR__C::SpeedupAnims_AnimSpeed_4BE614164949BF46F88AF89FFA49AC84' has a wrong offset!");
static_assert(offsetof(AB_Rifle_AMR__C, SpeedupAnims__Direction_4BE614164949BF46F88AF89FFA49AC84) == 0x0007B4, "Member 'AB_Rifle_AMR__C::SpeedupAnims__Direction_4BE614164949BF46F88AF89FFA49AC84' has a wrong offset!");
static_assert(offsetof(AB_Rifle_AMR__C, SpeedupAnims) == 0x0007B8, "Member 'AB_Rifle_AMR__C::SpeedupAnims' has a wrong offset!");
static_assert(offsetof(AB_Rifle_AMR__C, ScaleUpParticles_SpawnRate_134097C245AF92F7626E499F105F4F08) == 0x0007BC, "Member 'AB_Rifle_AMR__C::ScaleUpParticles_SpawnRate_134097C245AF92F7626E499F105F4F08' has a wrong offset!");
static_assert(offsetof(AB_Rifle_AMR__C, ScaleUpParticles__Direction_134097C245AF92F7626E499F105F4F08) == 0x0007C0, "Member 'AB_Rifle_AMR__C::ScaleUpParticles__Direction_134097C245AF92F7626E499F105F4F08' has a wrong offset!");
static_assert(offsetof(AB_Rifle_AMR__C, ScaleUpParticles) == 0x0007C4, "Member 'AB_Rifle_AMR__C::ScaleUpParticles' has a wrong offset!");
static_assert(offsetof(AB_Rifle_AMR__C, SlowdownAnims_AnimSpeed_861C42174FEA1A3B1FFB238DCA1A8207) == 0x0007C8, "Member 'AB_Rifle_AMR__C::SlowdownAnims_AnimSpeed_861C42174FEA1A3B1FFB238DCA1A8207' has a wrong offset!");
static_assert(offsetof(AB_Rifle_AMR__C, SlowdownAnims__Direction_861C42174FEA1A3B1FFB238DCA1A8207) == 0x0007CC, "Member 'AB_Rifle_AMR__C::SlowdownAnims__Direction_861C42174FEA1A3B1FFB238DCA1A8207' has a wrong offset!");
static_assert(offsetof(AB_Rifle_AMR__C, SlowdownAnims) == 0x0007D0, "Member 'AB_Rifle_AMR__C::SlowdownAnims' has a wrong offset!");
static_assert(offsetof(AB_Rifle_AMR__C, CameraShake_EmptyTrack_A501A62D44A8C5DE030C0FA3AC55D0FA) == 0x0007D4, "Member 'AB_Rifle_AMR__C::CameraShake_EmptyTrack_A501A62D44A8C5DE030C0FA3AC55D0FA' has a wrong offset!");
static_assert(offsetof(AB_Rifle_AMR__C, CameraShake__Direction_A501A62D44A8C5DE030C0FA3AC55D0FA) == 0x0007D8, "Member 'AB_Rifle_AMR__C::CameraShake__Direction_A501A62D44A8C5DE030C0FA3AC55D0FA' has a wrong offset!");
static_assert(offsetof(AB_Rifle_AMR__C, CameraShake) == 0x0007DC, "Member 'AB_Rifle_AMR__C::CameraShake' has a wrong offset!");
static_assert(offsetof(AB_Rifle_AMR__C, ScaleDownParticles_SpawnRate_E96B2C9C41611147588502950D688A78) == 0x0007E0, "Member 'AB_Rifle_AMR__C::ScaleDownParticles_SpawnRate_E96B2C9C41611147588502950D688A78' has a wrong offset!");
static_assert(offsetof(AB_Rifle_AMR__C, ScaleDownParticles__Direction_E96B2C9C41611147588502950D688A78) == 0x0007E4, "Member 'AB_Rifle_AMR__C::ScaleDownParticles__Direction_E96B2C9C41611147588502950D688A78' has a wrong offset!");
static_assert(offsetof(AB_Rifle_AMR__C, ScaleDownParticles) == 0x0007E8, "Member 'AB_Rifle_AMR__C::ScaleDownParticles' has a wrong offset!");
static_assert(offsetof(AB_Rifle_AMR__C, CoreParticlesTimeline_Spin__0D7994D0489B341BD5611B9B1C93A340) == 0x0007EC, "Member 'AB_Rifle_AMR__C::CoreParticlesTimeline_Spin__0D7994D0489B341BD5611B9B1C93A340' has a wrong offset!");
static_assert(offsetof(AB_Rifle_AMR__C, CoreParticlesTimeline__Direction_0D7994D0489B341BD5611B9B1C93A340) == 0x0007F0, "Member 'AB_Rifle_AMR__C::CoreParticlesTimeline__Direction_0D7994D0489B341BD5611B9B1C93A340' has a wrong offset!");
static_assert(offsetof(AB_Rifle_AMR__C, CoreParticlesTimeline) == 0x0007F4, "Member 'AB_Rifle_AMR__C::CoreParticlesTimeline' has a wrong offset!");
static_assert(offsetof(AB_Rifle_AMR__C, Reload_PItchChange_Reload_Pitch_2ACDF03E41971FCD38582BA4D7AEF983) == 0x0007F8, "Member 'AB_Rifle_AMR__C::Reload_PItchChange_Reload_Pitch_2ACDF03E41971FCD38582BA4D7AEF983' has a wrong offset!");
static_assert(offsetof(AB_Rifle_AMR__C, Reload_PItchChange__Direction_2ACDF03E41971FCD38582BA4D7AEF983) == 0x0007FC, "Member 'AB_Rifle_AMR__C::Reload_PItchChange__Direction_2ACDF03E41971FCD38582BA4D7AEF983' has a wrong offset!");
static_assert(offsetof(AB_Rifle_AMR__C, Reload_PItchChange) == 0x000800, "Member 'AB_Rifle_AMR__C::Reload_PItchChange' has a wrong offset!");
static_assert(offsetof(AB_Rifle_AMR__C, CoreParticlesSpawnRate_Uncharged_) == 0x000804, "Member 'AB_Rifle_AMR__C::CoreParticlesSpawnRate_Uncharged_' has a wrong offset!");
static_assert(offsetof(AB_Rifle_AMR__C, CoreParticlesSpawnRate_Charged_) == 0x000808, "Member 'AB_Rifle_AMR__C::CoreParticlesSpawnRate_Charged_' has a wrong offset!");
static_assert(offsetof(AB_Rifle_AMR__C, ChargedBeam) == 0x00080C, "Member 'AB_Rifle_AMR__C::ChargedBeam' has a wrong offset!");
static_assert(offsetof(AB_Rifle_AMR__C, DefaultBeam) == 0x000810, "Member 'AB_Rifle_AMR__C::DefaultBeam' has a wrong offset!");
static_assert(offsetof(AB_Rifle_AMR__C, AnimationRate_Uncharged_) == 0x000814, "Member 'AB_Rifle_AMR__C::AnimationRate_Uncharged_' has a wrong offset!");
static_assert(offsetof(AB_Rifle_AMR__C, AnimationRate_Charged_) == 0x000818, "Member 'AB_Rifle_AMR__C::AnimationRate_Charged_' has a wrong offset!");
static_assert(offsetof(AB_Rifle_AMR__C, CoreParticlesTimeDilation_Uncharged_) == 0x00081C, "Member 'AB_Rifle_AMR__C::CoreParticlesTimeDilation_Uncharged_' has a wrong offset!");
static_assert(offsetof(AB_Rifle_AMR__C, CoreParticlesTimeDilation_Charged_) == 0x000820, "Member 'AB_Rifle_AMR__C::CoreParticlesTimeDilation_Charged_' has a wrong offset!");
static_assert(offsetof(AB_Rifle_AMR__C, CoreParticlesSpinRate_Charged_) == 0x000824, "Member 'AB_Rifle_AMR__C::CoreParticlesSpinRate_Charged_' has a wrong offset!");
static_assert(offsetof(AB_Rifle_AMR__C, ElectrodeParticlesEnergizedSpawnRate_Uncharged_) == 0x000828, "Member 'AB_Rifle_AMR__C::ElectrodeParticlesEnergizedSpawnRate_Uncharged_' has a wrong offset!");
static_assert(offsetof(AB_Rifle_AMR__C, ElectrodeParticlesEnergizedSpawnRate_Charged_) == 0x00082C, "Member 'AB_Rifle_AMR__C::ElectrodeParticlesEnergizedSpawnRate_Charged_' has a wrong offset!");
static_assert(offsetof(AB_Rifle_AMR__C, Reached_Min_Charge) == 0x000830, "Member 'AB_Rifle_AMR__C::Reached_Min_Charge' has a wrong offset!");
static_assert(offsetof(AB_Rifle_AMR__C, BarrelGlowMID) == 0x000834, "Member 'AB_Rifle_AMR__C::BarrelGlowMID' has a wrong offset!");
static_assert(offsetof(AB_Rifle_AMR__C, BarrelGlowColor_Uncharged_) == 0x000838, "Member 'AB_Rifle_AMR__C::BarrelGlowColor_Uncharged_' has a wrong offset!");
static_assert(offsetof(AB_Rifle_AMR__C, BarrelGlowColor_Charged_) == 0x000848, "Member 'AB_Rifle_AMR__C::BarrelGlowColor_Charged_' has a wrong offset!");
static_assert(offsetof(AB_Rifle_AMR__C, MuzzleFlash_Uncharged_) == 0x000858, "Member 'AB_Rifle_AMR__C::MuzzleFlash_Uncharged_' has a wrong offset!");
static_assert(offsetof(AB_Rifle_AMR__C, MuzzleFlash_Charged_) == 0x00085C, "Member 'AB_Rifle_AMR__C::MuzzleFlash_Charged_' has a wrong offset!");
static_assert(offsetof(AB_Rifle_AMR__C, Muzzle_Flash_Light_Intensity__Charged_) == 0x000860, "Member 'AB_Rifle_AMR__C::Muzzle_Flash_Light_Intensity__Charged_' has a wrong offset!");
static_assert(offsetof(AB_Rifle_AMR__C, Muzzle_Flash_Light_Intensity__Uncharged_) == 0x000864, "Member 'AB_Rifle_AMR__C::Muzzle_Flash_Light_Intensity__Uncharged_' has a wrong offset!");
static_assert(offsetof(AB_Rifle_AMR__C, TurbineSpinRate_Charged_) == 0x000868, "Member 'AB_Rifle_AMR__C::TurbineSpinRate_Charged_' has a wrong offset!");
static_assert(offsetof(AB_Rifle_AMR__C, TurbineSpinRate_Uncharged_) == 0x00086C, "Member 'AB_Rifle_AMR__C::TurbineSpinRate_Uncharged_' has a wrong offset!");
static_assert(offsetof(AB_Rifle_AMR__C, AnimationRate_Reloading_) == 0x000870, "Member 'AB_Rifle_AMR__C::AnimationRate_Reloading_' has a wrong offset!");

}

#pragma pack(pop)
