#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Rifle_AMR_

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function B_Rifle_AMR_.B_Rifle_AMR__C.ExecuteUbergraph_B_Rifle_AMR_
// 0x01B0 (0x01B0 - 0x0000)
struct B_Rifle_AMR__C_ExecuteUbergraph_B_Rifle_AMR_ final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable2;                      // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable2;                // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable3;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable3;                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortReloadFXState                            K2Node_Event_ReloadStage;                          // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortReloadFXState                            K2Node_Event_Selection;                            // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bPersistentFire;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   K2Node_ComponentBoundEvent_EventName;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_ComponentBoundEvent_EmitterTime;            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                K2Node_ComponentBoundEvent_Location;               // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                K2Node_ComponentBoundEvent_Velocity;               // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class USK_AMR_Skeleton_AnimBlueprint_C*       K2Node_DynamicCast_AsSK_AMR_Skeleton_Anim_Blueprint; // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Lerp_ReturnValue2;                        // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsReloading_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue2;         // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue3;         // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetChargePercent_ReturnValue;             // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Lerp_ReturnValue3;                        // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           CallFunc_LinearColorLerp_ReturnValue;              // 0x0074(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0084(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0090(0x0080)(ContainsInstancedReference)
	float                                         CallFunc_Lerp_ReturnValue4;                        // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Lerp_ReturnValue5;                        // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue2;                 // 0x0118(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Lerp_ReturnValue6;                        // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Lerp_ReturnValue7;                        // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Lerp_ReturnValue8;                        // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult2;   // 0x0130(0x0080)(ContainsInstancedReference)
};
static_assert(alignof(B_Rifle_AMR__C_ExecuteUbergraph_B_Rifle_AMR_) == 0x000004, "Wrong alignment on B_Rifle_AMR__C_ExecuteUbergraph_B_Rifle_AMR_");
static_assert(sizeof(B_Rifle_AMR__C_ExecuteUbergraph_B_Rifle_AMR_) == 0x0001B0, "Wrong size on B_Rifle_AMR__C_ExecuteUbergraph_B_Rifle_AMR_");
static_assert(offsetof(B_Rifle_AMR__C_ExecuteUbergraph_B_Rifle_AMR_, EntryPoint) == 0x000000, "Member 'B_Rifle_AMR__C_ExecuteUbergraph_B_Rifle_AMR_::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Rifle_AMR__C_ExecuteUbergraph_B_Rifle_AMR_, Temp_bool_IsClosed_Variable) == 0x000004, "Member 'B_Rifle_AMR__C_ExecuteUbergraph_B_Rifle_AMR_::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(B_Rifle_AMR__C_ExecuteUbergraph_B_Rifle_AMR_, Temp_bool_Has_Been_Initd_Variable) == 0x000005, "Member 'B_Rifle_AMR__C_ExecuteUbergraph_B_Rifle_AMR_::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(B_Rifle_AMR__C_ExecuteUbergraph_B_Rifle_AMR_, Temp_bool_IsClosed_Variable2) == 0x000006, "Member 'B_Rifle_AMR__C_ExecuteUbergraph_B_Rifle_AMR_::Temp_bool_IsClosed_Variable2' has a wrong offset!");
static_assert(offsetof(B_Rifle_AMR__C_ExecuteUbergraph_B_Rifle_AMR_, Temp_bool_Has_Been_Initd_Variable2) == 0x000007, "Member 'B_Rifle_AMR__C_ExecuteUbergraph_B_Rifle_AMR_::Temp_bool_Has_Been_Initd_Variable2' has a wrong offset!");
static_assert(offsetof(B_Rifle_AMR__C_ExecuteUbergraph_B_Rifle_AMR_, Temp_bool_IsClosed_Variable3) == 0x000008, "Member 'B_Rifle_AMR__C_ExecuteUbergraph_B_Rifle_AMR_::Temp_bool_IsClosed_Variable3' has a wrong offset!");
static_assert(offsetof(B_Rifle_AMR__C_ExecuteUbergraph_B_Rifle_AMR_, Temp_bool_Has_Been_Initd_Variable3) == 0x000009, "Member 'B_Rifle_AMR__C_ExecuteUbergraph_B_Rifle_AMR_::Temp_bool_Has_Been_Initd_Variable3' has a wrong offset!");
static_assert(offsetof(B_Rifle_AMR__C_ExecuteUbergraph_B_Rifle_AMR_, K2Node_Event_ReloadStage) == 0x00000A, "Member 'B_Rifle_AMR__C_ExecuteUbergraph_B_Rifle_AMR_::K2Node_Event_ReloadStage' has a wrong offset!");
static_assert(offsetof(B_Rifle_AMR__C_ExecuteUbergraph_B_Rifle_AMR_, K2Node_Event_Selection) == 0x00000B, "Member 'B_Rifle_AMR__C_ExecuteUbergraph_B_Rifle_AMR_::K2Node_Event_Selection' has a wrong offset!");
static_assert(offsetof(B_Rifle_AMR__C_ExecuteUbergraph_B_Rifle_AMR_, K2Node_Event_bPersistentFire) == 0x00000C, "Member 'B_Rifle_AMR__C_ExecuteUbergraph_B_Rifle_AMR_::K2Node_Event_bPersistentFire' has a wrong offset!");
static_assert(offsetof(B_Rifle_AMR__C_ExecuteUbergraph_B_Rifle_AMR_, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000010, "Member 'B_Rifle_AMR__C_ExecuteUbergraph_B_Rifle_AMR_::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Rifle_AMR__C_ExecuteUbergraph_B_Rifle_AMR_, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000014, "Member 'B_Rifle_AMR__C_ExecuteUbergraph_B_Rifle_AMR_::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Rifle_AMR__C_ExecuteUbergraph_B_Rifle_AMR_, K2Node_ComponentBoundEvent_EventName) == 0x000020, "Member 'B_Rifle_AMR__C_ExecuteUbergraph_B_Rifle_AMR_::K2Node_ComponentBoundEvent_EventName' has a wrong offset!");
static_assert(offsetof(B_Rifle_AMR__C_ExecuteUbergraph_B_Rifle_AMR_, K2Node_ComponentBoundEvent_EmitterTime) == 0x000028, "Member 'B_Rifle_AMR__C_ExecuteUbergraph_B_Rifle_AMR_::K2Node_ComponentBoundEvent_EmitterTime' has a wrong offset!");
static_assert(offsetof(B_Rifle_AMR__C_ExecuteUbergraph_B_Rifle_AMR_, K2Node_ComponentBoundEvent_Location) == 0x00002C, "Member 'B_Rifle_AMR__C_ExecuteUbergraph_B_Rifle_AMR_::K2Node_ComponentBoundEvent_Location' has a wrong offset!");
static_assert(offsetof(B_Rifle_AMR__C_ExecuteUbergraph_B_Rifle_AMR_, K2Node_ComponentBoundEvent_Velocity) == 0x000038, "Member 'B_Rifle_AMR__C_ExecuteUbergraph_B_Rifle_AMR_::K2Node_ComponentBoundEvent_Velocity' has a wrong offset!");
static_assert(offsetof(B_Rifle_AMR__C_ExecuteUbergraph_B_Rifle_AMR_, CallFunc_GetAnimInstance_ReturnValue) == 0x000044, "Member 'B_Rifle_AMR__C_ExecuteUbergraph_B_Rifle_AMR_::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Rifle_AMR__C_ExecuteUbergraph_B_Rifle_AMR_, K2Node_DynamicCast_AsSK_AMR_Skeleton_Anim_Blueprint) == 0x000048, "Member 'B_Rifle_AMR__C_ExecuteUbergraph_B_Rifle_AMR_::K2Node_DynamicCast_AsSK_AMR_Skeleton_Anim_Blueprint' has a wrong offset!");
static_assert(offsetof(B_Rifle_AMR__C_ExecuteUbergraph_B_Rifle_AMR_, K2Node_DynamicCast_bSuccess) == 0x00004C, "Member 'B_Rifle_AMR__C_ExecuteUbergraph_B_Rifle_AMR_::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_Rifle_AMR__C_ExecuteUbergraph_B_Rifle_AMR_, CallFunc_Lerp_ReturnValue) == 0x000050, "Member 'B_Rifle_AMR__C_ExecuteUbergraph_B_Rifle_AMR_::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Rifle_AMR__C_ExecuteUbergraph_B_Rifle_AMR_, CallFunc_Lerp_ReturnValue2) == 0x000054, "Member 'B_Rifle_AMR__C_ExecuteUbergraph_B_Rifle_AMR_::CallFunc_Lerp_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Rifle_AMR__C_ExecuteUbergraph_B_Rifle_AMR_, CallFunc_IsReloading_ReturnValue) == 0x000058, "Member 'B_Rifle_AMR__C_ExecuteUbergraph_B_Rifle_AMR_::CallFunc_IsReloading_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Rifle_AMR__C_ExecuteUbergraph_B_Rifle_AMR_, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00005C, "Member 'B_Rifle_AMR__C_ExecuteUbergraph_B_Rifle_AMR_::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Rifle_AMR__C_ExecuteUbergraph_B_Rifle_AMR_, CallFunc_Multiply_FloatFloat_ReturnValue2) == 0x000060, "Member 'B_Rifle_AMR__C_ExecuteUbergraph_B_Rifle_AMR_::CallFunc_Multiply_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Rifle_AMR__C_ExecuteUbergraph_B_Rifle_AMR_, CallFunc_Multiply_FloatFloat_ReturnValue3) == 0x000064, "Member 'B_Rifle_AMR__C_ExecuteUbergraph_B_Rifle_AMR_::CallFunc_Multiply_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(B_Rifle_AMR__C_ExecuteUbergraph_B_Rifle_AMR_, K2Node_Event_DeltaSeconds) == 0x000068, "Member 'B_Rifle_AMR__C_ExecuteUbergraph_B_Rifle_AMR_::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(B_Rifle_AMR__C_ExecuteUbergraph_B_Rifle_AMR_, CallFunc_GetChargePercent_ReturnValue) == 0x00006C, "Member 'B_Rifle_AMR__C_ExecuteUbergraph_B_Rifle_AMR_::CallFunc_GetChargePercent_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Rifle_AMR__C_ExecuteUbergraph_B_Rifle_AMR_, CallFunc_Lerp_ReturnValue3) == 0x000070, "Member 'B_Rifle_AMR__C_ExecuteUbergraph_B_Rifle_AMR_::CallFunc_Lerp_ReturnValue3' has a wrong offset!");
static_assert(offsetof(B_Rifle_AMR__C_ExecuteUbergraph_B_Rifle_AMR_, CallFunc_LinearColorLerp_ReturnValue) == 0x000074, "Member 'B_Rifle_AMR__C_ExecuteUbergraph_B_Rifle_AMR_::CallFunc_LinearColorLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Rifle_AMR__C_ExecuteUbergraph_B_Rifle_AMR_, CallFunc_MakeRotator_ReturnValue) == 0x000084, "Member 'B_Rifle_AMR__C_ExecuteUbergraph_B_Rifle_AMR_::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Rifle_AMR__C_ExecuteUbergraph_B_Rifle_AMR_, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000090, "Member 'B_Rifle_AMR__C_ExecuteUbergraph_B_Rifle_AMR_::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(B_Rifle_AMR__C_ExecuteUbergraph_B_Rifle_AMR_, CallFunc_Lerp_ReturnValue4) == 0x000110, "Member 'B_Rifle_AMR__C_ExecuteUbergraph_B_Rifle_AMR_::CallFunc_Lerp_ReturnValue4' has a wrong offset!");
static_assert(offsetof(B_Rifle_AMR__C_ExecuteUbergraph_B_Rifle_AMR_, CallFunc_Lerp_ReturnValue5) == 0x000114, "Member 'B_Rifle_AMR__C_ExecuteUbergraph_B_Rifle_AMR_::CallFunc_Lerp_ReturnValue5' has a wrong offset!");
static_assert(offsetof(B_Rifle_AMR__C_ExecuteUbergraph_B_Rifle_AMR_, CallFunc_MakeRotator_ReturnValue2) == 0x000118, "Member 'B_Rifle_AMR__C_ExecuteUbergraph_B_Rifle_AMR_::CallFunc_MakeRotator_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Rifle_AMR__C_ExecuteUbergraph_B_Rifle_AMR_, CallFunc_Lerp_ReturnValue6) == 0x000124, "Member 'B_Rifle_AMR__C_ExecuteUbergraph_B_Rifle_AMR_::CallFunc_Lerp_ReturnValue6' has a wrong offset!");
static_assert(offsetof(B_Rifle_AMR__C_ExecuteUbergraph_B_Rifle_AMR_, CallFunc_Lerp_ReturnValue7) == 0x000128, "Member 'B_Rifle_AMR__C_ExecuteUbergraph_B_Rifle_AMR_::CallFunc_Lerp_ReturnValue7' has a wrong offset!");
static_assert(offsetof(B_Rifle_AMR__C_ExecuteUbergraph_B_Rifle_AMR_, CallFunc_Lerp_ReturnValue8) == 0x00012C, "Member 'B_Rifle_AMR__C_ExecuteUbergraph_B_Rifle_AMR_::CallFunc_Lerp_ReturnValue8' has a wrong offset!");
static_assert(offsetof(B_Rifle_AMR__C_ExecuteUbergraph_B_Rifle_AMR_, CallFunc_K2_SetRelativeRotation_SweepHitResult2) == 0x000130, "Member 'B_Rifle_AMR__C_ExecuteUbergraph_B_Rifle_AMR_::CallFunc_K2_SetRelativeRotation_SweepHitResult2' has a wrong offset!");

// Function B_Rifle_AMR_.B_Rifle_AMR__C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct B_Rifle_AMR__C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Rifle_AMR__C_ReceiveTick) == 0x000004, "Wrong alignment on B_Rifle_AMR__C_ReceiveTick");
static_assert(sizeof(B_Rifle_AMR__C_ReceiveTick) == 0x000004, "Wrong size on B_Rifle_AMR__C_ReceiveTick");
static_assert(offsetof(B_Rifle_AMR__C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'B_Rifle_AMR__C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function B_Rifle_AMR_.B_Rifle_AMR__C.BndEvt__MuzzlePSC_K2Node_ComponentBoundEvent_143_ParticleSpawnSignature__DelegateSignature
// 0x0024 (0x0024 - 0x0000)
struct B_Rifle_AMR__C_BndEvt__MuzzlePSC_K2Node_ComponentBoundEvent_143_ParticleSpawnSignature__DelegateSignature final
{
public:
	class FName                                   EventName;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         EmitterTime;                                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                Location;                                          // 0x000C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                Velocity;                                          // 0x0018(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Rifle_AMR__C_BndEvt__MuzzlePSC_K2Node_ComponentBoundEvent_143_ParticleSpawnSignature__DelegateSignature) == 0x000004, "Wrong alignment on B_Rifle_AMR__C_BndEvt__MuzzlePSC_K2Node_ComponentBoundEvent_143_ParticleSpawnSignature__DelegateSignature");
static_assert(sizeof(B_Rifle_AMR__C_BndEvt__MuzzlePSC_K2Node_ComponentBoundEvent_143_ParticleSpawnSignature__DelegateSignature) == 0x000024, "Wrong size on B_Rifle_AMR__C_BndEvt__MuzzlePSC_K2Node_ComponentBoundEvent_143_ParticleSpawnSignature__DelegateSignature");
static_assert(offsetof(B_Rifle_AMR__C_BndEvt__MuzzlePSC_K2Node_ComponentBoundEvent_143_ParticleSpawnSignature__DelegateSignature, EventName) == 0x000000, "Member 'B_Rifle_AMR__C_BndEvt__MuzzlePSC_K2Node_ComponentBoundEvent_143_ParticleSpawnSignature__DelegateSignature::EventName' has a wrong offset!");
static_assert(offsetof(B_Rifle_AMR__C_BndEvt__MuzzlePSC_K2Node_ComponentBoundEvent_143_ParticleSpawnSignature__DelegateSignature, EmitterTime) == 0x000008, "Member 'B_Rifle_AMR__C_BndEvt__MuzzlePSC_K2Node_ComponentBoundEvent_143_ParticleSpawnSignature__DelegateSignature::EmitterTime' has a wrong offset!");
static_assert(offsetof(B_Rifle_AMR__C_BndEvt__MuzzlePSC_K2Node_ComponentBoundEvent_143_ParticleSpawnSignature__DelegateSignature, Location) == 0x00000C, "Member 'B_Rifle_AMR__C_BndEvt__MuzzlePSC_K2Node_ComponentBoundEvent_143_ParticleSpawnSignature__DelegateSignature::Location' has a wrong offset!");
static_assert(offsetof(B_Rifle_AMR__C_BndEvt__MuzzlePSC_K2Node_ComponentBoundEvent_143_ParticleSpawnSignature__DelegateSignature, Velocity) == 0x000018, "Member 'B_Rifle_AMR__C_BndEvt__MuzzlePSC_K2Node_ComponentBoundEvent_143_ParticleSpawnSignature__DelegateSignature::Velocity' has a wrong offset!");

// Function B_Rifle_AMR_.B_Rifle_AMR__C.OnPlayWeaponFireFX
// 0x0001 (0x0001 - 0x0000)
struct B_Rifle_AMR__C_OnPlayWeaponFireFX final
{
public:
	bool                                          bPersistentFire;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Rifle_AMR__C_OnPlayWeaponFireFX) == 0x000001, "Wrong alignment on B_Rifle_AMR__C_OnPlayWeaponFireFX");
static_assert(sizeof(B_Rifle_AMR__C_OnPlayWeaponFireFX) == 0x000001, "Wrong size on B_Rifle_AMR__C_OnPlayWeaponFireFX");
static_assert(offsetof(B_Rifle_AMR__C_OnPlayWeaponFireFX, bPersistentFire) == 0x000000, "Member 'B_Rifle_AMR__C_OnPlayWeaponFireFX::bPersistentFire' has a wrong offset!");

// Function B_Rifle_AMR_.B_Rifle_AMR__C.Muzzle Play Reload FX
// 0x0001 (0x0001 - 0x0000)
struct B_Rifle_AMR__C_Muzzle_Play_Reload_FX final
{
public:
	EFortReloadFXState                            Selection;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Rifle_AMR__C_Muzzle_Play_Reload_FX) == 0x000001, "Wrong alignment on B_Rifle_AMR__C_Muzzle_Play_Reload_FX");
static_assert(sizeof(B_Rifle_AMR__C_Muzzle_Play_Reload_FX) == 0x000001, "Wrong size on B_Rifle_AMR__C_Muzzle_Play_Reload_FX");
static_assert(offsetof(B_Rifle_AMR__C_Muzzle_Play_Reload_FX, Selection) == 0x000000, "Member 'B_Rifle_AMR__C_Muzzle_Play_Reload_FX::Selection' has a wrong offset!");

// Function B_Rifle_AMR_.B_Rifle_AMR__C.OnPlayReloadFX
// 0x0001 (0x0001 - 0x0000)
struct B_Rifle_AMR__C_OnPlayReloadFX final
{
public:
	EFortReloadFXState                            ReloadStage;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Rifle_AMR__C_OnPlayReloadFX) == 0x000001, "Wrong alignment on B_Rifle_AMR__C_OnPlayReloadFX");
static_assert(sizeof(B_Rifle_AMR__C_OnPlayReloadFX) == 0x000001, "Wrong size on B_Rifle_AMR__C_OnPlayReloadFX");
static_assert(offsetof(B_Rifle_AMR__C_OnPlayReloadFX, ReloadStage) == 0x000000, "Member 'B_Rifle_AMR__C_OnPlayReloadFX::ReloadStage' has a wrong offset!");

// Function B_Rifle_AMR_.B_Rifle_AMR__C.UserConstructionScript
// 0x0004 (0x0004 - 0x0000)
struct B_Rifle_AMR__C_UserConstructionScript final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Rifle_AMR__C_UserConstructionScript) == 0x000004, "Wrong alignment on B_Rifle_AMR__C_UserConstructionScript");
static_assert(sizeof(B_Rifle_AMR__C_UserConstructionScript) == 0x000004, "Wrong size on B_Rifle_AMR__C_UserConstructionScript");
static_assert(offsetof(B_Rifle_AMR__C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000000, "Member 'B_Rifle_AMR__C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

}

#pragma pack(pop)
