#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_RocketLauncher_Charge

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "B_RocketLauncher_Generic_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass B_RocketLauncher_Charge.B_RocketLauncher_Charge_C
// 0x000C (0x0788 - 0x077C)
class AB_RocketLauncher_Charge_C final : public AB_RocketLauncher_Generic_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_B_RocketLauncher_Charge_C;          // 0x077C(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        ChargeAudioComp;                                   // 0x0780(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UParticleSystemComponent*               ChargeMuzzlePSC;                                   // 0x0784(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)

public:
	void ExecuteUbergraph_B_RocketLauncher_Charge(int32 EntryPoint);
	void OnEndCharge();
	void OnReachedMinCharge();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_RocketLauncher_Charge_C">();
	}
	static class AB_RocketLauncher_Charge_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_RocketLauncher_Charge_C>();
	}
};
static_assert(alignof(AB_RocketLauncher_Charge_C) == 0x000004, "Wrong alignment on AB_RocketLauncher_Charge_C");
static_assert(sizeof(AB_RocketLauncher_Charge_C) == 0x000788, "Wrong size on AB_RocketLauncher_Charge_C");
static_assert(offsetof(AB_RocketLauncher_Charge_C, UberGraphFrame_B_RocketLauncher_Charge_C) == 0x00077C, "Member 'AB_RocketLauncher_Charge_C::UberGraphFrame_B_RocketLauncher_Charge_C' has a wrong offset!");
static_assert(offsetof(AB_RocketLauncher_Charge_C, ChargeAudioComp) == 0x000780, "Member 'AB_RocketLauncher_Charge_C::ChargeAudioComp' has a wrong offset!");
static_assert(offsetof(AB_RocketLauncher_Charge_C, ChargeMuzzlePSC) == 0x000784, "Member 'AB_RocketLauncher_Charge_C::ChargeMuzzlePSC' has a wrong offset!");

}

#pragma pack(pop)
