#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_RocketLauncher_Generic

#include "Basic.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function B_RocketLauncher_Generic.B_RocketLauncher_Generic_C.ExecuteUbergraph_B_RocketLauncher_Generic
// 0x0008 (0x0008 - 0x0000)
struct B_RocketLauncher_Generic_C_ExecuteUbergraph_B_RocketLauncher_Generic final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_Condition;                            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_RocketLauncher_Generic_C_ExecuteUbergraph_B_RocketLauncher_Generic) == 0x000004, "Wrong alignment on B_RocketLauncher_Generic_C_ExecuteUbergraph_B_RocketLauncher_Generic");
static_assert(sizeof(B_RocketLauncher_Generic_C_ExecuteUbergraph_B_RocketLauncher_Generic) == 0x000008, "Wrong size on B_RocketLauncher_Generic_C_ExecuteUbergraph_B_RocketLauncher_Generic");
static_assert(offsetof(B_RocketLauncher_Generic_C_ExecuteUbergraph_B_RocketLauncher_Generic, EntryPoint) == 0x000000, "Member 'B_RocketLauncher_Generic_C_ExecuteUbergraph_B_RocketLauncher_Generic::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_RocketLauncher_Generic_C_ExecuteUbergraph_B_RocketLauncher_Generic, K2Node_Event_Condition) == 0x000004, "Member 'B_RocketLauncher_Generic_C_ExecuteUbergraph_B_RocketLauncher_Generic::K2Node_Event_Condition' has a wrong offset!");

// Function B_RocketLauncher_Generic.B_RocketLauncher_Generic_C.Muzzle Flash FX
// 0x0001 (0x0001 - 0x0000)
struct B_RocketLauncher_Generic_C_Muzzle_Flash_FX final
{
public:
	bool                                          Condition;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_RocketLauncher_Generic_C_Muzzle_Flash_FX) == 0x000001, "Wrong alignment on B_RocketLauncher_Generic_C_Muzzle_Flash_FX");
static_assert(sizeof(B_RocketLauncher_Generic_C_Muzzle_Flash_FX) == 0x000001, "Wrong size on B_RocketLauncher_Generic_C_Muzzle_Flash_FX");
static_assert(offsetof(B_RocketLauncher_Generic_C_Muzzle_Flash_FX, Condition) == 0x000000, "Member 'B_RocketLauncher_Generic_C_Muzzle_Flash_FX::Condition' has a wrong offset!");

// Function B_RocketLauncher_Generic.B_RocketLauncher_Generic_C.IsUsingScope
// 0x0002 (0x0002 - 0x0000)
struct B_RocketLauncher_Generic_C_IsUsingScope final
{
public:
	bool                                          UsingScope;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsUsingScope_UsingScope;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_RocketLauncher_Generic_C_IsUsingScope) == 0x000001, "Wrong alignment on B_RocketLauncher_Generic_C_IsUsingScope");
static_assert(sizeof(B_RocketLauncher_Generic_C_IsUsingScope) == 0x000002, "Wrong size on B_RocketLauncher_Generic_C_IsUsingScope");
static_assert(offsetof(B_RocketLauncher_Generic_C_IsUsingScope, UsingScope) == 0x000000, "Member 'B_RocketLauncher_Generic_C_IsUsingScope::UsingScope' has a wrong offset!");
static_assert(offsetof(B_RocketLauncher_Generic_C_IsUsingScope, CallFunc_IsUsingScope_UsingScope) == 0x000001, "Member 'B_RocketLauncher_Generic_C_IsUsingScope::CallFunc_IsUsingScope_UsingScope' has a wrong offset!");

}

#pragma pack(pop)
