#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Shotgun_Break

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function B_Shotgun_Break.B_Shotgun_Break_C.ExecuteUbergraph_B_Shotgun_Break
// 0x0200 (0x0200 - 0x0000)
struct B_Shotgun_Break_C_ExecuteUbergraph_B_Shotgun_Break final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bPersistentFire;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetDamageStartLocation_AimDir;            // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetDamageStartLocation_ReturnValue;       // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetRange_ReturnValue;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayCueParameters                 K2Node_MakeStruct_GameplayCueParameters;           // 0x003C(0x0084)()
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x00C0(0x000C)(ConstParm, ZeroConstructor, ReferenceParm)
	struct FRotator                               CallFunc_Array_Get_Item;                           // 0x00CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue;              // 0x00DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_RotatorToVector_ReturnValue;         // 0x00EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0104(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_LineTraceSingle_NEW_OutHit;               // 0x0110(0x0080)(ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_NEW_ReturnValue;          // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0192(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_193[0x1];                                      // 0x0193(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0198(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x01A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x01B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x01BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x01D4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x01E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x01EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Shotgun_Break_C_ExecuteUbergraph_B_Shotgun_Break) == 0x000004, "Wrong alignment on B_Shotgun_Break_C_ExecuteUbergraph_B_Shotgun_Break");
static_assert(sizeof(B_Shotgun_Break_C_ExecuteUbergraph_B_Shotgun_Break) == 0x000200, "Wrong size on B_Shotgun_Break_C_ExecuteUbergraph_B_Shotgun_Break");
static_assert(offsetof(B_Shotgun_Break_C_ExecuteUbergraph_B_Shotgun_Break, EntryPoint) == 0x000000, "Member 'B_Shotgun_Break_C_ExecuteUbergraph_B_Shotgun_Break::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Shotgun_Break_C_ExecuteUbergraph_B_Shotgun_Break, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'B_Shotgun_Break_C_ExecuteUbergraph_B_Shotgun_Break::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(B_Shotgun_Break_C_ExecuteUbergraph_B_Shotgun_Break, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'B_Shotgun_Break_C_ExecuteUbergraph_B_Shotgun_Break::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Shotgun_Break_C_ExecuteUbergraph_B_Shotgun_Break, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'B_Shotgun_Break_C_ExecuteUbergraph_B_Shotgun_Break::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(B_Shotgun_Break_C_ExecuteUbergraph_B_Shotgun_Break, K2Node_Event_bPersistentFire) == 0x000010, "Member 'B_Shotgun_Break_C_ExecuteUbergraph_B_Shotgun_Break::K2Node_Event_bPersistentFire' has a wrong offset!");
static_assert(offsetof(B_Shotgun_Break_C_ExecuteUbergraph_B_Shotgun_Break, CallFunc_GetDamageStartLocation_AimDir) == 0x000014, "Member 'B_Shotgun_Break_C_ExecuteUbergraph_B_Shotgun_Break::CallFunc_GetDamageStartLocation_AimDir' has a wrong offset!");
static_assert(offsetof(B_Shotgun_Break_C_ExecuteUbergraph_B_Shotgun_Break, CallFunc_GetDamageStartLocation_ReturnValue) == 0x000020, "Member 'B_Shotgun_Break_C_ExecuteUbergraph_B_Shotgun_Break::CallFunc_GetDamageStartLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Shotgun_Break_C_ExecuteUbergraph_B_Shotgun_Break, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x00002C, "Member 'B_Shotgun_Break_C_ExecuteUbergraph_B_Shotgun_Break::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Shotgun_Break_C_ExecuteUbergraph_B_Shotgun_Break, CallFunc_GetRange_ReturnValue) == 0x000038, "Member 'B_Shotgun_Break_C_ExecuteUbergraph_B_Shotgun_Break::CallFunc_GetRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Shotgun_Break_C_ExecuteUbergraph_B_Shotgun_Break, K2Node_MakeStruct_GameplayCueParameters) == 0x00003C, "Member 'B_Shotgun_Break_C_ExecuteUbergraph_B_Shotgun_Break::K2Node_MakeStruct_GameplayCueParameters' has a wrong offset!");
static_assert(offsetof(B_Shotgun_Break_C_ExecuteUbergraph_B_Shotgun_Break, Temp_object_Variable) == 0x0000C0, "Member 'B_Shotgun_Break_C_ExecuteUbergraph_B_Shotgun_Break::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(B_Shotgun_Break_C_ExecuteUbergraph_B_Shotgun_Break, CallFunc_Array_Get_Item) == 0x0000CC, "Member 'B_Shotgun_Break_C_ExecuteUbergraph_B_Shotgun_Break::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(B_Shotgun_Break_C_ExecuteUbergraph_B_Shotgun_Break, CallFunc_Array_Length_ReturnValue) == 0x0000D8, "Member 'B_Shotgun_Break_C_ExecuteUbergraph_B_Shotgun_Break::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Shotgun_Break_C_ExecuteUbergraph_B_Shotgun_Break, CallFunc_ComposeRotators_ReturnValue) == 0x0000DC, "Member 'B_Shotgun_Break_C_ExecuteUbergraph_B_Shotgun_Break::CallFunc_ComposeRotators_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Shotgun_Break_C_ExecuteUbergraph_B_Shotgun_Break, CallFunc_Less_IntInt_ReturnValue) == 0x0000E8, "Member 'B_Shotgun_Break_C_ExecuteUbergraph_B_Shotgun_Break::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Shotgun_Break_C_ExecuteUbergraph_B_Shotgun_Break, CallFunc_Conv_RotatorToVector_ReturnValue) == 0x0000EC, "Member 'B_Shotgun_Break_C_ExecuteUbergraph_B_Shotgun_Break::CallFunc_Conv_RotatorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Shotgun_Break_C_ExecuteUbergraph_B_Shotgun_Break, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0000F8, "Member 'B_Shotgun_Break_C_ExecuteUbergraph_B_Shotgun_Break::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Shotgun_Break_C_ExecuteUbergraph_B_Shotgun_Break, CallFunc_Add_VectorVector_ReturnValue) == 0x000104, "Member 'B_Shotgun_Break_C_ExecuteUbergraph_B_Shotgun_Break::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Shotgun_Break_C_ExecuteUbergraph_B_Shotgun_Break, CallFunc_LineTraceSingle_NEW_OutHit) == 0x000110, "Member 'B_Shotgun_Break_C_ExecuteUbergraph_B_Shotgun_Break::CallFunc_LineTraceSingle_NEW_OutHit' has a wrong offset!");
static_assert(offsetof(B_Shotgun_Break_C_ExecuteUbergraph_B_Shotgun_Break, CallFunc_LineTraceSingle_NEW_ReturnValue) == 0x000190, "Member 'B_Shotgun_Break_C_ExecuteUbergraph_B_Shotgun_Break::CallFunc_LineTraceSingle_NEW_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Shotgun_Break_C_ExecuteUbergraph_B_Shotgun_Break, CallFunc_BreakHitResult_bBlockingHit) == 0x000191, "Member 'B_Shotgun_Break_C_ExecuteUbergraph_B_Shotgun_Break::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(B_Shotgun_Break_C_ExecuteUbergraph_B_Shotgun_Break, CallFunc_BreakHitResult_bInitialOverlap) == 0x000192, "Member 'B_Shotgun_Break_C_ExecuteUbergraph_B_Shotgun_Break::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(B_Shotgun_Break_C_ExecuteUbergraph_B_Shotgun_Break, CallFunc_BreakHitResult_Time) == 0x000194, "Member 'B_Shotgun_Break_C_ExecuteUbergraph_B_Shotgun_Break::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(B_Shotgun_Break_C_ExecuteUbergraph_B_Shotgun_Break, CallFunc_BreakHitResult_Location) == 0x000198, "Member 'B_Shotgun_Break_C_ExecuteUbergraph_B_Shotgun_Break::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(B_Shotgun_Break_C_ExecuteUbergraph_B_Shotgun_Break, CallFunc_BreakHitResult_ImpactPoint) == 0x0001A4, "Member 'B_Shotgun_Break_C_ExecuteUbergraph_B_Shotgun_Break::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(B_Shotgun_Break_C_ExecuteUbergraph_B_Shotgun_Break, CallFunc_BreakHitResult_Normal) == 0x0001B0, "Member 'B_Shotgun_Break_C_ExecuteUbergraph_B_Shotgun_Break::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(B_Shotgun_Break_C_ExecuteUbergraph_B_Shotgun_Break, CallFunc_BreakHitResult_ImpactNormal) == 0x0001BC, "Member 'B_Shotgun_Break_C_ExecuteUbergraph_B_Shotgun_Break::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(B_Shotgun_Break_C_ExecuteUbergraph_B_Shotgun_Break, CallFunc_BreakHitResult_PhysMat) == 0x0001C8, "Member 'B_Shotgun_Break_C_ExecuteUbergraph_B_Shotgun_Break::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(B_Shotgun_Break_C_ExecuteUbergraph_B_Shotgun_Break, CallFunc_BreakHitResult_HitActor) == 0x0001CC, "Member 'B_Shotgun_Break_C_ExecuteUbergraph_B_Shotgun_Break::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(B_Shotgun_Break_C_ExecuteUbergraph_B_Shotgun_Break, CallFunc_BreakHitResult_HitComponent) == 0x0001D0, "Member 'B_Shotgun_Break_C_ExecuteUbergraph_B_Shotgun_Break::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(B_Shotgun_Break_C_ExecuteUbergraph_B_Shotgun_Break, CallFunc_BreakHitResult_HitBoneName) == 0x0001D4, "Member 'B_Shotgun_Break_C_ExecuteUbergraph_B_Shotgun_Break::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(B_Shotgun_Break_C_ExecuteUbergraph_B_Shotgun_Break, CallFunc_BreakHitResult_HitItem) == 0x0001DC, "Member 'B_Shotgun_Break_C_ExecuteUbergraph_B_Shotgun_Break::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(B_Shotgun_Break_C_ExecuteUbergraph_B_Shotgun_Break, CallFunc_BreakHitResult_TraceStart) == 0x0001E0, "Member 'B_Shotgun_Break_C_ExecuteUbergraph_B_Shotgun_Break::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(B_Shotgun_Break_C_ExecuteUbergraph_B_Shotgun_Break, CallFunc_BreakHitResult_TraceEnd) == 0x0001EC, "Member 'B_Shotgun_Break_C_ExecuteUbergraph_B_Shotgun_Break::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(B_Shotgun_Break_C_ExecuteUbergraph_B_Shotgun_Break, K2Node_DynamicCast_AsFort_Pawn) == 0x0001F8, "Member 'B_Shotgun_Break_C_ExecuteUbergraph_B_Shotgun_Break::K2Node_DynamicCast_AsFort_Pawn' has a wrong offset!");
static_assert(offsetof(B_Shotgun_Break_C_ExecuteUbergraph_B_Shotgun_Break, K2Node_DynamicCast_bSuccess) == 0x0001FC, "Member 'B_Shotgun_Break_C_ExecuteUbergraph_B_Shotgun_Break::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function B_Shotgun_Break.B_Shotgun_Break_C.OnPlayWeaponFireFX
// 0x0001 (0x0001 - 0x0000)
struct B_Shotgun_Break_C_OnPlayWeaponFireFX final
{
public:
	bool                                          bPersistentFire;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Shotgun_Break_C_OnPlayWeaponFireFX) == 0x000001, "Wrong alignment on B_Shotgun_Break_C_OnPlayWeaponFireFX");
static_assert(sizeof(B_Shotgun_Break_C_OnPlayWeaponFireFX) == 0x000001, "Wrong size on B_Shotgun_Break_C_OnPlayWeaponFireFX");
static_assert(offsetof(B_Shotgun_Break_C_OnPlayWeaponFireFX, bPersistentFire) == 0x000000, "Member 'B_Shotgun_Break_C_OnPlayWeaponFireFX::bPersistentFire' has a wrong offset!");

}

#pragma pack(pop)
