#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Shotgun_LongArm

#include "Basic.hpp"

#include "B_Shotgun_Generic_classes.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass B_Shotgun_LongArm.B_Shotgun_LongArm_C
// 0x001C (0x0790 - 0x0774)
class AB_Shotgun_LongArm_C final : public AB_Shotgun_Generic_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_B_Shotgun_LongArm_C;                // 0x0774(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               P_LongArm_Sparks_01;                               // 0x0778(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UParticleSystemComponent*               P_LongArm_IdleLightning_01_e;                      // 0x077C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UParticleSystemComponent*               P_LongArm_IdleLightning_01_d;                      // 0x0780(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UParticleSystemComponent*               P_LongArm_IdleLightning_01_c;                      // 0x0784(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UParticleSystemComponent*               P_LongArm_IdleLightning_01_b;                      // 0x0788(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UParticleSystemComponent*               P_LongArm_IdleLightning_01_a;                      // 0x078C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)

public:
	void ExecuteUbergraph_B_Shotgun_LongArm(int32 EntryPoint);
	void OnPlayWeaponFireFX(bool bPersistentFire);
	void OnPlayReloadFX(EFortReloadFXState ReloadStage);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Shotgun_LongArm_C">();
	}
	static class AB_Shotgun_LongArm_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Shotgun_LongArm_C>();
	}
};
static_assert(alignof(AB_Shotgun_LongArm_C) == 0x000004, "Wrong alignment on AB_Shotgun_LongArm_C");
static_assert(sizeof(AB_Shotgun_LongArm_C) == 0x000790, "Wrong size on AB_Shotgun_LongArm_C");
static_assert(offsetof(AB_Shotgun_LongArm_C, UberGraphFrame_B_Shotgun_LongArm_C) == 0x000774, "Member 'AB_Shotgun_LongArm_C::UberGraphFrame_B_Shotgun_LongArm_C' has a wrong offset!");
static_assert(offsetof(AB_Shotgun_LongArm_C, P_LongArm_Sparks_01) == 0x000778, "Member 'AB_Shotgun_LongArm_C::P_LongArm_Sparks_01' has a wrong offset!");
static_assert(offsetof(AB_Shotgun_LongArm_C, P_LongArm_IdleLightning_01_e) == 0x00077C, "Member 'AB_Shotgun_LongArm_C::P_LongArm_IdleLightning_01_e' has a wrong offset!");
static_assert(offsetof(AB_Shotgun_LongArm_C, P_LongArm_IdleLightning_01_d) == 0x000780, "Member 'AB_Shotgun_LongArm_C::P_LongArm_IdleLightning_01_d' has a wrong offset!");
static_assert(offsetof(AB_Shotgun_LongArm_C, P_LongArm_IdleLightning_01_c) == 0x000784, "Member 'AB_Shotgun_LongArm_C::P_LongArm_IdleLightning_01_c' has a wrong offset!");
static_assert(offsetof(AB_Shotgun_LongArm_C, P_LongArm_IdleLightning_01_b) == 0x000788, "Member 'AB_Shotgun_LongArm_C::P_LongArm_IdleLightning_01_b' has a wrong offset!");
static_assert(offsetof(AB_Shotgun_LongArm_C, P_LongArm_IdleLightning_01_a) == 0x00078C, "Member 'AB_Shotgun_LongArm_C::P_LongArm_IdleLightning_01_a' has a wrong offset!");

}

#pragma pack(pop)
