#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_SpacePistol

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "B_Ranged_Generic_classes.hpp"
#include "FortniteGame_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass B_SpacePistol.B_SpacePistol_C
// 0x0090 (0x0804 - 0x0774)
class AB_SpacePistol_C final : public AB_Ranged_Generic_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_B_SpacePistol_C;                    // 0x0774(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               ParticleScreenLight;                               // 0x0778(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	float                                         ScaleBarReload_LERP_612F07E847F4C3FDBA6909B00CBC221E; // 0x077C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ETimelineDirection                            ScaleBarReload__Direction_612F07E847F4C3FDBA6909B00CBC221E; // 0x0780(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_781[0x3];                                      // 0x0781(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     ScaleBarReload;                                    // 0x0784(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         EmptyLERPstate_LERP_3582F24D4732165472C05D875D493CB2; // 0x0788(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ETimelineDirection                            EmptyLERPstate__Direction_3582F24D4732165472C05D875D493CB2; // 0x078C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_78D[0x3];                                      // 0x078D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     EmptyLERPstate;                                    // 0x0790(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         ReloadLERPstate_LERP_B77803F349E7B91DBA427FBDF293E307; // 0x0794(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ETimelineDirection                            ReloadLERPstate__Direction_B77803F349E7B91DBA427FBDF293E307; // 0x0798(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_799[0x3];                                      // 0x0799(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     ReloadLERPstate;                                   // 0x079C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         ScaleBarBetweenClipCounts_Bolt_Flash_230D3A92479C25873AABFAA2040107DD; // 0x07A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         ScaleBarBetweenClipCounts_LERP_Ammo_Count_230D3A92479C25873AABFAA2040107DD; // 0x07A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ETimelineDirection                            ScaleBarBetweenClipCounts__Direction_230D3A92479C25873AABFAA2040107DD; // 0x07A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7A9[0x3];                                      // 0x07A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     ScaleBarBetweenClipCounts;                         // 0x07AC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FDataTableRowHandle                    DataRow;                                           // 0x07B0(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UMaterialInstanceDynamic*               ScreenMat;                                         // 0x07BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FLinearColor                           Screen_Empty_Color__Light_;                        // 0x07C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           Screen_Reload_Color__Light_;                       // 0x07D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           Screen_Full_Color__Light_;                         // 0x07E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CurrentClipCount;                                  // 0x07F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	int32                                         PreviousClipCount;                                 // 0x07F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         ScaleBarStart;                                     // 0x07F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         ScaleBarEnd;                                       // 0x07FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsEmpty_;                                          // 0x0800(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          JustReloaded_;                                     // 0x0801(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_B_SpacePistol(int32 EntryPoint);
	void ClearEmptyLERP();
	void OnAmmoCountChanged();
	void OnPlayReloadFX(EFortReloadFXState ReloadStage);
	void OnPlayWeaponFireFX(bool bPersistentFire);
	void ReceiveBeginPlay();
	void ScaleBarReload__UpdateFunc();
	void ScaleBarReload__FinishedFunc();
	void EmptyLERPstate__UpdateFunc();
	void EmptyLERPstate__FinishedFunc();
	void ReloadLERPstate__UpdateFunc();
	void ReloadLERPstate__FinishedFunc();
	void ScaleBarBetweenClipCounts__UpdateFunc();
	void ScaleBarBetweenClipCounts__FinishedFunc();
	void UserConstructionScript();
	void SetAmmoBarVariables();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_SpacePistol_C">();
	}
	static class AB_SpacePistol_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_SpacePistol_C>();
	}
};
static_assert(alignof(AB_SpacePistol_C) == 0x000004, "Wrong alignment on AB_SpacePistol_C");
static_assert(sizeof(AB_SpacePistol_C) == 0x000804, "Wrong size on AB_SpacePistol_C");
static_assert(offsetof(AB_SpacePistol_C, UberGraphFrame_B_SpacePistol_C) == 0x000774, "Member 'AB_SpacePistol_C::UberGraphFrame_B_SpacePistol_C' has a wrong offset!");
static_assert(offsetof(AB_SpacePistol_C, ParticleScreenLight) == 0x000778, "Member 'AB_SpacePistol_C::ParticleScreenLight' has a wrong offset!");
static_assert(offsetof(AB_SpacePistol_C, ScaleBarReload_LERP_612F07E847F4C3FDBA6909B00CBC221E) == 0x00077C, "Member 'AB_SpacePistol_C::ScaleBarReload_LERP_612F07E847F4C3FDBA6909B00CBC221E' has a wrong offset!");
static_assert(offsetof(AB_SpacePistol_C, ScaleBarReload__Direction_612F07E847F4C3FDBA6909B00CBC221E) == 0x000780, "Member 'AB_SpacePistol_C::ScaleBarReload__Direction_612F07E847F4C3FDBA6909B00CBC221E' has a wrong offset!");
static_assert(offsetof(AB_SpacePistol_C, ScaleBarReload) == 0x000784, "Member 'AB_SpacePistol_C::ScaleBarReload' has a wrong offset!");
static_assert(offsetof(AB_SpacePistol_C, EmptyLERPstate_LERP_3582F24D4732165472C05D875D493CB2) == 0x000788, "Member 'AB_SpacePistol_C::EmptyLERPstate_LERP_3582F24D4732165472C05D875D493CB2' has a wrong offset!");
static_assert(offsetof(AB_SpacePistol_C, EmptyLERPstate__Direction_3582F24D4732165472C05D875D493CB2) == 0x00078C, "Member 'AB_SpacePistol_C::EmptyLERPstate__Direction_3582F24D4732165472C05D875D493CB2' has a wrong offset!");
static_assert(offsetof(AB_SpacePistol_C, EmptyLERPstate) == 0x000790, "Member 'AB_SpacePistol_C::EmptyLERPstate' has a wrong offset!");
static_assert(offsetof(AB_SpacePistol_C, ReloadLERPstate_LERP_B77803F349E7B91DBA427FBDF293E307) == 0x000794, "Member 'AB_SpacePistol_C::ReloadLERPstate_LERP_B77803F349E7B91DBA427FBDF293E307' has a wrong offset!");
static_assert(offsetof(AB_SpacePistol_C, ReloadLERPstate__Direction_B77803F349E7B91DBA427FBDF293E307) == 0x000798, "Member 'AB_SpacePistol_C::ReloadLERPstate__Direction_B77803F349E7B91DBA427FBDF293E307' has a wrong offset!");
static_assert(offsetof(AB_SpacePistol_C, ReloadLERPstate) == 0x00079C, "Member 'AB_SpacePistol_C::ReloadLERPstate' has a wrong offset!");
static_assert(offsetof(AB_SpacePistol_C, ScaleBarBetweenClipCounts_Bolt_Flash_230D3A92479C25873AABFAA2040107DD) == 0x0007A0, "Member 'AB_SpacePistol_C::ScaleBarBetweenClipCounts_Bolt_Flash_230D3A92479C25873AABFAA2040107DD' has a wrong offset!");
static_assert(offsetof(AB_SpacePistol_C, ScaleBarBetweenClipCounts_LERP_Ammo_Count_230D3A92479C25873AABFAA2040107DD) == 0x0007A4, "Member 'AB_SpacePistol_C::ScaleBarBetweenClipCounts_LERP_Ammo_Count_230D3A92479C25873AABFAA2040107DD' has a wrong offset!");
static_assert(offsetof(AB_SpacePistol_C, ScaleBarBetweenClipCounts__Direction_230D3A92479C25873AABFAA2040107DD) == 0x0007A8, "Member 'AB_SpacePistol_C::ScaleBarBetweenClipCounts__Direction_230D3A92479C25873AABFAA2040107DD' has a wrong offset!");
static_assert(offsetof(AB_SpacePistol_C, ScaleBarBetweenClipCounts) == 0x0007AC, "Member 'AB_SpacePistol_C::ScaleBarBetweenClipCounts' has a wrong offset!");
static_assert(offsetof(AB_SpacePistol_C, DataRow) == 0x0007B0, "Member 'AB_SpacePistol_C::DataRow' has a wrong offset!");
static_assert(offsetof(AB_SpacePistol_C, ScreenMat) == 0x0007BC, "Member 'AB_SpacePistol_C::ScreenMat' has a wrong offset!");
static_assert(offsetof(AB_SpacePistol_C, Screen_Empty_Color__Light_) == 0x0007C0, "Member 'AB_SpacePistol_C::Screen_Empty_Color__Light_' has a wrong offset!");
static_assert(offsetof(AB_SpacePistol_C, Screen_Reload_Color__Light_) == 0x0007D0, "Member 'AB_SpacePistol_C::Screen_Reload_Color__Light_' has a wrong offset!");
static_assert(offsetof(AB_SpacePistol_C, Screen_Full_Color__Light_) == 0x0007E0, "Member 'AB_SpacePistol_C::Screen_Full_Color__Light_' has a wrong offset!");
static_assert(offsetof(AB_SpacePistol_C, CurrentClipCount) == 0x0007F0, "Member 'AB_SpacePistol_C::CurrentClipCount' has a wrong offset!");
static_assert(offsetof(AB_SpacePistol_C, PreviousClipCount) == 0x0007F4, "Member 'AB_SpacePistol_C::PreviousClipCount' has a wrong offset!");
static_assert(offsetof(AB_SpacePistol_C, ScaleBarStart) == 0x0007F8, "Member 'AB_SpacePistol_C::ScaleBarStart' has a wrong offset!");
static_assert(offsetof(AB_SpacePistol_C, ScaleBarEnd) == 0x0007FC, "Member 'AB_SpacePistol_C::ScaleBarEnd' has a wrong offset!");
static_assert(offsetof(AB_SpacePistol_C, IsEmpty_) == 0x000800, "Member 'AB_SpacePistol_C::IsEmpty_' has a wrong offset!");
static_assert(offsetof(AB_SpacePistol_C, JustReloaded_) == 0x000801, "Member 'AB_SpacePistol_C::JustReloaded_' has a wrong offset!");

}

#pragma pack(pop)
