#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_SpacePistol

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function B_SpacePistol.B_SpacePistol_C.ExecuteUbergraph_B_SpacePistol
// 0x008C (0x008C - 0x0000)
struct B_SpacePistol_C_ExecuteUbergraph_B_SpacePistol final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetBulletsPerClip_ReturnValue;            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue2;           // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue3;           // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bPersistentFire;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortReloadFXState                            K2Node_Event_ReloadStage;                          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13[0x1];                                       // 0x0013(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetMagazineAmmoCount_ReturnValue;         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetRemainingAmmo_ReturnValue;             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetReloadTime_ReturnValue;                // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetTimelineLength_ReturnValue;            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetRemainingAmmo_ReturnValue2;            // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue2;             // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue2;           // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue2;         // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           CallFunc_LinearColorLerp_ReturnValue;              // 0x004C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_FClamp_ReturnValue2;                      // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue;     // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Lerp_ReturnValue2;                        // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           CallFunc_LinearColorLerp_ReturnValue2;             // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue2;    // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_SpacePistol_C_ExecuteUbergraph_B_SpacePistol) == 0x000004, "Wrong alignment on B_SpacePistol_C_ExecuteUbergraph_B_SpacePistol");
static_assert(sizeof(B_SpacePistol_C_ExecuteUbergraph_B_SpacePistol) == 0x00008C, "Wrong size on B_SpacePistol_C_ExecuteUbergraph_B_SpacePistol");
static_assert(offsetof(B_SpacePistol_C_ExecuteUbergraph_B_SpacePistol, EntryPoint) == 0x000000, "Member 'B_SpacePistol_C_ExecuteUbergraph_B_SpacePistol::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_SpacePistol_C_ExecuteUbergraph_B_SpacePistol, CallFunc_GetBulletsPerClip_ReturnValue) == 0x000004, "Member 'B_SpacePistol_C_ExecuteUbergraph_B_SpacePistol::CallFunc_GetBulletsPerClip_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SpacePistol_C_ExecuteUbergraph_B_SpacePistol, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000008, "Member 'B_SpacePistol_C_ExecuteUbergraph_B_SpacePistol::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SpacePistol_C_ExecuteUbergraph_B_SpacePistol, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00000C, "Member 'B_SpacePistol_C_ExecuteUbergraph_B_SpacePistol::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SpacePistol_C_ExecuteUbergraph_B_SpacePistol, CallFunc_IsDedicatedServer_ReturnValue) == 0x00000D, "Member 'B_SpacePistol_C_ExecuteUbergraph_B_SpacePistol::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SpacePistol_C_ExecuteUbergraph_B_SpacePistol, CallFunc_IsDedicatedServer_ReturnValue2) == 0x00000E, "Member 'B_SpacePistol_C_ExecuteUbergraph_B_SpacePistol::CallFunc_IsDedicatedServer_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_SpacePistol_C_ExecuteUbergraph_B_SpacePistol, CallFunc_IsDedicatedServer_ReturnValue3) == 0x00000F, "Member 'B_SpacePistol_C_ExecuteUbergraph_B_SpacePistol::CallFunc_IsDedicatedServer_ReturnValue3' has a wrong offset!");
static_assert(offsetof(B_SpacePistol_C_ExecuteUbergraph_B_SpacePistol, K2Node_Event_bPersistentFire) == 0x000010, "Member 'B_SpacePistol_C_ExecuteUbergraph_B_SpacePistol::K2Node_Event_bPersistentFire' has a wrong offset!");
static_assert(offsetof(B_SpacePistol_C_ExecuteUbergraph_B_SpacePistol, K2Node_Event_ReloadStage) == 0x000011, "Member 'B_SpacePistol_C_ExecuteUbergraph_B_SpacePistol::K2Node_Event_ReloadStage' has a wrong offset!");
static_assert(offsetof(B_SpacePistol_C_ExecuteUbergraph_B_SpacePistol, K2Node_SwitchEnum_CmpSuccess) == 0x000012, "Member 'B_SpacePistol_C_ExecuteUbergraph_B_SpacePistol::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(B_SpacePistol_C_ExecuteUbergraph_B_SpacePistol, CallFunc_GetMagazineAmmoCount_ReturnValue) == 0x000014, "Member 'B_SpacePistol_C_ExecuteUbergraph_B_SpacePistol::CallFunc_GetMagazineAmmoCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SpacePistol_C_ExecuteUbergraph_B_SpacePistol, CallFunc_Lerp_ReturnValue) == 0x000018, "Member 'B_SpacePistol_C_ExecuteUbergraph_B_SpacePistol::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SpacePistol_C_ExecuteUbergraph_B_SpacePistol, CallFunc_GetRemainingAmmo_ReturnValue) == 0x00001C, "Member 'B_SpacePistol_C_ExecuteUbergraph_B_SpacePistol::CallFunc_GetRemainingAmmo_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SpacePistol_C_ExecuteUbergraph_B_SpacePistol, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000020, "Member 'B_SpacePistol_C_ExecuteUbergraph_B_SpacePistol::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SpacePistol_C_ExecuteUbergraph_B_SpacePistol, CallFunc_GetReloadTime_ReturnValue) == 0x000024, "Member 'B_SpacePistol_C_ExecuteUbergraph_B_SpacePistol::CallFunc_GetReloadTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SpacePistol_C_ExecuteUbergraph_B_SpacePistol, CallFunc_GetTimelineLength_ReturnValue) == 0x000028, "Member 'B_SpacePistol_C_ExecuteUbergraph_B_SpacePistol::CallFunc_GetTimelineLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SpacePistol_C_ExecuteUbergraph_B_SpacePistol, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00002C, "Member 'B_SpacePistol_C_ExecuteUbergraph_B_SpacePistol::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SpacePistol_C_ExecuteUbergraph_B_SpacePistol, CallFunc_FClamp_ReturnValue) == 0x000030, "Member 'B_SpacePistol_C_ExecuteUbergraph_B_SpacePistol::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SpacePistol_C_ExecuteUbergraph_B_SpacePistol, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000034, "Member 'B_SpacePistol_C_ExecuteUbergraph_B_SpacePistol::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SpacePistol_C_ExecuteUbergraph_B_SpacePistol, CallFunc_GetRemainingAmmo_ReturnValue2) == 0x000038, "Member 'B_SpacePistol_C_ExecuteUbergraph_B_SpacePistol::CallFunc_GetRemainingAmmo_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_SpacePistol_C_ExecuteUbergraph_B_SpacePistol, CallFunc_Clamp_ReturnValue) == 0x00003C, "Member 'B_SpacePistol_C_ExecuteUbergraph_B_SpacePistol::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SpacePistol_C_ExecuteUbergraph_B_SpacePistol, CallFunc_Conv_IntToFloat_ReturnValue2) == 0x000040, "Member 'B_SpacePistol_C_ExecuteUbergraph_B_SpacePistol::CallFunc_Conv_IntToFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_SpacePistol_C_ExecuteUbergraph_B_SpacePistol, CallFunc_Divide_FloatFloat_ReturnValue2) == 0x000044, "Member 'B_SpacePistol_C_ExecuteUbergraph_B_SpacePistol::CallFunc_Divide_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_SpacePistol_C_ExecuteUbergraph_B_SpacePistol, CallFunc_Subtract_FloatFloat_ReturnValue2) == 0x000048, "Member 'B_SpacePistol_C_ExecuteUbergraph_B_SpacePistol::CallFunc_Subtract_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_SpacePistol_C_ExecuteUbergraph_B_SpacePistol, CallFunc_LinearColorLerp_ReturnValue) == 0x00004C, "Member 'B_SpacePistol_C_ExecuteUbergraph_B_SpacePistol::CallFunc_LinearColorLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SpacePistol_C_ExecuteUbergraph_B_SpacePistol, CallFunc_FClamp_ReturnValue2) == 0x00005C, "Member 'B_SpacePistol_C_ExecuteUbergraph_B_SpacePistol::CallFunc_FClamp_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_SpacePistol_C_ExecuteUbergraph_B_SpacePistol, CallFunc_Conv_LinearColorToVector_ReturnValue) == 0x000060, "Member 'B_SpacePistol_C_ExecuteUbergraph_B_SpacePistol::CallFunc_Conv_LinearColorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SpacePistol_C_ExecuteUbergraph_B_SpacePistol, CallFunc_Lerp_ReturnValue2) == 0x00006C, "Member 'B_SpacePistol_C_ExecuteUbergraph_B_SpacePistol::CallFunc_Lerp_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_SpacePistol_C_ExecuteUbergraph_B_SpacePistol, CallFunc_LinearColorLerp_ReturnValue2) == 0x000070, "Member 'B_SpacePistol_C_ExecuteUbergraph_B_SpacePistol::CallFunc_LinearColorLerp_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_SpacePistol_C_ExecuteUbergraph_B_SpacePistol, CallFunc_Conv_LinearColorToVector_ReturnValue2) == 0x000080, "Member 'B_SpacePistol_C_ExecuteUbergraph_B_SpacePistol::CallFunc_Conv_LinearColorToVector_ReturnValue2' has a wrong offset!");

// Function B_SpacePistol.B_SpacePistol_C.OnPlayReloadFX
// 0x0001 (0x0001 - 0x0000)
struct B_SpacePistol_C_OnPlayReloadFX final
{
public:
	EFortReloadFXState                            ReloadStage;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_SpacePistol_C_OnPlayReloadFX) == 0x000001, "Wrong alignment on B_SpacePistol_C_OnPlayReloadFX");
static_assert(sizeof(B_SpacePistol_C_OnPlayReloadFX) == 0x000001, "Wrong size on B_SpacePistol_C_OnPlayReloadFX");
static_assert(offsetof(B_SpacePistol_C_OnPlayReloadFX, ReloadStage) == 0x000000, "Member 'B_SpacePistol_C_OnPlayReloadFX::ReloadStage' has a wrong offset!");

// Function B_SpacePistol.B_SpacePistol_C.OnPlayWeaponFireFX
// 0x0001 (0x0001 - 0x0000)
struct B_SpacePistol_C_OnPlayWeaponFireFX final
{
public:
	bool                                          bPersistentFire;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_SpacePistol_C_OnPlayWeaponFireFX) == 0x000001, "Wrong alignment on B_SpacePistol_C_OnPlayWeaponFireFX");
static_assert(sizeof(B_SpacePistol_C_OnPlayWeaponFireFX) == 0x000001, "Wrong size on B_SpacePistol_C_OnPlayWeaponFireFX");
static_assert(offsetof(B_SpacePistol_C_OnPlayWeaponFireFX, bPersistentFire) == 0x000000, "Member 'B_SpacePistol_C_OnPlayWeaponFireFX::bPersistentFire' has a wrong offset!");

// Function B_SpacePistol.B_SpacePistol_C.UserConstructionScript
// 0x0004 (0x0004 - 0x0000)
struct B_SpacePistol_C_UserConstructionScript final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_SpacePistol_C_UserConstructionScript) == 0x000004, "Wrong alignment on B_SpacePistol_C_UserConstructionScript");
static_assert(sizeof(B_SpacePistol_C_UserConstructionScript) == 0x000004, "Wrong size on B_SpacePistol_C_UserConstructionScript");
static_assert(offsetof(B_SpacePistol_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000000, "Member 'B_SpacePistol_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

// Function B_SpacePistol.B_SpacePistol_C.SetAmmoBarVariables
// 0x0034 (0x0034 - 0x0000)
struct B_SpacePistol_C_SetAmmoBarVariables final
{
public:
	int32                                         CallFunc_GetRemainingAmmo_ReturnValue;             // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetBulletsPerClip_ReturnValue;            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetBulletsPerClip_ReturnValue2;           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue2;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue3;             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue4;             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue2;           // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue2;         // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetMagazineAmmoCount_ReturnValue;         // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_SpacePistol_C_SetAmmoBarVariables) == 0x000004, "Wrong alignment on B_SpacePistol_C_SetAmmoBarVariables");
static_assert(sizeof(B_SpacePistol_C_SetAmmoBarVariables) == 0x000034, "Wrong size on B_SpacePistol_C_SetAmmoBarVariables");
static_assert(offsetof(B_SpacePistol_C_SetAmmoBarVariables, CallFunc_GetRemainingAmmo_ReturnValue) == 0x000000, "Member 'B_SpacePistol_C_SetAmmoBarVariables::CallFunc_GetRemainingAmmo_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SpacePistol_C_SetAmmoBarVariables, CallFunc_GetBulletsPerClip_ReturnValue) == 0x000004, "Member 'B_SpacePistol_C_SetAmmoBarVariables::CallFunc_GetBulletsPerClip_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SpacePistol_C_SetAmmoBarVariables, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000008, "Member 'B_SpacePistol_C_SetAmmoBarVariables::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SpacePistol_C_SetAmmoBarVariables, CallFunc_Conv_IntToFloat_ReturnValue) == 0x00000C, "Member 'B_SpacePistol_C_SetAmmoBarVariables::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SpacePistol_C_SetAmmoBarVariables, CallFunc_GetBulletsPerClip_ReturnValue2) == 0x000010, "Member 'B_SpacePistol_C_SetAmmoBarVariables::CallFunc_GetBulletsPerClip_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_SpacePistol_C_SetAmmoBarVariables, CallFunc_Conv_IntToFloat_ReturnValue2) == 0x000014, "Member 'B_SpacePistol_C_SetAmmoBarVariables::CallFunc_Conv_IntToFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_SpacePistol_C_SetAmmoBarVariables, CallFunc_Conv_IntToFloat_ReturnValue3) == 0x000018, "Member 'B_SpacePistol_C_SetAmmoBarVariables::CallFunc_Conv_IntToFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(B_SpacePistol_C_SetAmmoBarVariables, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00001C, "Member 'B_SpacePistol_C_SetAmmoBarVariables::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SpacePistol_C_SetAmmoBarVariables, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000020, "Member 'B_SpacePistol_C_SetAmmoBarVariables::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SpacePistol_C_SetAmmoBarVariables, CallFunc_Conv_IntToFloat_ReturnValue4) == 0x000024, "Member 'B_SpacePistol_C_SetAmmoBarVariables::CallFunc_Conv_IntToFloat_ReturnValue4' has a wrong offset!");
static_assert(offsetof(B_SpacePistol_C_SetAmmoBarVariables, CallFunc_Divide_FloatFloat_ReturnValue2) == 0x000028, "Member 'B_SpacePistol_C_SetAmmoBarVariables::CallFunc_Divide_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_SpacePistol_C_SetAmmoBarVariables, CallFunc_Subtract_FloatFloat_ReturnValue2) == 0x00002C, "Member 'B_SpacePistol_C_SetAmmoBarVariables::CallFunc_Subtract_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_SpacePistol_C_SetAmmoBarVariables, CallFunc_GetMagazineAmmoCount_ReturnValue) == 0x000030, "Member 'B_SpacePistol_C_SetAmmoBarVariables::CallFunc_GetMagazineAmmoCount_ReturnValue' has a wrong offset!");

}

#pragma pack(pop)
