#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Track

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass B_Track.B_Track_C
// 0x0030 (0x0A58 - 0x0A28)
class AB_Track_C final : public AFortTrack
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0A28(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        SwitchBase;                                        // 0x0A2C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   TrackMesh2;                                        // 0x0A30(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   TrackMesh1;                                        // 0x0A34(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class USplineComponent*                       Spline2;                                           // 0x0A38(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class USplineComponent*                       Spline1;                                           // 0x0A3C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UBoxComponent*                          PlacementCollision2;                               // 0x0A40(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UBoxComponent*                          PlacementCollision1;                               // 0x0A44(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   S_StormShield_Lever;                               // 0x0A48(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   Switch;                                            // 0x0A4C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class USoundBase*                             TracksPlacedSound;                                 // 0x0A50(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class USoundBase*                             SwitchTrackSound;                                  // 0x0A54(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_B_Track(int32 EntryPoint);
	void ReceiveBeginPlay();
	void OnSwitchStateChanged(int32 NewSwitchState, int32 OldSwitchState, int32 NumSwitchStates);
	void DebugSplines();
	void OnDeathPlayEffects(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Track_C">();
	}
	static class AB_Track_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Track_C>();
	}
};
static_assert(alignof(AB_Track_C) == 0x000004, "Wrong alignment on AB_Track_C");
static_assert(sizeof(AB_Track_C) == 0x000A58, "Wrong size on AB_Track_C");
static_assert(offsetof(AB_Track_C, UberGraphFrame) == 0x000A28, "Member 'AB_Track_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_Track_C, SwitchBase) == 0x000A2C, "Member 'AB_Track_C::SwitchBase' has a wrong offset!");
static_assert(offsetof(AB_Track_C, TrackMesh2) == 0x000A30, "Member 'AB_Track_C::TrackMesh2' has a wrong offset!");
static_assert(offsetof(AB_Track_C, TrackMesh1) == 0x000A34, "Member 'AB_Track_C::TrackMesh1' has a wrong offset!");
static_assert(offsetof(AB_Track_C, Spline2) == 0x000A38, "Member 'AB_Track_C::Spline2' has a wrong offset!");
static_assert(offsetof(AB_Track_C, Spline1) == 0x000A3C, "Member 'AB_Track_C::Spline1' has a wrong offset!");
static_assert(offsetof(AB_Track_C, PlacementCollision2) == 0x000A40, "Member 'AB_Track_C::PlacementCollision2' has a wrong offset!");
static_assert(offsetof(AB_Track_C, PlacementCollision1) == 0x000A44, "Member 'AB_Track_C::PlacementCollision1' has a wrong offset!");
static_assert(offsetof(AB_Track_C, S_StormShield_Lever) == 0x000A48, "Member 'AB_Track_C::S_StormShield_Lever' has a wrong offset!");
static_assert(offsetof(AB_Track_C, Switch) == 0x000A4C, "Member 'AB_Track_C::Switch' has a wrong offset!");
static_assert(offsetof(AB_Track_C, TracksPlacedSound) == 0x000A50, "Member 'AB_Track_C::TracksPlacedSound' has a wrong offset!");
static_assert(offsetof(AB_Track_C, SwitchTrackSound) == 0x000A54, "Member 'AB_Track_C::SwitchTrackSound' has a wrong offset!");

}

#pragma pack(pop)
