#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Track

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function B_Track.B_Track_C.ExecuteUbergraph_B_Track
// 0x01E8 (0x01E8 - 0x0000)
struct B_Track_C_ExecuteUbergraph_B_Track final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue2;         // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_Damage;                               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  K2Node_Event_DamageTags;                           // 0x0044(0x0018)(ConstParm)
	struct FVector                                K2Node_Event_Momentum;                             // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             K2Node_Event_HitInfo;                              // 0x0068(0x0080)(ConstParm, ContainsInstancedReference)
	class AFortPawn*                              K2Node_Event_InstigatedBy;                         // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext;                        // 0x00F0(0x000C)()
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Variable2;                                // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue2;             // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetLocationAtTime_ReturnValue;            // 0x0108(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue2;           // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetLocationAtTime_ReturnValue2;           // 0x0118(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue2;            // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_125[0x3];                                      // 0x0125(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         K2Node_Event_NewSwitchState;                       // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         K2Node_Event_OldSwitchState;                       // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         K2Node_Event_NumSwitchStates;                      // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetNumberOfSplinePoints_ReturnValue;      // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x3];                                      // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue3;             // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue4;             // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue3;           // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_RLerp_ReturnValue;                        // 0x0150(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x015C(0x0080)(ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue3;         // 0x01DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Track_C_ExecuteUbergraph_B_Track) == 0x000004, "Wrong alignment on B_Track_C_ExecuteUbergraph_B_Track");
static_assert(sizeof(B_Track_C_ExecuteUbergraph_B_Track) == 0x0001E8, "Wrong size on B_Track_C_ExecuteUbergraph_B_Track");
static_assert(offsetof(B_Track_C_ExecuteUbergraph_B_Track, EntryPoint) == 0x000000, "Member 'B_Track_C_ExecuteUbergraph_B_Track::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Track_C_ExecuteUbergraph_B_Track, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000004, "Member 'B_Track_C_ExecuteUbergraph_B_Track::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Track_C_ExecuteUbergraph_B_Track, Temp_int_Variable) == 0x000010, "Member 'B_Track_C_ExecuteUbergraph_B_Track::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(B_Track_C_ExecuteUbergraph_B_Track, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000014, "Member 'B_Track_C_ExecuteUbergraph_B_Track::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Track_C_ExecuteUbergraph_B_Track, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000018, "Member 'B_Track_C_ExecuteUbergraph_B_Track::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Track_C_ExecuteUbergraph_B_Track, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00001C, "Member 'B_Track_C_ExecuteUbergraph_B_Track::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Track_C_ExecuteUbergraph_B_Track, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'B_Track_C_ExecuteUbergraph_B_Track::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Track_C_ExecuteUbergraph_B_Track, CallFunc_K2_GetActorLocation_ReturnValue2) == 0x000024, "Member 'B_Track_C_ExecuteUbergraph_B_Track::CallFunc_K2_GetActorLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Track_C_ExecuteUbergraph_B_Track, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000030, "Member 'B_Track_C_ExecuteUbergraph_B_Track::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Track_C_ExecuteUbergraph_B_Track, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000034, "Member 'B_Track_C_ExecuteUbergraph_B_Track::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Track_C_ExecuteUbergraph_B_Track, K2Node_Event_Damage) == 0x000040, "Member 'B_Track_C_ExecuteUbergraph_B_Track::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(B_Track_C_ExecuteUbergraph_B_Track, K2Node_Event_DamageTags) == 0x000044, "Member 'B_Track_C_ExecuteUbergraph_B_Track::K2Node_Event_DamageTags' has a wrong offset!");
static_assert(offsetof(B_Track_C_ExecuteUbergraph_B_Track, K2Node_Event_Momentum) == 0x00005C, "Member 'B_Track_C_ExecuteUbergraph_B_Track::K2Node_Event_Momentum' has a wrong offset!");
static_assert(offsetof(B_Track_C_ExecuteUbergraph_B_Track, K2Node_Event_HitInfo) == 0x000068, "Member 'B_Track_C_ExecuteUbergraph_B_Track::K2Node_Event_HitInfo' has a wrong offset!");
static_assert(offsetof(B_Track_C_ExecuteUbergraph_B_Track, K2Node_Event_InstigatedBy) == 0x0000E8, "Member 'B_Track_C_ExecuteUbergraph_B_Track::K2Node_Event_InstigatedBy' has a wrong offset!");
static_assert(offsetof(B_Track_C_ExecuteUbergraph_B_Track, K2Node_Event_DamageCauser) == 0x0000EC, "Member 'B_Track_C_ExecuteUbergraph_B_Track::K2Node_Event_DamageCauser' has a wrong offset!");
static_assert(offsetof(B_Track_C_ExecuteUbergraph_B_Track, K2Node_Event_EffectContext) == 0x0000F0, "Member 'B_Track_C_ExecuteUbergraph_B_Track::K2Node_Event_EffectContext' has a wrong offset!");
static_assert(offsetof(B_Track_C_ExecuteUbergraph_B_Track, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x0000FC, "Member 'B_Track_C_ExecuteUbergraph_B_Track::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Track_C_ExecuteUbergraph_B_Track, Temp_int_Variable2) == 0x000100, "Member 'B_Track_C_ExecuteUbergraph_B_Track::Temp_int_Variable2' has a wrong offset!");
static_assert(offsetof(B_Track_C_ExecuteUbergraph_B_Track, CallFunc_Conv_IntToFloat_ReturnValue2) == 0x000104, "Member 'B_Track_C_ExecuteUbergraph_B_Track::CallFunc_Conv_IntToFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Track_C_ExecuteUbergraph_B_Track, CallFunc_GetLocationAtTime_ReturnValue) == 0x000108, "Member 'B_Track_C_ExecuteUbergraph_B_Track::CallFunc_GetLocationAtTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Track_C_ExecuteUbergraph_B_Track, CallFunc_Divide_FloatFloat_ReturnValue2) == 0x000114, "Member 'B_Track_C_ExecuteUbergraph_B_Track::CallFunc_Divide_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Track_C_ExecuteUbergraph_B_Track, CallFunc_GetLocationAtTime_ReturnValue2) == 0x000118, "Member 'B_Track_C_ExecuteUbergraph_B_Track::CallFunc_GetLocationAtTime_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Track_C_ExecuteUbergraph_B_Track, CallFunc_LessEqual_IntInt_ReturnValue2) == 0x000124, "Member 'B_Track_C_ExecuteUbergraph_B_Track::CallFunc_LessEqual_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Track_C_ExecuteUbergraph_B_Track, CallFunc_Add_IntInt_ReturnValue2) == 0x000128, "Member 'B_Track_C_ExecuteUbergraph_B_Track::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Track_C_ExecuteUbergraph_B_Track, K2Node_Event_NewSwitchState) == 0x00012C, "Member 'B_Track_C_ExecuteUbergraph_B_Track::K2Node_Event_NewSwitchState' has a wrong offset!");
static_assert(offsetof(B_Track_C_ExecuteUbergraph_B_Track, K2Node_Event_OldSwitchState) == 0x000130, "Member 'B_Track_C_ExecuteUbergraph_B_Track::K2Node_Event_OldSwitchState' has a wrong offset!");
static_assert(offsetof(B_Track_C_ExecuteUbergraph_B_Track, K2Node_Event_NumSwitchStates) == 0x000134, "Member 'B_Track_C_ExecuteUbergraph_B_Track::K2Node_Event_NumSwitchStates' has a wrong offset!");
static_assert(offsetof(B_Track_C_ExecuteUbergraph_B_Track, CallFunc_GetNumberOfSplinePoints_ReturnValue) == 0x000138, "Member 'B_Track_C_ExecuteUbergraph_B_Track::CallFunc_GetNumberOfSplinePoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Track_C_ExecuteUbergraph_B_Track, CallFunc_Subtract_IntInt_ReturnValue) == 0x00013C, "Member 'B_Track_C_ExecuteUbergraph_B_Track::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Track_C_ExecuteUbergraph_B_Track, CallFunc_Greater_IntInt_ReturnValue) == 0x000140, "Member 'B_Track_C_ExecuteUbergraph_B_Track::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Track_C_ExecuteUbergraph_B_Track, CallFunc_Conv_IntToFloat_ReturnValue3) == 0x000144, "Member 'B_Track_C_ExecuteUbergraph_B_Track::CallFunc_Conv_IntToFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(B_Track_C_ExecuteUbergraph_B_Track, CallFunc_Conv_IntToFloat_ReturnValue4) == 0x000148, "Member 'B_Track_C_ExecuteUbergraph_B_Track::CallFunc_Conv_IntToFloat_ReturnValue4' has a wrong offset!");
static_assert(offsetof(B_Track_C_ExecuteUbergraph_B_Track, CallFunc_Divide_FloatFloat_ReturnValue3) == 0x00014C, "Member 'B_Track_C_ExecuteUbergraph_B_Track::CallFunc_Divide_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(B_Track_C_ExecuteUbergraph_B_Track, CallFunc_RLerp_ReturnValue) == 0x000150, "Member 'B_Track_C_ExecuteUbergraph_B_Track::CallFunc_RLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Track_C_ExecuteUbergraph_B_Track, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x00015C, "Member 'B_Track_C_ExecuteUbergraph_B_Track::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(B_Track_C_ExecuteUbergraph_B_Track, CallFunc_K2_GetActorLocation_ReturnValue3) == 0x0001DC, "Member 'B_Track_C_ExecuteUbergraph_B_Track::CallFunc_K2_GetActorLocation_ReturnValue3' has a wrong offset!");

// Function B_Track.B_Track_C.OnSwitchStateChanged
// 0x000C (0x000C - 0x0000)
struct B_Track_C_OnSwitchStateChanged final
{
public:
	int32                                         NewSwitchState;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         OldSwitchState;                                    // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         NumSwitchStates;                                   // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Track_C_OnSwitchStateChanged) == 0x000004, "Wrong alignment on B_Track_C_OnSwitchStateChanged");
static_assert(sizeof(B_Track_C_OnSwitchStateChanged) == 0x00000C, "Wrong size on B_Track_C_OnSwitchStateChanged");
static_assert(offsetof(B_Track_C_OnSwitchStateChanged, NewSwitchState) == 0x000000, "Member 'B_Track_C_OnSwitchStateChanged::NewSwitchState' has a wrong offset!");
static_assert(offsetof(B_Track_C_OnSwitchStateChanged, OldSwitchState) == 0x000004, "Member 'B_Track_C_OnSwitchStateChanged::OldSwitchState' has a wrong offset!");
static_assert(offsetof(B_Track_C_OnSwitchStateChanged, NumSwitchStates) == 0x000008, "Member 'B_Track_C_OnSwitchStateChanged::NumSwitchStates' has a wrong offset!");

// Function B_Track.B_Track_C.OnDeathPlayEffects
// 0x00BC (0x00BC - 0x0000)
struct B_Track_C_OnDeathPlayEffects final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  DamageTags;                                        // 0x0004(0x0018)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FVector                                Momentum;                                          // 0x001C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             HitInfo;                                           // 0x0028(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class AFortPawn*                              InstigatedBy;                                      // 0x00A8(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 DamageCauser;                                      // 0x00AC(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x00B0(0x000C)(Parm)
};
static_assert(alignof(B_Track_C_OnDeathPlayEffects) == 0x000004, "Wrong alignment on B_Track_C_OnDeathPlayEffects");
static_assert(sizeof(B_Track_C_OnDeathPlayEffects) == 0x0000BC, "Wrong size on B_Track_C_OnDeathPlayEffects");
static_assert(offsetof(B_Track_C_OnDeathPlayEffects, Damage) == 0x000000, "Member 'B_Track_C_OnDeathPlayEffects::Damage' has a wrong offset!");
static_assert(offsetof(B_Track_C_OnDeathPlayEffects, DamageTags) == 0x000004, "Member 'B_Track_C_OnDeathPlayEffects::DamageTags' has a wrong offset!");
static_assert(offsetof(B_Track_C_OnDeathPlayEffects, Momentum) == 0x00001C, "Member 'B_Track_C_OnDeathPlayEffects::Momentum' has a wrong offset!");
static_assert(offsetof(B_Track_C_OnDeathPlayEffects, HitInfo) == 0x000028, "Member 'B_Track_C_OnDeathPlayEffects::HitInfo' has a wrong offset!");
static_assert(offsetof(B_Track_C_OnDeathPlayEffects, InstigatedBy) == 0x0000A8, "Member 'B_Track_C_OnDeathPlayEffects::InstigatedBy' has a wrong offset!");
static_assert(offsetof(B_Track_C_OnDeathPlayEffects, DamageCauser) == 0x0000AC, "Member 'B_Track_C_OnDeathPlayEffects::DamageCauser' has a wrong offset!");
static_assert(offsetof(B_Track_C_OnDeathPlayEffects, EffectContext) == 0x0000B0, "Member 'B_Track_C_OnDeathPlayEffects::EffectContext' has a wrong offset!");

}

#pragma pack(pop)
