#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BaseDestruction_Cornerstone

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function BaseDestruction_Cornerstone.BaseDestruction_Cornerstone_C.ExecuteUbergraph_BaseDestruction_Cornerstone
// 0x038C (0x038C - 0x0000)
struct BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0014(0x0080)(ConstParm, ContainsInstancedReference)
	class AFortAIPawn*                            K2Node_DynamicCast_AsFort_AIPawn;                  // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_MakeStruct_GameplayEventData;               // 0x009C(0x0058)()
	bool                                          K2Node_Event_bIsInvincible;                        // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x00F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F6[0x2];                                       // 0x00F6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameMode*                              CallFunc_GetGameMode_ReturnValue;                  // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UObject*                                K2Node_DynamicCast_AsFort_Game_Mode_Zone;          // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue2;                // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_102[0x2];                                      // 0x0102(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0104(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Damage3;                              // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  K2Node_Event_DamageTags3;                          // 0x0118(0x0018)(ConstParm)
	struct FVector                                K2Node_Event_Momentum3;                            // 0x0130(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             K2Node_Event_HitInfo3;                             // 0x013C(0x0080)(ConstParm, ContainsInstancedReference)
	class AFortPawn*                              K2Node_Event_InstigatedBy3;                        // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_Event_DamageCauser3;                        // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext3;                       // 0x01C4(0x000C)()
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_Enabled;                        // 0x01D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D2[0x2];                                      // 0x01D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_Magnitude;                      // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_Damage2;                              // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  K2Node_Event_DamageTags2;                          // 0x01DC(0x0018)(ConstParm)
	struct FVector                                K2Node_Event_Momentum2;                            // 0x01F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             K2Node_Event_HitInfo2;                             // 0x0200(0x0080)(ConstParm, ContainsInstancedReference)
	class AController*                            K2Node_Event_InstigatedBy2;                        // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_Event_DamageCauser2;                        // 0x0284(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext2;                       // 0x0288(0x000C)()
	bool                                          CallFunc_HasAuthority_ReturnValue3;                // 0x0294(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DoesContainerMatchAnyTagsInContainer_ReturnValue; // 0x0295(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_296[0x2];                                      // 0x0296(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0298(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_CustomEvent_RemovedByAI;                    // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A9[0x3];                                      // 0x02A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x02AC(0x0004)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x02B0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C1[0x3];                                      // 0x02C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Damage;                               // 0x02C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  K2Node_Event_DamageTags;                           // 0x02C8(0x0018)(ConstParm)
	struct FVector                                K2Node_Event_Momentum;                             // 0x02E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             K2Node_Event_HitInfo;                              // 0x02EC(0x0080)(ConstParm, ContainsInstancedReference)
	class AController*                            K2Node_Event_InstigatedBy;                         // 0x036C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext;                        // 0x0374(0x000C)()
	bool                                          CallFunc_HasAuthority_ReturnValue4;                // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue5;                // 0x0381(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue3;                  // 0x0382(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_383[0x1];                                      // 0x0383(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_Time;                           // 0x0384(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue6;                // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone) == 0x000004, "Wrong alignment on BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone");
static_assert(sizeof(BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone) == 0x00038C, "Wrong size on BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone");
static_assert(offsetof(BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone, EntryPoint) == 0x000000, "Member 'BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone::EntryPoint' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone, K2Node_ComponentBoundEvent_OtherActor) == 0x000004, "Member 'BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone, K2Node_ComponentBoundEvent_OtherComp) == 0x000008, "Member 'BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x00000C, "Member 'BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone, K2Node_ComponentBoundEvent_bFromSweep) == 0x000010, "Member 'BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone, K2Node_ComponentBoundEvent_SweepResult) == 0x000014, "Member 'BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone, K2Node_DynamicCast_AsFort_AIPawn) == 0x000094, "Member 'BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone::K2Node_DynamicCast_AsFort_AIPawn' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone, K2Node_DynamicCast_bSuccess) == 0x000098, "Member 'BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone, K2Node_MakeStruct_GameplayEventData) == 0x00009C, "Member 'BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone::K2Node_MakeStruct_GameplayEventData' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone, K2Node_Event_bIsInvincible) == 0x0000F4, "Member 'BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone::K2Node_Event_bIsInvincible' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone, CallFunc_HasAuthority_ReturnValue) == 0x0000F5, "Member 'BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone, CallFunc_GetGameMode_ReturnValue) == 0x0000F8, "Member 'BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone, K2Node_DynamicCast_AsFort_Game_Mode_Zone) == 0x0000FC, "Member 'BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone::K2Node_DynamicCast_AsFort_Game_Mode_Zone' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone, K2Node_DynamicCast_bSuccess2) == 0x000100, "Member 'BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone, CallFunc_HasAuthority_ReturnValue2) == 0x000101, "Member 'BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone::CallFunc_HasAuthority_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000104, "Member 'BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone, CallFunc_Not_PreBool_ReturnValue) == 0x000110, "Member 'BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone, K2Node_Event_Damage3) == 0x000114, "Member 'BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone::K2Node_Event_Damage3' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone, K2Node_Event_DamageTags3) == 0x000118, "Member 'BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone::K2Node_Event_DamageTags3' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone, K2Node_Event_Momentum3) == 0x000130, "Member 'BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone::K2Node_Event_Momentum3' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone, K2Node_Event_HitInfo3) == 0x00013C, "Member 'BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone::K2Node_Event_HitInfo3' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone, K2Node_Event_InstigatedBy3) == 0x0001BC, "Member 'BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone::K2Node_Event_InstigatedBy3' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone, K2Node_Event_DamageCauser3) == 0x0001C0, "Member 'BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone::K2Node_Event_DamageCauser3' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone, K2Node_Event_EffectContext3) == 0x0001C4, "Member 'BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone::K2Node_Event_EffectContext3' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone, CallFunc_BooleanAND_ReturnValue) == 0x0001D0, "Member 'BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone, K2Node_CustomEvent_Enabled) == 0x0001D1, "Member 'BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone::K2Node_CustomEvent_Enabled' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone, K2Node_CustomEvent_Magnitude) == 0x0001D4, "Member 'BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone::K2Node_CustomEvent_Magnitude' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone, K2Node_Event_Damage2) == 0x0001D8, "Member 'BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone::K2Node_Event_Damage2' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone, K2Node_Event_DamageTags2) == 0x0001DC, "Member 'BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone::K2Node_Event_DamageTags2' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone, K2Node_Event_Momentum2) == 0x0001F4, "Member 'BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone::K2Node_Event_Momentum2' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone, K2Node_Event_HitInfo2) == 0x000200, "Member 'BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone::K2Node_Event_HitInfo2' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone, K2Node_Event_InstigatedBy2) == 0x000280, "Member 'BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone::K2Node_Event_InstigatedBy2' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone, K2Node_Event_DamageCauser2) == 0x000284, "Member 'BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone::K2Node_Event_DamageCauser2' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone, K2Node_Event_EffectContext2) == 0x000288, "Member 'BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone::K2Node_Event_EffectContext2' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone, CallFunc_HasAuthority_ReturnValue3) == 0x000294, "Member 'BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone::CallFunc_HasAuthority_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone, CallFunc_DoesContainerMatchAnyTagsInContainer_ReturnValue) == 0x000295, "Member 'BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone::CallFunc_DoesContainerMatchAnyTagsInContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone, K2Node_CreateDelegate_OutputDelegate) == 0x000298, "Member 'BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone, K2Node_CustomEvent_RemovedByAI) == 0x0002A8, "Member 'BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone::K2Node_CustomEvent_RemovedByAI' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0002AC, "Member 'BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone, K2Node_CreateDelegate_OutputDelegate2) == 0x0002B0, "Member 'BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone, CallFunc_BooleanAND_ReturnValue2) == 0x0002C0, "Member 'BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone, K2Node_Event_Damage) == 0x0002C4, "Member 'BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone, K2Node_Event_DamageTags) == 0x0002C8, "Member 'BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone::K2Node_Event_DamageTags' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone, K2Node_Event_Momentum) == 0x0002E0, "Member 'BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone::K2Node_Event_Momentum' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone, K2Node_Event_HitInfo) == 0x0002EC, "Member 'BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone::K2Node_Event_HitInfo' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone, K2Node_Event_InstigatedBy) == 0x00036C, "Member 'BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone::K2Node_Event_InstigatedBy' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone, K2Node_Event_DamageCauser) == 0x000370, "Member 'BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone::K2Node_Event_DamageCauser' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone, K2Node_Event_EffectContext) == 0x000374, "Member 'BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone::K2Node_Event_EffectContext' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone, CallFunc_HasAuthority_ReturnValue4) == 0x000380, "Member 'BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone::CallFunc_HasAuthority_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone, CallFunc_HasAuthority_ReturnValue5) == 0x000381, "Member 'BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone::CallFunc_HasAuthority_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone, CallFunc_BooleanAND_ReturnValue3) == 0x000382, "Member 'BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone::CallFunc_BooleanAND_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone, K2Node_CustomEvent_Time) == 0x000384, "Member 'BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone::K2Node_CustomEvent_Time' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone, CallFunc_HasAuthority_ReturnValue6) == 0x000388, "Member 'BaseDestruction_Cornerstone_C_ExecuteUbergraph_BaseDestruction_Cornerstone::CallFunc_HasAuthority_ReturnValue6' has a wrong offset!");

// Function BaseDestruction_Cornerstone.BaseDestruction_Cornerstone_C.SetDmgResistRestoreTimer
// 0x0004 (0x0004 - 0x0000)
struct BaseDestruction_Cornerstone_C_SetDmgResistRestoreTimer final
{
public:
	float                                         Time;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BaseDestruction_Cornerstone_C_SetDmgResistRestoreTimer) == 0x000004, "Wrong alignment on BaseDestruction_Cornerstone_C_SetDmgResistRestoreTimer");
static_assert(sizeof(BaseDestruction_Cornerstone_C_SetDmgResistRestoreTimer) == 0x000004, "Wrong size on BaseDestruction_Cornerstone_C_SetDmgResistRestoreTimer");
static_assert(offsetof(BaseDestruction_Cornerstone_C_SetDmgResistRestoreTimer, Time) == 0x000000, "Member 'BaseDestruction_Cornerstone_C_SetDmgResistRestoreTimer::Time' has a wrong offset!");

// Function BaseDestruction_Cornerstone.BaseDestruction_Cornerstone_C.OnDeathServer
// 0x00BC (0x00BC - 0x0000)
struct BaseDestruction_Cornerstone_C_OnDeathServer final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  DamageTags;                                        // 0x0004(0x0018)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FVector                                Momentum;                                          // 0x001C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             HitInfo;                                           // 0x0028(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class AController*                            InstigatedBy;                                      // 0x00A8(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 DamageCauser;                                      // 0x00AC(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x00B0(0x000C)(Parm)
};
static_assert(alignof(BaseDestruction_Cornerstone_C_OnDeathServer) == 0x000004, "Wrong alignment on BaseDestruction_Cornerstone_C_OnDeathServer");
static_assert(sizeof(BaseDestruction_Cornerstone_C_OnDeathServer) == 0x0000BC, "Wrong size on BaseDestruction_Cornerstone_C_OnDeathServer");
static_assert(offsetof(BaseDestruction_Cornerstone_C_OnDeathServer, Damage) == 0x000000, "Member 'BaseDestruction_Cornerstone_C_OnDeathServer::Damage' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_OnDeathServer, DamageTags) == 0x000004, "Member 'BaseDestruction_Cornerstone_C_OnDeathServer::DamageTags' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_OnDeathServer, Momentum) == 0x00001C, "Member 'BaseDestruction_Cornerstone_C_OnDeathServer::Momentum' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_OnDeathServer, HitInfo) == 0x000028, "Member 'BaseDestruction_Cornerstone_C_OnDeathServer::HitInfo' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_OnDeathServer, InstigatedBy) == 0x0000A8, "Member 'BaseDestruction_Cornerstone_C_OnDeathServer::InstigatedBy' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_OnDeathServer, DamageCauser) == 0x0000AC, "Member 'BaseDestruction_Cornerstone_C_OnDeathServer::DamageCauser' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_OnDeathServer, EffectContext) == 0x0000B0, "Member 'BaseDestruction_Cornerstone_C_OnDeathServer::EffectContext' has a wrong offset!");

// Function BaseDestruction_Cornerstone.BaseDestruction_Cornerstone_C.SetDmgResistRemovedByAI
// 0x0001 (0x0001 - 0x0000)
struct BaseDestruction_Cornerstone_C_SetDmgResistRemovedByAI final
{
public:
	bool                                          RemovedByAI;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BaseDestruction_Cornerstone_C_SetDmgResistRemovedByAI) == 0x000001, "Wrong alignment on BaseDestruction_Cornerstone_C_SetDmgResistRemovedByAI");
static_assert(sizeof(BaseDestruction_Cornerstone_C_SetDmgResistRemovedByAI) == 0x000001, "Wrong size on BaseDestruction_Cornerstone_C_SetDmgResistRemovedByAI");
static_assert(offsetof(BaseDestruction_Cornerstone_C_SetDmgResistRemovedByAI, RemovedByAI) == 0x000000, "Member 'BaseDestruction_Cornerstone_C_SetDmgResistRemovedByAI::RemovedByAI' has a wrong offset!");

// Function BaseDestruction_Cornerstone.BaseDestruction_Cornerstone_C.OnDamageServer
// 0x00BC (0x00BC - 0x0000)
struct BaseDestruction_Cornerstone_C_OnDamageServer final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  DamageTags;                                        // 0x0004(0x0018)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FVector                                Momentum;                                          // 0x001C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             HitInfo;                                           // 0x0028(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class AController*                            InstigatedBy;                                      // 0x00A8(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 DamageCauser;                                      // 0x00AC(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x00B0(0x000C)(Parm)
};
static_assert(alignof(BaseDestruction_Cornerstone_C_OnDamageServer) == 0x000004, "Wrong alignment on BaseDestruction_Cornerstone_C_OnDamageServer");
static_assert(sizeof(BaseDestruction_Cornerstone_C_OnDamageServer) == 0x0000BC, "Wrong size on BaseDestruction_Cornerstone_C_OnDamageServer");
static_assert(offsetof(BaseDestruction_Cornerstone_C_OnDamageServer, Damage) == 0x000000, "Member 'BaseDestruction_Cornerstone_C_OnDamageServer::Damage' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_OnDamageServer, DamageTags) == 0x000004, "Member 'BaseDestruction_Cornerstone_C_OnDamageServer::DamageTags' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_OnDamageServer, Momentum) == 0x00001C, "Member 'BaseDestruction_Cornerstone_C_OnDamageServer::Momentum' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_OnDamageServer, HitInfo) == 0x000028, "Member 'BaseDestruction_Cornerstone_C_OnDamageServer::HitInfo' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_OnDamageServer, InstigatedBy) == 0x0000A8, "Member 'BaseDestruction_Cornerstone_C_OnDamageServer::InstigatedBy' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_OnDamageServer, DamageCauser) == 0x0000AC, "Member 'BaseDestruction_Cornerstone_C_OnDamageServer::DamageCauser' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_OnDamageServer, EffectContext) == 0x0000B0, "Member 'BaseDestruction_Cornerstone_C_OnDamageServer::EffectContext' has a wrong offset!");

// Function BaseDestruction_Cornerstone.BaseDestruction_Cornerstone_C.SetDmgResistMag
// 0x0004 (0x0004 - 0x0000)
struct BaseDestruction_Cornerstone_C_SetDmgResistMag final
{
public:
	float                                         Magnitude;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BaseDestruction_Cornerstone_C_SetDmgResistMag) == 0x000004, "Wrong alignment on BaseDestruction_Cornerstone_C_SetDmgResistMag");
static_assert(sizeof(BaseDestruction_Cornerstone_C_SetDmgResistMag) == 0x000004, "Wrong size on BaseDestruction_Cornerstone_C_SetDmgResistMag");
static_assert(offsetof(BaseDestruction_Cornerstone_C_SetDmgResistMag, Magnitude) == 0x000000, "Member 'BaseDestruction_Cornerstone_C_SetDmgResistMag::Magnitude' has a wrong offset!");

// Function BaseDestruction_Cornerstone.BaseDestruction_Cornerstone_C.EnableDmgResistFeature
// 0x0001 (0x0001 - 0x0000)
struct BaseDestruction_Cornerstone_C_EnableDmgResistFeature final
{
public:
	bool                                          Enabled;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BaseDestruction_Cornerstone_C_EnableDmgResistFeature) == 0x000001, "Wrong alignment on BaseDestruction_Cornerstone_C_EnableDmgResistFeature");
static_assert(sizeof(BaseDestruction_Cornerstone_C_EnableDmgResistFeature) == 0x000001, "Wrong size on BaseDestruction_Cornerstone_C_EnableDmgResistFeature");
static_assert(offsetof(BaseDestruction_Cornerstone_C_EnableDmgResistFeature, Enabled) == 0x000000, "Member 'BaseDestruction_Cornerstone_C_EnableDmgResistFeature::Enabled' has a wrong offset!");

// Function BaseDestruction_Cornerstone.BaseDestruction_Cornerstone_C.OnInvincibilityChanged
// 0x0001 (0x0001 - 0x0000)
struct BaseDestruction_Cornerstone_C_OnInvincibilityChanged final
{
public:
	bool                                          bIsInvincible;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BaseDestruction_Cornerstone_C_OnInvincibilityChanged) == 0x000001, "Wrong alignment on BaseDestruction_Cornerstone_C_OnInvincibilityChanged");
static_assert(sizeof(BaseDestruction_Cornerstone_C_OnInvincibilityChanged) == 0x000001, "Wrong size on BaseDestruction_Cornerstone_C_OnInvincibilityChanged");
static_assert(offsetof(BaseDestruction_Cornerstone_C_OnInvincibilityChanged, bIsInvincible) == 0x000000, "Member 'BaseDestruction_Cornerstone_C_OnInvincibilityChanged::bIsInvincible' has a wrong offset!");

// Function BaseDestruction_Cornerstone.BaseDestruction_Cornerstone_C.BndEvt__SuicideTrigger_K2Node_ComponentBoundEvent_45_ComponentBeginOverlapSignature__DelegateSignature
// 0x0090 (0x0090 - 0x0000)
struct BaseDestruction_Cornerstone_C_BndEvt__SuicideTrigger_K2Node_ComponentBoundEvent_45_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         OtherBodyIndex;                                    // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bFromSweep;                                        // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0010(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(BaseDestruction_Cornerstone_C_BndEvt__SuicideTrigger_K2Node_ComponentBoundEvent_45_ComponentBeginOverlapSignature__DelegateSignature) == 0x000004, "Wrong alignment on BaseDestruction_Cornerstone_C_BndEvt__SuicideTrigger_K2Node_ComponentBoundEvent_45_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BaseDestruction_Cornerstone_C_BndEvt__SuicideTrigger_K2Node_ComponentBoundEvent_45_ComponentBeginOverlapSignature__DelegateSignature) == 0x000090, "Wrong size on BaseDestruction_Cornerstone_C_BndEvt__SuicideTrigger_K2Node_ComponentBoundEvent_45_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BaseDestruction_Cornerstone_C_BndEvt__SuicideTrigger_K2Node_ComponentBoundEvent_45_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000000, "Member 'BaseDestruction_Cornerstone_C_BndEvt__SuicideTrigger_K2Node_ComponentBoundEvent_45_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_BndEvt__SuicideTrigger_K2Node_ComponentBoundEvent_45_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000004, "Member 'BaseDestruction_Cornerstone_C_BndEvt__SuicideTrigger_K2Node_ComponentBoundEvent_45_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_BndEvt__SuicideTrigger_K2Node_ComponentBoundEvent_45_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000008, "Member 'BaseDestruction_Cornerstone_C_BndEvt__SuicideTrigger_K2Node_ComponentBoundEvent_45_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_BndEvt__SuicideTrigger_K2Node_ComponentBoundEvent_45_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00000C, "Member 'BaseDestruction_Cornerstone_C_BndEvt__SuicideTrigger_K2Node_ComponentBoundEvent_45_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_BndEvt__SuicideTrigger_K2Node_ComponentBoundEvent_45_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000010, "Member 'BaseDestruction_Cornerstone_C_BndEvt__SuicideTrigger_K2Node_ComponentBoundEvent_45_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BaseDestruction_Cornerstone.BaseDestruction_Cornerstone_C.OnDamagePlayEffects
// 0x00BC (0x00BC - 0x0000)
struct BaseDestruction_Cornerstone_C_OnDamagePlayEffects final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  DamageTags;                                        // 0x0004(0x0018)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FVector                                Momentum;                                          // 0x001C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             HitInfo;                                           // 0x0028(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class AFortPawn*                              InstigatedBy;                                      // 0x00A8(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 DamageCauser;                                      // 0x00AC(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x00B0(0x000C)(Parm)
};
static_assert(alignof(BaseDestruction_Cornerstone_C_OnDamagePlayEffects) == 0x000004, "Wrong alignment on BaseDestruction_Cornerstone_C_OnDamagePlayEffects");
static_assert(sizeof(BaseDestruction_Cornerstone_C_OnDamagePlayEffects) == 0x0000BC, "Wrong size on BaseDestruction_Cornerstone_C_OnDamagePlayEffects");
static_assert(offsetof(BaseDestruction_Cornerstone_C_OnDamagePlayEffects, Damage) == 0x000000, "Member 'BaseDestruction_Cornerstone_C_OnDamagePlayEffects::Damage' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_OnDamagePlayEffects, DamageTags) == 0x000004, "Member 'BaseDestruction_Cornerstone_C_OnDamagePlayEffects::DamageTags' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_OnDamagePlayEffects, Momentum) == 0x00001C, "Member 'BaseDestruction_Cornerstone_C_OnDamagePlayEffects::Momentum' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_OnDamagePlayEffects, HitInfo) == 0x000028, "Member 'BaseDestruction_Cornerstone_C_OnDamagePlayEffects::HitInfo' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_OnDamagePlayEffects, InstigatedBy) == 0x0000A8, "Member 'BaseDestruction_Cornerstone_C_OnDamagePlayEffects::InstigatedBy' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_OnDamagePlayEffects, DamageCauser) == 0x0000AC, "Member 'BaseDestruction_Cornerstone_C_OnDamagePlayEffects::DamageCauser' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_OnDamagePlayEffects, EffectContext) == 0x0000B0, "Member 'BaseDestruction_Cornerstone_C_OnDamagePlayEffects::EffectContext' has a wrong offset!");

// Function BaseDestruction_Cornerstone.BaseDestruction_Cornerstone_C.UserConstructionScript
// 0x0010 (0x0010 - 0x0000)
struct BaseDestruction_Cornerstone_C_UserConstructionScript final
{
public:
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue2;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue2; // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BaseDestruction_Cornerstone_C_UserConstructionScript) == 0x000004, "Wrong alignment on BaseDestruction_Cornerstone_C_UserConstructionScript");
static_assert(sizeof(BaseDestruction_Cornerstone_C_UserConstructionScript) == 0x000010, "Wrong size on BaseDestruction_Cornerstone_C_UserConstructionScript");
static_assert(offsetof(BaseDestruction_Cornerstone_C_UserConstructionScript, K2Node_SwitchEnum_CmpSuccess) == 0x000000, "Member 'BaseDestruction_Cornerstone_C_UserConstructionScript::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue) == 0x000001, "Member 'BaseDestruction_Cornerstone_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000004, "Member 'BaseDestruction_Cornerstone_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue2) == 0x000008, "Member 'BaseDestruction_Cornerstone_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue2) == 0x00000C, "Member 'BaseDestruction_Cornerstone_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue2' has a wrong offset!");

// Function BaseDestruction_Cornerstone.BaseDestruction_Cornerstone_C.OnRep_MatchStarted
// 0x0014 (0x0014 - 0x0000)
struct BaseDestruction_Cornerstone_C_OnRep_MatchStarted final
{
public:
	TArray<class AFortPlayerController*>          CallFunc_GetLocalFortPlayerControllers_ReturnValue; // 0x0000(0x000C)(ZeroConstructor, ReferenceParm)
	class AFortPlayerController*                  CallFunc_Array_Get_Item;                           // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortTeamAffiliation                          CallFunc_GetTeamAffiliation_ReturnValue;           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BaseDestruction_Cornerstone_C_OnRep_MatchStarted) == 0x000004, "Wrong alignment on BaseDestruction_Cornerstone_C_OnRep_MatchStarted");
static_assert(sizeof(BaseDestruction_Cornerstone_C_OnRep_MatchStarted) == 0x000014, "Wrong size on BaseDestruction_Cornerstone_C_OnRep_MatchStarted");
static_assert(offsetof(BaseDestruction_Cornerstone_C_OnRep_MatchStarted, CallFunc_GetLocalFortPlayerControllers_ReturnValue) == 0x000000, "Member 'BaseDestruction_Cornerstone_C_OnRep_MatchStarted::CallFunc_GetLocalFortPlayerControllers_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_OnRep_MatchStarted, CallFunc_Array_Get_Item) == 0x00000C, "Member 'BaseDestruction_Cornerstone_C_OnRep_MatchStarted::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_OnRep_MatchStarted, CallFunc_GetTeamAffiliation_ReturnValue) == 0x000010, "Member 'BaseDestruction_Cornerstone_C_OnRep_MatchStarted::CallFunc_GetTeamAffiliation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_OnRep_MatchStarted, K2Node_SwitchEnum_CmpSuccess) == 0x000011, "Member 'BaseDestruction_Cornerstone_C_OnRep_MatchStarted::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BaseDestruction_Cornerstone.BaseDestruction_Cornerstone_C.Update Shield State
// 0x0003 (0x0003 - 0x0000)
struct BaseDestruction_Cornerstone_C_Update_Shield_State final
{
public:
	bool                                          NewHidden;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bPropagateToChildren;                              // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	ECollisionEnabled                             NewType;                                           // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BaseDestruction_Cornerstone_C_Update_Shield_State) == 0x000001, "Wrong alignment on BaseDestruction_Cornerstone_C_Update_Shield_State");
static_assert(sizeof(BaseDestruction_Cornerstone_C_Update_Shield_State) == 0x000003, "Wrong size on BaseDestruction_Cornerstone_C_Update_Shield_State");
static_assert(offsetof(BaseDestruction_Cornerstone_C_Update_Shield_State, NewHidden) == 0x000000, "Member 'BaseDestruction_Cornerstone_C_Update_Shield_State::NewHidden' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_Update_Shield_State, bPropagateToChildren) == 0x000001, "Member 'BaseDestruction_Cornerstone_C_Update_Shield_State::bPropagateToChildren' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_Update_Shield_State, NewType) == 0x000002, "Member 'BaseDestruction_Cornerstone_C_Update_Shield_State::NewType' has a wrong offset!");

// Function BaseDestruction_Cornerstone.BaseDestruction_Cornerstone_C.OnRep_DmgResistActive
// 0x0003 (0x0003 - 0x0000)
struct BaseDestruction_Cornerstone_C_OnRep_DmgResistActive final
{
public:
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BaseDestruction_Cornerstone_C_OnRep_DmgResistActive) == 0x000001, "Wrong alignment on BaseDestruction_Cornerstone_C_OnRep_DmgResistActive");
static_assert(sizeof(BaseDestruction_Cornerstone_C_OnRep_DmgResistActive) == 0x000003, "Wrong size on BaseDestruction_Cornerstone_C_OnRep_DmgResistActive");
static_assert(offsetof(BaseDestruction_Cornerstone_C_OnRep_DmgResistActive, CallFunc_Not_PreBool_ReturnValue) == 0x000000, "Member 'BaseDestruction_Cornerstone_C_OnRep_DmgResistActive::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_OnRep_DmgResistActive, CallFunc_HasAuthority_ReturnValue) == 0x000001, "Member 'BaseDestruction_Cornerstone_C_OnRep_DmgResistActive::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_OnRep_DmgResistActive, CallFunc_IsDedicatedServer_ReturnValue) == 0x000002, "Member 'BaseDestruction_Cornerstone_C_OnRep_DmgResistActive::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");

// Function BaseDestruction_Cornerstone.BaseDestruction_Cornerstone_C.ApplyDmgResistGE
// 0x0024 (0x0024 - 0x0000)
struct BaseDestruction_Cornerstone_C_ApplyDmgResistGE final
{
public:
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingSpec_ReturnValue;             // 0x0008(0x000C)()
	struct FGameplayEffectSpecHandle              CallFunc_AssignSetByCallerMagnitude_ReturnValue;   // 0x0014(0x000C)()
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue; // 0x0020(0x0004)()
};
static_assert(alignof(BaseDestruction_Cornerstone_C_ApplyDmgResistGE) == 0x000004, "Wrong alignment on BaseDestruction_Cornerstone_C_ApplyDmgResistGE");
static_assert(sizeof(BaseDestruction_Cornerstone_C_ApplyDmgResistGE) == 0x000024, "Wrong size on BaseDestruction_Cornerstone_C_ApplyDmgResistGE");
static_assert(offsetof(BaseDestruction_Cornerstone_C_ApplyDmgResistGE, CallFunc_HasAuthority_ReturnValue) == 0x000000, "Member 'BaseDestruction_Cornerstone_C_ApplyDmgResistGE::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_ApplyDmgResistGE, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000004, "Member 'BaseDestruction_Cornerstone_C_ApplyDmgResistGE::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_ApplyDmgResistGE, CallFunc_MakeOutgoingSpec_ReturnValue) == 0x000008, "Member 'BaseDestruction_Cornerstone_C_ApplyDmgResistGE::CallFunc_MakeOutgoingSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_ApplyDmgResistGE, CallFunc_AssignSetByCallerMagnitude_ReturnValue) == 0x000014, "Member 'BaseDestruction_Cornerstone_C_ApplyDmgResistGE::CallFunc_AssignSetByCallerMagnitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_ApplyDmgResistGE, CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue) == 0x000020, "Member 'BaseDestruction_Cornerstone_C_ApplyDmgResistGE::CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue' has a wrong offset!");

// Function BaseDestruction_Cornerstone.BaseDestruction_Cornerstone_C.RemoveDmgResistGE
// 0x000C (0x000C - 0x0000)
struct BaseDestruction_Cornerstone_C_RemoveDmgResistGE final
{
public:
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RemoveActiveGameplayEffect_ReturnValue;   // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BaseDestruction_Cornerstone_C_RemoveDmgResistGE) == 0x000004, "Wrong alignment on BaseDestruction_Cornerstone_C_RemoveDmgResistGE");
static_assert(sizeof(BaseDestruction_Cornerstone_C_RemoveDmgResistGE) == 0x00000C, "Wrong size on BaseDestruction_Cornerstone_C_RemoveDmgResistGE");
static_assert(offsetof(BaseDestruction_Cornerstone_C_RemoveDmgResistGE, CallFunc_HasAuthority_ReturnValue) == 0x000000, "Member 'BaseDestruction_Cornerstone_C_RemoveDmgResistGE::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_RemoveDmgResistGE, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000004, "Member 'BaseDestruction_Cornerstone_C_RemoveDmgResistGE::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseDestruction_Cornerstone_C_RemoveDmgResistGE, CallFunc_RemoveActiveGameplayEffect_ReturnValue) == 0x000008, "Member 'BaseDestruction_Cornerstone_C_RemoveDmgResistGE::CallFunc_RemoveActiveGameplayEffect_ReturnValue' has a wrong offset!");

// Function BaseDestruction_Cornerstone.BaseDestruction_Cornerstone_C.UseDefaultHealthBar
// 0x0001 (0x0001 - 0x0000)
struct BaseDestruction_Cornerstone_C_UseDefaultHealthBar final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BaseDestruction_Cornerstone_C_UseDefaultHealthBar) == 0x000001, "Wrong alignment on BaseDestruction_Cornerstone_C_UseDefaultHealthBar");
static_assert(sizeof(BaseDestruction_Cornerstone_C_UseDefaultHealthBar) == 0x000001, "Wrong size on BaseDestruction_Cornerstone_C_UseDefaultHealthBar");
static_assert(offsetof(BaseDestruction_Cornerstone_C_UseDefaultHealthBar, ReturnValue) == 0x000000, "Member 'BaseDestruction_Cornerstone_C_UseDefaultHealthBar::ReturnValue' has a wrong offset!");

}

#pragma pack(pop)
