#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BaseDestruction_Cornerstone

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass BaseDestruction_Cornerstone.BaseDestruction_Cornerstone_C
// 0x0094 (0x0618 - 0x0584)
class ABaseDestruction_Cornerstone_C final : public AFortPvPBaseCornerstone
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0584(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortMiniMapComponent*                  FortMiniMapTeams;                                  // 0x0588(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UPointLightComponent*                   PointLight;                                        // 0x058C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   Shield;                                            // 0x0590(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   Fragment;                                          // 0x0594(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UFortMiniMapComponent*                  FortMiniMap;                                       // 0x0598(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UParticleSystemComponent*               Beam;                                              // 0x059C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UBoxComponent*                          SuicideTrigger;                                    // 0x05A0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	bool                                          bShouldCauseHuskSuicide;                           // 0x05A4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A5[0x3];                                      // 0x05A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           ATLASZap_Tag;                                      // 0x05A8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UMaterialInstanceDynamic*               TeamMat;                                           // 0x05B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          MatchStarted;                                      // 0x05B4(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	uint8                                         Pad_5B5[0x3];                                      // 0x05B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               FragmentMat;                                       // 0x05B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UClass*                                 DmgResistGE;                                       // 0x05BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          DmgResistEnabled;                                  // 0x05C0(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	uint8                                         Pad_5C1[0x3];                                      // 0x05C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            DmgResistGEHandle;                                 // 0x05C4(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         DmgResistMagnitude;                                // 0x05C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class FName                                   DmgResistMagName;                                  // 0x05CC(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          DmgResistRemovedOnAISuicide;                       // 0x05D4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D5[0x3];                                      // 0x05D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  DmgResistRemovalTags;                              // 0x05D8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         DmgResistRestoreTimer;                             // 0x05F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FTimerHandle                           DmgResistRestoreTimerHandle;                       // 0x05F4(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          DmgResistFeatureEnabled;                           // 0x05F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F9[0x3];                                      // 0x05F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastDelegateProperty_                   OnDmgResistToggle;                                 // 0x05FC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UStaticMesh*                            Team0Mesh;                                         // 0x0608(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UStaticMesh*                            Team1Mesh;                                         // 0x060C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UTexture2D*                             Team0MiniMap;                                      // 0x0610(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UTexture2D*                             Team1MiniMap;                                      // 0x0614(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BaseDestruction_Cornerstone(int32 EntryPoint);
	void SetDmgResistRestoreTimer(float Time);
	void OnDeathServer(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AController* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void SetDmgResistRemovedByAI(bool RemovedByAI);
	void OnDmgResistRestore();
	void OnDamageServer(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AController* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void SetDmgResistMag(float Magnitude);
	void EnableDmgResistFeature(bool Enabled);
	void OnHandleMatch();
	void OnInvincibilityChanged(bool bIsInvincible);
	void ReceiveBeginPlay();
	void BndEvt__SuicideTrigger_K2Node_ComponentBoundEvent_45_ComponentBeginOverlapSignature__DelegateSignature(class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void OnDamagePlayEffects(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void UserConstructionScript();
	void OnRep_MatchStarted();
	void Update_Shield_State(bool NewHidden, bool bPropagateToChildren, ECollisionEnabled NewType);
	void OnRep_DmgResistActive();
	void ApplyDmgResistGE();
	void RemoveDmgResistGE();

	bool UseDefaultHealthBar() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BaseDestruction_Cornerstone_C">();
	}
	static class ABaseDestruction_Cornerstone_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABaseDestruction_Cornerstone_C>();
	}
};
static_assert(alignof(ABaseDestruction_Cornerstone_C) == 0x000004, "Wrong alignment on ABaseDestruction_Cornerstone_C");
static_assert(sizeof(ABaseDestruction_Cornerstone_C) == 0x000618, "Wrong size on ABaseDestruction_Cornerstone_C");
static_assert(offsetof(ABaseDestruction_Cornerstone_C, UberGraphFrame) == 0x000584, "Member 'ABaseDestruction_Cornerstone_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABaseDestruction_Cornerstone_C, FortMiniMapTeams) == 0x000588, "Member 'ABaseDestruction_Cornerstone_C::FortMiniMapTeams' has a wrong offset!");
static_assert(offsetof(ABaseDestruction_Cornerstone_C, PointLight) == 0x00058C, "Member 'ABaseDestruction_Cornerstone_C::PointLight' has a wrong offset!");
static_assert(offsetof(ABaseDestruction_Cornerstone_C, Shield) == 0x000590, "Member 'ABaseDestruction_Cornerstone_C::Shield' has a wrong offset!");
static_assert(offsetof(ABaseDestruction_Cornerstone_C, Fragment) == 0x000594, "Member 'ABaseDestruction_Cornerstone_C::Fragment' has a wrong offset!");
static_assert(offsetof(ABaseDestruction_Cornerstone_C, FortMiniMap) == 0x000598, "Member 'ABaseDestruction_Cornerstone_C::FortMiniMap' has a wrong offset!");
static_assert(offsetof(ABaseDestruction_Cornerstone_C, Beam) == 0x00059C, "Member 'ABaseDestruction_Cornerstone_C::Beam' has a wrong offset!");
static_assert(offsetof(ABaseDestruction_Cornerstone_C, SuicideTrigger) == 0x0005A0, "Member 'ABaseDestruction_Cornerstone_C::SuicideTrigger' has a wrong offset!");
static_assert(offsetof(ABaseDestruction_Cornerstone_C, bShouldCauseHuskSuicide) == 0x0005A4, "Member 'ABaseDestruction_Cornerstone_C::bShouldCauseHuskSuicide' has a wrong offset!");
static_assert(offsetof(ABaseDestruction_Cornerstone_C, ATLASZap_Tag) == 0x0005A8, "Member 'ABaseDestruction_Cornerstone_C::ATLASZap_Tag' has a wrong offset!");
static_assert(offsetof(ABaseDestruction_Cornerstone_C, TeamMat) == 0x0005B0, "Member 'ABaseDestruction_Cornerstone_C::TeamMat' has a wrong offset!");
static_assert(offsetof(ABaseDestruction_Cornerstone_C, MatchStarted) == 0x0005B4, "Member 'ABaseDestruction_Cornerstone_C::MatchStarted' has a wrong offset!");
static_assert(offsetof(ABaseDestruction_Cornerstone_C, FragmentMat) == 0x0005B8, "Member 'ABaseDestruction_Cornerstone_C::FragmentMat' has a wrong offset!");
static_assert(offsetof(ABaseDestruction_Cornerstone_C, DmgResistGE) == 0x0005BC, "Member 'ABaseDestruction_Cornerstone_C::DmgResistGE' has a wrong offset!");
static_assert(offsetof(ABaseDestruction_Cornerstone_C, DmgResistEnabled) == 0x0005C0, "Member 'ABaseDestruction_Cornerstone_C::DmgResistEnabled' has a wrong offset!");
static_assert(offsetof(ABaseDestruction_Cornerstone_C, DmgResistGEHandle) == 0x0005C4, "Member 'ABaseDestruction_Cornerstone_C::DmgResistGEHandle' has a wrong offset!");
static_assert(offsetof(ABaseDestruction_Cornerstone_C, DmgResistMagnitude) == 0x0005C8, "Member 'ABaseDestruction_Cornerstone_C::DmgResistMagnitude' has a wrong offset!");
static_assert(offsetof(ABaseDestruction_Cornerstone_C, DmgResistMagName) == 0x0005CC, "Member 'ABaseDestruction_Cornerstone_C::DmgResistMagName' has a wrong offset!");
static_assert(offsetof(ABaseDestruction_Cornerstone_C, DmgResistRemovedOnAISuicide) == 0x0005D4, "Member 'ABaseDestruction_Cornerstone_C::DmgResistRemovedOnAISuicide' has a wrong offset!");
static_assert(offsetof(ABaseDestruction_Cornerstone_C, DmgResistRemovalTags) == 0x0005D8, "Member 'ABaseDestruction_Cornerstone_C::DmgResistRemovalTags' has a wrong offset!");
static_assert(offsetof(ABaseDestruction_Cornerstone_C, DmgResistRestoreTimer) == 0x0005F0, "Member 'ABaseDestruction_Cornerstone_C::DmgResistRestoreTimer' has a wrong offset!");
static_assert(offsetof(ABaseDestruction_Cornerstone_C, DmgResistRestoreTimerHandle) == 0x0005F4, "Member 'ABaseDestruction_Cornerstone_C::DmgResistRestoreTimerHandle' has a wrong offset!");
static_assert(offsetof(ABaseDestruction_Cornerstone_C, DmgResistFeatureEnabled) == 0x0005F8, "Member 'ABaseDestruction_Cornerstone_C::DmgResistFeatureEnabled' has a wrong offset!");
static_assert(offsetof(ABaseDestruction_Cornerstone_C, OnDmgResistToggle) == 0x0005FC, "Member 'ABaseDestruction_Cornerstone_C::OnDmgResistToggle' has a wrong offset!");
static_assert(offsetof(ABaseDestruction_Cornerstone_C, Team0Mesh) == 0x000608, "Member 'ABaseDestruction_Cornerstone_C::Team0Mesh' has a wrong offset!");
static_assert(offsetof(ABaseDestruction_Cornerstone_C, Team1Mesh) == 0x00060C, "Member 'ABaseDestruction_Cornerstone_C::Team1Mesh' has a wrong offset!");
static_assert(offsetof(ABaseDestruction_Cornerstone_C, Team0MiniMap) == 0x000610, "Member 'ABaseDestruction_Cornerstone_C::Team0MiniMap' has a wrong offset!");
static_assert(offsetof(ABaseDestruction_Cornerstone_C, Team1MiniMap) == 0x000614, "Member 'ABaseDestruction_Cornerstone_C::Team1MiniMap' has a wrong offset!");

}

#pragma pack(pop)
