#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BluGlo_Node

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass BluGlo_Node.BluGlo_Node_C
// 0x0048 (0x098C - 0x0944)
class ABluGlo_Node_C final : public ABuildingProp
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0944(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        Fort_BluGlo_loop_AudioComponent;                   // 0x0948(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UFortMiniMapComponent*                  FortMiniMap;                                       // 0x094C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UParticleSystemComponent*               BluGloSpawnparticle;                               // 0x0950(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	float                                         Trail_HorizontalMovement_EEEFB2FD467DE31D5FDEDEA006F5C10F; // 0x0954(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         Trail_VerticalMovement_EEEFB2FD467DE31D5FDEDEA006F5C10F; // 0x0958(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ETimelineDirection                            Trail__Direction_EEEFB2FD467DE31D5FDEDEA006F5C10F; // 0x095C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95D[0x3];                                      // 0x095D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Trail;                                             // 0x0960(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ActivateEffects;                                   // 0x0964(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	bool                                          DeActivateEffects;                                 // 0x0965(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	bool                                          CanInteract;                                       // 0x0966(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	uint8                                         Pad_967[0x1];                                      // 0x0967(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   BluGloQuantity;                                    // 0x0968(0x000C)(Edit, BlueprintVisible, Net, DisableEditOnInstance)
	class AFortPawn*                              NewVar;                                            // 0x0974(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                StartLocation;                                     // 0x0978(0x000C)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UParticleSystemComponent*               TrailEffect;                                       // 0x0984(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class USoundBase*                             Sound_BluGloLoop;                                  // 0x0988(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BluGlo_Node(int32 EntryPoint);
	void ShowSpawnTrail(const struct FVector& StartLocation_0, float AnimDelay);
	void HandleMissionEvent_LocateBluGlo(const struct FGuid& MissionGuid, const struct FGameplayTagContainer& ObjectiveHandle, class UFortMissionEventParams* Params_0, bool DO_NOT_USE_THIS_OR_VARIABLES_BELOW, class UObject* EventFocus, const class UDataAsset* EventContent, class AActor* EventInstigator, int32 GenericInt, float GenericFloat, const class FText& GenericText, const struct FGameplayTagContainer& GameplayTags, const struct FFortMissionEvent& MissionEvent);
	void BlueprintOnInteract(const class AFortPawn* InteractingPawn);
	void ReceiveBeginPlay();
	void BlueprintHandleMissionEventNoReply(const struct FFortMissionEvent& MissionEvent);
	void Trail__UpdateFunc();
	void Trail__FinishedFunc();
	void UserConstructionScript();
	void OnRep_ActivateEffects();
	void OnRep_DeActivateEffects();
	void OnRep_CanInteract();

	bool BlueprintCanInteract(const class AFortPawn* InteractingPawn) const;
	class FText BlueprintGetInteractionString(const class AFortPawn* InteractingPawn) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BluGlo_Node_C">();
	}
	static class ABluGlo_Node_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABluGlo_Node_C>();
	}
};
static_assert(alignof(ABluGlo_Node_C) == 0x000004, "Wrong alignment on ABluGlo_Node_C");
static_assert(sizeof(ABluGlo_Node_C) == 0x00098C, "Wrong size on ABluGlo_Node_C");
static_assert(offsetof(ABluGlo_Node_C, UberGraphFrame) == 0x000944, "Member 'ABluGlo_Node_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABluGlo_Node_C, Fort_BluGlo_loop_AudioComponent) == 0x000948, "Member 'ABluGlo_Node_C::Fort_BluGlo_loop_AudioComponent' has a wrong offset!");
static_assert(offsetof(ABluGlo_Node_C, FortMiniMap) == 0x00094C, "Member 'ABluGlo_Node_C::FortMiniMap' has a wrong offset!");
static_assert(offsetof(ABluGlo_Node_C, BluGloSpawnparticle) == 0x000950, "Member 'ABluGlo_Node_C::BluGloSpawnparticle' has a wrong offset!");
static_assert(offsetof(ABluGlo_Node_C, Trail_HorizontalMovement_EEEFB2FD467DE31D5FDEDEA006F5C10F) == 0x000954, "Member 'ABluGlo_Node_C::Trail_HorizontalMovement_EEEFB2FD467DE31D5FDEDEA006F5C10F' has a wrong offset!");
static_assert(offsetof(ABluGlo_Node_C, Trail_VerticalMovement_EEEFB2FD467DE31D5FDEDEA006F5C10F) == 0x000958, "Member 'ABluGlo_Node_C::Trail_VerticalMovement_EEEFB2FD467DE31D5FDEDEA006F5C10F' has a wrong offset!");
static_assert(offsetof(ABluGlo_Node_C, Trail__Direction_EEEFB2FD467DE31D5FDEDEA006F5C10F) == 0x00095C, "Member 'ABluGlo_Node_C::Trail__Direction_EEEFB2FD467DE31D5FDEDEA006F5C10F' has a wrong offset!");
static_assert(offsetof(ABluGlo_Node_C, Trail) == 0x000960, "Member 'ABluGlo_Node_C::Trail' has a wrong offset!");
static_assert(offsetof(ABluGlo_Node_C, ActivateEffects) == 0x000964, "Member 'ABluGlo_Node_C::ActivateEffects' has a wrong offset!");
static_assert(offsetof(ABluGlo_Node_C, DeActivateEffects) == 0x000965, "Member 'ABluGlo_Node_C::DeActivateEffects' has a wrong offset!");
static_assert(offsetof(ABluGlo_Node_C, CanInteract) == 0x000966, "Member 'ABluGlo_Node_C::CanInteract' has a wrong offset!");
static_assert(offsetof(ABluGlo_Node_C, BluGloQuantity) == 0x000968, "Member 'ABluGlo_Node_C::BluGloQuantity' has a wrong offset!");
static_assert(offsetof(ABluGlo_Node_C, NewVar) == 0x000974, "Member 'ABluGlo_Node_C::NewVar' has a wrong offset!");
static_assert(offsetof(ABluGlo_Node_C, StartLocation) == 0x000978, "Member 'ABluGlo_Node_C::StartLocation' has a wrong offset!");
static_assert(offsetof(ABluGlo_Node_C, TrailEffect) == 0x000984, "Member 'ABluGlo_Node_C::TrailEffect' has a wrong offset!");
static_assert(offsetof(ABluGlo_Node_C, Sound_BluGloLoop) == 0x000988, "Member 'ABluGlo_Node_C::Sound_BluGloLoop' has a wrong offset!");

}

#pragma pack(pop)
