#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BluGloManager

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AIModule_structs.hpp"
#include "FortniteGame_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass BluGloManager.BluGloManager_C
// 0x0050 (0x0308 - 0x02B8)
class ABluGloManager_C final : public AFortBluGloManager
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B8(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02BC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	TArray<class ATiered_BluGlo_Parent_C*>        BluGlo_PlacedLocator;                              // 0x02C0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<class ATiered_BluGlo_Parent_C*>        PossibleSpawnLocationsArray;                       // 0x02CC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<class ATiered_BluGlo_Parent_C*>        OccupiedNodes;                                     // 0x02D8(0x000C)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance)
	int32                                         AmountOfBluGloToSpawn;                             // 0x02E4(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	int32                                         NumberOfSpawnLocations;                            // 0x02E8(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         ExpectedCompletionTime;                            // 0x02EC(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                EQSLocation;                                       // 0x02F0(0x000C)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class AActor*                                 QueryActor;                                        // 0x02FC(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          OnestRequestArraySet;                              // 0x0300(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_301[0x3];                                      // 0x0301(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BluGloNavigablePointRadius;                        // 0x0304(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BluGloManager(int32 EntryPoint);
	void StopSpawnFX(bool off);
	void HandleMissionEvent_RequestBluGloSpawnUseEQS(const struct FGuid& MissionGuid, const struct FGameplayTagContainer& ObjectiveHandle, class UFortMissionEventParams* Params_0, bool DO_NOT_USE_THIS_OR_VARIABLES_BELOW, class UObject* EventFocus, const class UDataAsset* EventContent, class AActor* EventInstigator, int32 GenericInt, float GenericFloat, const class FText& GenericText, const struct FGameplayTagContainer& GameplayTags, const struct FFortMissionEvent& MissionEvent);
	void EQSQueryFinished(class UEnvQueryInstanceBlueprintWrapper* QueryInstance, EEnvQueryStatus QueryStatus);
	void HandleMissionEvent_RequestBluGloSpawnUseActor(const struct FGuid& MissionGuid, const struct FGameplayTagContainer& ObjectiveHandle, class UFortMissionEventParams* Params_0, bool DO_NOT_USE_THIS_OR_VARIABLES_BELOW, class UObject* EventFocus, const class UDataAsset* EventContent, class AActor* EventInstigator, int32 GenericInt, float GenericFloat, const class FText& GenericText, const struct FGameplayTagContainer& GameplayTags, const struct FFortMissionEvent& MissionEvent);
	void BlueprintHandleMissionEventNoReply(const struct FFortMissionEvent& MissionEvent);
	void UserConstructionScript();
	void RequestedBluGo(class AFortMission* Mission, const struct FVector& EQS_Start_Location, class AActor* Actor);
	void RemoveOccupiedNodes();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BluGloManager_C">();
	}
	static class ABluGloManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABluGloManager_C>();
	}
};
static_assert(alignof(ABluGloManager_C) == 0x000004, "Wrong alignment on ABluGloManager_C");
static_assert(sizeof(ABluGloManager_C) == 0x000308, "Wrong size on ABluGloManager_C");
static_assert(offsetof(ABluGloManager_C, UberGraphFrame) == 0x0002B8, "Member 'ABluGloManager_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABluGloManager_C, DefaultSceneRoot) == 0x0002BC, "Member 'ABluGloManager_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABluGloManager_C, BluGlo_PlacedLocator) == 0x0002C0, "Member 'ABluGloManager_C::BluGlo_PlacedLocator' has a wrong offset!");
static_assert(offsetof(ABluGloManager_C, PossibleSpawnLocationsArray) == 0x0002CC, "Member 'ABluGloManager_C::PossibleSpawnLocationsArray' has a wrong offset!");
static_assert(offsetof(ABluGloManager_C, OccupiedNodes) == 0x0002D8, "Member 'ABluGloManager_C::OccupiedNodes' has a wrong offset!");
static_assert(offsetof(ABluGloManager_C, AmountOfBluGloToSpawn) == 0x0002E4, "Member 'ABluGloManager_C::AmountOfBluGloToSpawn' has a wrong offset!");
static_assert(offsetof(ABluGloManager_C, NumberOfSpawnLocations) == 0x0002E8, "Member 'ABluGloManager_C::NumberOfSpawnLocations' has a wrong offset!");
static_assert(offsetof(ABluGloManager_C, ExpectedCompletionTime) == 0x0002EC, "Member 'ABluGloManager_C::ExpectedCompletionTime' has a wrong offset!");
static_assert(offsetof(ABluGloManager_C, EQSLocation) == 0x0002F0, "Member 'ABluGloManager_C::EQSLocation' has a wrong offset!");
static_assert(offsetof(ABluGloManager_C, QueryActor) == 0x0002FC, "Member 'ABluGloManager_C::QueryActor' has a wrong offset!");
static_assert(offsetof(ABluGloManager_C, OnestRequestArraySet) == 0x000300, "Member 'ABluGloManager_C::OnestRequestArraySet' has a wrong offset!");
static_assert(offsetof(ABluGloManager_C, BluGloNavigablePointRadius) == 0x000304, "Member 'ABluGloManager_C::BluGloNavigablePointRadius' has a wrong offset!");

}

#pragma pack(pop)
