#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BluGlo_Node

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function BluGlo_Node.BluGlo_Node_C.ExecuteUbergraph_BluGlo_Node
// 0x0290 (0x0290 - 0x0000)
struct BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortMissionEvent                      K2Node_Event_MissionEvent;                         // 0x0014(0x006C)(ConstParm)
	const class AFortPawn*                        K2Node_Event_InteractingPawn;                      // 0x0080(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller;       // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortBluGloManager*                     CallFunc_GetBluGloManager_ReturnValue;             // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGuid                                  CallFunc_GetMissionGuid_ReturnValue;               // 0x0094(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGuid                                  K2Node_HandleMissionEvent_MissionGuid;             // 0x00A4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  K2Node_HandleMissionEvent_ObjectiveHandle;         // 0x00B4(0x0018)()
	class UFortMissionEventParams*                K2Node_HandleMissionEvent_Params;                  // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_HandleMissionEvent_DO_NOT_USE_THIS_OR_VARIABLES_BELOW; // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_HandleMissionEvent_EventFocus;              // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	const class UDataAsset*                       K2Node_HandleMissionEvent_EventContent;            // 0x00D8(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_HandleMissionEvent_EventInstigator;         // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         K2Node_HandleMissionEvent_GenericInt;              // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_HandleMissionEvent_GenericFloat;            // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FText                                   K2Node_HandleMissionEvent_GenericText;             // 0x00E8(0x000C)(ConstParm)
	struct FGameplayTagContainer                  K2Node_HandleMissionEvent_GameplayTags;            // 0x00F4(0x0018)()
	struct FFortMissionEvent                      K2Node_HandleMissionEvent_MissionEvent;            // 0x010C(0x006C)(ConstParm)
	class AFortMission*                           CallFunc_GetMissionFromGuid_ReturnValue;           // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                K2Node_CustomEvent_StartLocation;                  // 0x017C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_CustomEvent_AnimDelay;                      // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UStaticMeshComponent*                   CallFunc_GetBuildingMeshComponent_ReturnValue;     // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UStaticMeshComponent*                   CallFunc_GetBuildingMeshComponent_ReturnValue2;    // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue2;     // 0x0194(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x01A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue3;     // 0x01AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X;                            // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Y;                            // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Z;                            // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x01C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x01D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X2;                           // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Y2;                           // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Z2;                           // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_MapRangeUnclamped_ReturnValue;            // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue2;         // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue2;                  // 0x0204(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0210(0x0080)(ContainsInstancedReference)
};
static_assert(alignof(BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node) == 0x000004, "Wrong alignment on BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node");
static_assert(sizeof(BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node) == 0x000290, "Wrong size on BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node");
static_assert(offsetof(BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node, EntryPoint) == 0x000000, "Member 'BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node::EntryPoint' has a wrong offset!");
static_assert(offsetof(BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000004, "Member 'BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node, CallFunc_HasAuthority_ReturnValue) == 0x000010, "Member 'BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node, K2Node_Event_MissionEvent) == 0x000014, "Member 'BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node::K2Node_Event_MissionEvent' has a wrong offset!");
static_assert(offsetof(BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node, K2Node_Event_InteractingPawn) == 0x000080, "Member 'BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node::K2Node_Event_InteractingPawn' has a wrong offset!");
static_assert(offsetof(BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node, CallFunc_GetController_ReturnValue) == 0x000084, "Member 'BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node, K2Node_DynamicCast_AsFort_Player_Controller) == 0x000088, "Member 'BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node::K2Node_DynamicCast_AsFort_Player_Controller' has a wrong offset!");
static_assert(offsetof(BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node, K2Node_DynamicCast_bSuccess) == 0x00008C, "Member 'BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node, CallFunc_GetBluGloManager_ReturnValue) == 0x000090, "Member 'BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node::CallFunc_GetBluGloManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node, CallFunc_GetMissionGuid_ReturnValue) == 0x000094, "Member 'BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node::CallFunc_GetMissionGuid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node, K2Node_HandleMissionEvent_MissionGuid) == 0x0000A4, "Member 'BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node::K2Node_HandleMissionEvent_MissionGuid' has a wrong offset!");
static_assert(offsetof(BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node, K2Node_HandleMissionEvent_ObjectiveHandle) == 0x0000B4, "Member 'BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node::K2Node_HandleMissionEvent_ObjectiveHandle' has a wrong offset!");
static_assert(offsetof(BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node, K2Node_HandleMissionEvent_Params) == 0x0000CC, "Member 'BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node::K2Node_HandleMissionEvent_Params' has a wrong offset!");
static_assert(offsetof(BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node, K2Node_HandleMissionEvent_DO_NOT_USE_THIS_OR_VARIABLES_BELOW) == 0x0000D0, "Member 'BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node::K2Node_HandleMissionEvent_DO_NOT_USE_THIS_OR_VARIABLES_BELOW' has a wrong offset!");
static_assert(offsetof(BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node, K2Node_HandleMissionEvent_EventFocus) == 0x0000D4, "Member 'BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node::K2Node_HandleMissionEvent_EventFocus' has a wrong offset!");
static_assert(offsetof(BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node, K2Node_HandleMissionEvent_EventContent) == 0x0000D8, "Member 'BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node::K2Node_HandleMissionEvent_EventContent' has a wrong offset!");
static_assert(offsetof(BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node, K2Node_HandleMissionEvent_EventInstigator) == 0x0000DC, "Member 'BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node::K2Node_HandleMissionEvent_EventInstigator' has a wrong offset!");
static_assert(offsetof(BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node, K2Node_HandleMissionEvent_GenericInt) == 0x0000E0, "Member 'BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node::K2Node_HandleMissionEvent_GenericInt' has a wrong offset!");
static_assert(offsetof(BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node, K2Node_HandleMissionEvent_GenericFloat) == 0x0000E4, "Member 'BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node::K2Node_HandleMissionEvent_GenericFloat' has a wrong offset!");
static_assert(offsetof(BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node, K2Node_HandleMissionEvent_GenericText) == 0x0000E8, "Member 'BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node::K2Node_HandleMissionEvent_GenericText' has a wrong offset!");
static_assert(offsetof(BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node, K2Node_HandleMissionEvent_GameplayTags) == 0x0000F4, "Member 'BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node::K2Node_HandleMissionEvent_GameplayTags' has a wrong offset!");
static_assert(offsetof(BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node, K2Node_HandleMissionEvent_MissionEvent) == 0x00010C, "Member 'BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node::K2Node_HandleMissionEvent_MissionEvent' has a wrong offset!");
static_assert(offsetof(BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node, CallFunc_GetMissionFromGuid_ReturnValue) == 0x000178, "Member 'BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node::CallFunc_GetMissionFromGuid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node, K2Node_CustomEvent_StartLocation) == 0x00017C, "Member 'BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node::K2Node_CustomEvent_StartLocation' has a wrong offset!");
static_assert(offsetof(BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node, K2Node_CustomEvent_AnimDelay) == 0x000188, "Member 'BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node::K2Node_CustomEvent_AnimDelay' has a wrong offset!");
static_assert(offsetof(BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node, CallFunc_GetBuildingMeshComponent_ReturnValue) == 0x00018C, "Member 'BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node::CallFunc_GetBuildingMeshComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node, CallFunc_GetBuildingMeshComponent_ReturnValue2) == 0x000190, "Member 'BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node::CallFunc_GetBuildingMeshComponent_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node, CallFunc_K2_GetComponentLocation_ReturnValue2) == 0x000194, "Member 'BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node::CallFunc_K2_GetComponentLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0001A0, "Member 'BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node, CallFunc_K2_GetComponentLocation_ReturnValue3) == 0x0001AC, "Member 'BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node::CallFunc_K2_GetComponentLocation_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node, CallFunc_BreakVector_X) == 0x0001B8, "Member 'BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node, CallFunc_BreakVector_Y) == 0x0001BC, "Member 'BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node, CallFunc_BreakVector_Z) == 0x0001C0, "Member 'BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node, CallFunc_VLerp_ReturnValue) == 0x0001C4, "Member 'BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node, CallFunc_MakeVector_ReturnValue) == 0x0001D0, "Member 'BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node, CallFunc_BreakVector_X2) == 0x0001DC, "Member 'BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node::CallFunc_BreakVector_X2' has a wrong offset!");
static_assert(offsetof(BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node, CallFunc_BreakVector_Y2) == 0x0001E0, "Member 'BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node::CallFunc_BreakVector_Y2' has a wrong offset!");
static_assert(offsetof(BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node, CallFunc_BreakVector_Z2) == 0x0001E4, "Member 'BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node::CallFunc_BreakVector_Z2' has a wrong offset!");
static_assert(offsetof(BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node, CallFunc_VSize_ReturnValue) == 0x0001E8, "Member 'BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x0001EC, "Member 'BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0001F0, "Member 'BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node, CallFunc_MapRangeUnclamped_ReturnValue) == 0x0001F4, "Member 'BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node::CallFunc_MapRangeUnclamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node, CallFunc_FClamp_ReturnValue) == 0x0001F8, "Member 'BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node, CallFunc_Multiply_FloatFloat_ReturnValue2) == 0x0001FC, "Member 'BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node::CallFunc_Multiply_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node, CallFunc_Add_FloatFloat_ReturnValue) == 0x000200, "Member 'BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node, CallFunc_MakeVector_ReturnValue2) == 0x000204, "Member 'BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node::CallFunc_MakeVector_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000210, "Member 'BluGlo_Node_C_ExecuteUbergraph_BluGlo_Node::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");

// Function BluGlo_Node.BluGlo_Node_C.ShowSpawnTrail
// 0x0010 (0x0010 - 0x0000)
struct BluGlo_Node_C_ShowSpawnTrail final
{
public:
	struct FVector                                StartLocation_0;                                   // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         AnimDelay;                                         // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BluGlo_Node_C_ShowSpawnTrail) == 0x000004, "Wrong alignment on BluGlo_Node_C_ShowSpawnTrail");
static_assert(sizeof(BluGlo_Node_C_ShowSpawnTrail) == 0x000010, "Wrong size on BluGlo_Node_C_ShowSpawnTrail");
static_assert(offsetof(BluGlo_Node_C_ShowSpawnTrail, StartLocation_0) == 0x000000, "Member 'BluGlo_Node_C_ShowSpawnTrail::StartLocation_0' has a wrong offset!");
static_assert(offsetof(BluGlo_Node_C_ShowSpawnTrail, AnimDelay) == 0x00000C, "Member 'BluGlo_Node_C_ShowSpawnTrail::AnimDelay' has a wrong offset!");

// Function BluGlo_Node.BluGlo_Node_C.HandleMissionEvent_LocateBluGlo
// 0x00D4 (0x00D4 - 0x0000)
struct BluGlo_Node_C_HandleMissionEvent_LocateBluGlo final
{
public:
	struct FGuid                                  MissionGuid;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  ObjectiveHandle;                                   // 0x0010(0x0018)(Parm)
	class UFortMissionEventParams*                Params_0;                                          // 0x0028(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          DO_NOT_USE_THIS_OR_VARIABLES_BELOW;                // 0x002C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                EventFocus;                                        // 0x0030(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	const class UDataAsset*                       EventContent;                                      // 0x0034(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 EventInstigator;                                   // 0x0038(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         GenericInt;                                        // 0x003C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         GenericFloat;                                      // 0x0040(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class FText                                   GenericText;                                       // 0x0044(0x000C)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FGameplayTagContainer                  GameplayTags;                                      // 0x0050(0x0018)(Parm)
	struct FFortMissionEvent                      MissionEvent;                                      // 0x0068(0x006C)(ConstParm, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BluGlo_Node_C_HandleMissionEvent_LocateBluGlo) == 0x000004, "Wrong alignment on BluGlo_Node_C_HandleMissionEvent_LocateBluGlo");
static_assert(sizeof(BluGlo_Node_C_HandleMissionEvent_LocateBluGlo) == 0x0000D4, "Wrong size on BluGlo_Node_C_HandleMissionEvent_LocateBluGlo");
static_assert(offsetof(BluGlo_Node_C_HandleMissionEvent_LocateBluGlo, MissionGuid) == 0x000000, "Member 'BluGlo_Node_C_HandleMissionEvent_LocateBluGlo::MissionGuid' has a wrong offset!");
static_assert(offsetof(BluGlo_Node_C_HandleMissionEvent_LocateBluGlo, ObjectiveHandle) == 0x000010, "Member 'BluGlo_Node_C_HandleMissionEvent_LocateBluGlo::ObjectiveHandle' has a wrong offset!");
static_assert(offsetof(BluGlo_Node_C_HandleMissionEvent_LocateBluGlo, Params_0) == 0x000028, "Member 'BluGlo_Node_C_HandleMissionEvent_LocateBluGlo::Params_0' has a wrong offset!");
static_assert(offsetof(BluGlo_Node_C_HandleMissionEvent_LocateBluGlo, DO_NOT_USE_THIS_OR_VARIABLES_BELOW) == 0x00002C, "Member 'BluGlo_Node_C_HandleMissionEvent_LocateBluGlo::DO_NOT_USE_THIS_OR_VARIABLES_BELOW' has a wrong offset!");
static_assert(offsetof(BluGlo_Node_C_HandleMissionEvent_LocateBluGlo, EventFocus) == 0x000030, "Member 'BluGlo_Node_C_HandleMissionEvent_LocateBluGlo::EventFocus' has a wrong offset!");
static_assert(offsetof(BluGlo_Node_C_HandleMissionEvent_LocateBluGlo, EventContent) == 0x000034, "Member 'BluGlo_Node_C_HandleMissionEvent_LocateBluGlo::EventContent' has a wrong offset!");
static_assert(offsetof(BluGlo_Node_C_HandleMissionEvent_LocateBluGlo, EventInstigator) == 0x000038, "Member 'BluGlo_Node_C_HandleMissionEvent_LocateBluGlo::EventInstigator' has a wrong offset!");
static_assert(offsetof(BluGlo_Node_C_HandleMissionEvent_LocateBluGlo, GenericInt) == 0x00003C, "Member 'BluGlo_Node_C_HandleMissionEvent_LocateBluGlo::GenericInt' has a wrong offset!");
static_assert(offsetof(BluGlo_Node_C_HandleMissionEvent_LocateBluGlo, GenericFloat) == 0x000040, "Member 'BluGlo_Node_C_HandleMissionEvent_LocateBluGlo::GenericFloat' has a wrong offset!");
static_assert(offsetof(BluGlo_Node_C_HandleMissionEvent_LocateBluGlo, GenericText) == 0x000044, "Member 'BluGlo_Node_C_HandleMissionEvent_LocateBluGlo::GenericText' has a wrong offset!");
static_assert(offsetof(BluGlo_Node_C_HandleMissionEvent_LocateBluGlo, GameplayTags) == 0x000050, "Member 'BluGlo_Node_C_HandleMissionEvent_LocateBluGlo::GameplayTags' has a wrong offset!");
static_assert(offsetof(BluGlo_Node_C_HandleMissionEvent_LocateBluGlo, MissionEvent) == 0x000068, "Member 'BluGlo_Node_C_HandleMissionEvent_LocateBluGlo::MissionEvent' has a wrong offset!");

// Function BluGlo_Node.BluGlo_Node_C.BlueprintOnInteract
// 0x0004 (0x0004 - 0x0000)
struct BluGlo_Node_C_BlueprintOnInteract final
{
public:
	const class AFortPawn*                        InteractingPawn;                                   // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BluGlo_Node_C_BlueprintOnInteract) == 0x000004, "Wrong alignment on BluGlo_Node_C_BlueprintOnInteract");
static_assert(sizeof(BluGlo_Node_C_BlueprintOnInteract) == 0x000004, "Wrong size on BluGlo_Node_C_BlueprintOnInteract");
static_assert(offsetof(BluGlo_Node_C_BlueprintOnInteract, InteractingPawn) == 0x000000, "Member 'BluGlo_Node_C_BlueprintOnInteract::InteractingPawn' has a wrong offset!");

// Function BluGlo_Node.BluGlo_Node_C.BlueprintHandleMissionEventNoReply
// 0x006C (0x006C - 0x0000)
struct BluGlo_Node_C_BlueprintHandleMissionEventNoReply final
{
public:
	struct FFortMissionEvent                      MissionEvent;                                      // 0x0000(0x006C)(ConstParm, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BluGlo_Node_C_BlueprintHandleMissionEventNoReply) == 0x000004, "Wrong alignment on BluGlo_Node_C_BlueprintHandleMissionEventNoReply");
static_assert(sizeof(BluGlo_Node_C_BlueprintHandleMissionEventNoReply) == 0x00006C, "Wrong size on BluGlo_Node_C_BlueprintHandleMissionEventNoReply");
static_assert(offsetof(BluGlo_Node_C_BlueprintHandleMissionEventNoReply, MissionEvent) == 0x000000, "Member 'BluGlo_Node_C_BlueprintHandleMissionEventNoReply::MissionEvent' has a wrong offset!");

// Function BluGlo_Node.BluGlo_Node_C.OnRep_DeActivateEffects
// 0x0010 (0x0010 - 0x0000)
struct BluGlo_Node_C_OnRep_DeActivateEffects final
{
public:
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BluGlo_Node_C_OnRep_DeActivateEffects) == 0x000004, "Wrong alignment on BluGlo_Node_C_OnRep_DeActivateEffects");
static_assert(sizeof(BluGlo_Node_C_OnRep_DeActivateEffects) == 0x000010, "Wrong size on BluGlo_Node_C_OnRep_DeActivateEffects");
static_assert(offsetof(BluGlo_Node_C_OnRep_DeActivateEffects, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000000, "Member 'BluGlo_Node_C_OnRep_DeActivateEffects::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BluGlo_Node_C_OnRep_DeActivateEffects, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x00000C, "Member 'BluGlo_Node_C_OnRep_DeActivateEffects::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");

// Function BluGlo_Node.BluGlo_Node_C.BlueprintCanInteract
// 0x0008 (0x0008 - 0x0000)
struct BluGlo_Node_C_BlueprintCanInteract final
{
public:
	const class AFortPawn*                        InteractingPawn;                                   // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BluGlo_Node_C_BlueprintCanInteract) == 0x000004, "Wrong alignment on BluGlo_Node_C_BlueprintCanInteract");
static_assert(sizeof(BluGlo_Node_C_BlueprintCanInteract) == 0x000008, "Wrong size on BluGlo_Node_C_BlueprintCanInteract");
static_assert(offsetof(BluGlo_Node_C_BlueprintCanInteract, InteractingPawn) == 0x000000, "Member 'BluGlo_Node_C_BlueprintCanInteract::InteractingPawn' has a wrong offset!");
static_assert(offsetof(BluGlo_Node_C_BlueprintCanInteract, ReturnValue) == 0x000004, "Member 'BluGlo_Node_C_BlueprintCanInteract::ReturnValue' has a wrong offset!");

// Function BluGlo_Node.BluGlo_Node_C.BlueprintGetInteractionString
// 0x0040 (0x0040 - 0x0000)
struct BluGlo_Node_C_BlueprintGetInteractionString final
{
public:
	const class AFortPawn*                        InteractingPawn;                                   // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class FText                                   ReturnValue;                                       // 0x0004(0x000C)(Parm, OutParm, ReturnParm)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0010(0x000C)(ZeroConstructor)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x001C(0x000C)(ZeroConstructor)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue2;               // 0x0028(0x000C)(ZeroConstructor)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0034(0x000C)()
};
static_assert(alignof(BluGlo_Node_C_BlueprintGetInteractionString) == 0x000004, "Wrong alignment on BluGlo_Node_C_BlueprintGetInteractionString");
static_assert(sizeof(BluGlo_Node_C_BlueprintGetInteractionString) == 0x000040, "Wrong size on BluGlo_Node_C_BlueprintGetInteractionString");
static_assert(offsetof(BluGlo_Node_C_BlueprintGetInteractionString, InteractingPawn) == 0x000000, "Member 'BluGlo_Node_C_BlueprintGetInteractionString::InteractingPawn' has a wrong offset!");
static_assert(offsetof(BluGlo_Node_C_BlueprintGetInteractionString, ReturnValue) == 0x000004, "Member 'BluGlo_Node_C_BlueprintGetInteractionString::ReturnValue' has a wrong offset!");
static_assert(offsetof(BluGlo_Node_C_BlueprintGetInteractionString, CallFunc_Conv_TextToString_ReturnValue) == 0x000010, "Member 'BluGlo_Node_C_BlueprintGetInteractionString::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
