#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GuardianDome

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function BP_GuardianDome.BP_GuardianDome_C.ExecuteUbergraph_BP_GuardianDome
// 0x003C (0x003C - 0x0000)
struct BP_GuardianDome_C_ExecuteUbergraph_BP_GuardianDome final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue2;                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameMode*                              CallFunc_GetGameMode_ReturnValue;                  // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UObject*                                K2Node_DynamicCast_AsFort_Game_Mode_Zone;          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_CustomEvent_Enabled;                        // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0038(0x0004)()
};
static_assert(alignof(BP_GuardianDome_C_ExecuteUbergraph_BP_GuardianDome) == 0x000004, "Wrong alignment on BP_GuardianDome_C_ExecuteUbergraph_BP_GuardianDome");
static_assert(sizeof(BP_GuardianDome_C_ExecuteUbergraph_BP_GuardianDome) == 0x00003C, "Wrong size on BP_GuardianDome_C_ExecuteUbergraph_BP_GuardianDome");
static_assert(offsetof(BP_GuardianDome_C_ExecuteUbergraph_BP_GuardianDome, EntryPoint) == 0x000000, "Member 'BP_GuardianDome_C_ExecuteUbergraph_BP_GuardianDome::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_GuardianDome_C_ExecuteUbergraph_BP_GuardianDome, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'BP_GuardianDome_C_ExecuteUbergraph_BP_GuardianDome::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GuardianDome_C_ExecuteUbergraph_BP_GuardianDome, CallFunc_HasAuthority_ReturnValue2) == 0x000005, "Member 'BP_GuardianDome_C_ExecuteUbergraph_BP_GuardianDome::CallFunc_HasAuthority_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_GuardianDome_C_ExecuteUbergraph_BP_GuardianDome, CallFunc_GetGameMode_ReturnValue) == 0x000008, "Member 'BP_GuardianDome_C_ExecuteUbergraph_BP_GuardianDome::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GuardianDome_C_ExecuteUbergraph_BP_GuardianDome, K2Node_DynamicCast_AsFort_Game_Mode_Zone) == 0x00000C, "Member 'BP_GuardianDome_C_ExecuteUbergraph_BP_GuardianDome::K2Node_DynamicCast_AsFort_Game_Mode_Zone' has a wrong offset!");
static_assert(offsetof(BP_GuardianDome_C_ExecuteUbergraph_BP_GuardianDome, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_GuardianDome_C_ExecuteUbergraph_BP_GuardianDome::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_GuardianDome_C_ExecuteUbergraph_BP_GuardianDome, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'BP_GuardianDome_C_ExecuteUbergraph_BP_GuardianDome::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_GuardianDome_C_ExecuteUbergraph_BP_GuardianDome, K2Node_CustomEvent_Enabled) == 0x000024, "Member 'BP_GuardianDome_C_ExecuteUbergraph_BP_GuardianDome::K2Node_CustomEvent_Enabled' has a wrong offset!");
static_assert(offsetof(BP_GuardianDome_C_ExecuteUbergraph_BP_GuardianDome, K2Node_CreateDelegate_OutputDelegate2) == 0x000028, "Member 'BP_GuardianDome_C_ExecuteUbergraph_BP_GuardianDome::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(BP_GuardianDome_C_ExecuteUbergraph_BP_GuardianDome, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000038, "Member 'BP_GuardianDome_C_ExecuteUbergraph_BP_GuardianDome::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function BP_GuardianDome.BP_GuardianDome_C.EnableDome
// 0x0001 (0x0001 - 0x0000)
struct BP_GuardianDome_C_EnableDome final
{
public:
	bool                                          Enabled;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_GuardianDome_C_EnableDome) == 0x000001, "Wrong alignment on BP_GuardianDome_C_EnableDome");
static_assert(sizeof(BP_GuardianDome_C_EnableDome) == 0x000001, "Wrong size on BP_GuardianDome_C_EnableDome");
static_assert(offsetof(BP_GuardianDome_C_EnableDome, Enabled) == 0x000000, "Member 'BP_GuardianDome_C_EnableDome::Enabled' has a wrong offset!");

// Function BP_GuardianDome.BP_GuardianDome_C.OnRep_MatchStarted
// 0x0050 (0x0050 - 0x0000)
struct BP_GuardianDome_C_OnRep_MatchStarted final
{
public:
	TArray<class AFortPlayerController*>          CallFunc_GetLocalFortPlayerControllers_ReturnValue; // 0x0000(0x000C)(ZeroConstructor, ReferenceParm)
	class AFortPlayerController*                  CallFunc_Array_Get_Item;                           // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<class AFortPlayerController*>          CallFunc_GetLocalFortPlayerControllers_ReturnValue2; // 0x0018(0x000C)(ZeroConstructor, ReferenceParm)
	EFortTeamAffiliation                          CallFunc_GetTeamAffiliation_ReturnValue;           // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F[0x1];                                       // 0x002F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           DomeColor2;                                        // 0x0030(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           DomeColor1;                                        // 0x0040(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_GuardianDome_C_OnRep_MatchStarted) == 0x000004, "Wrong alignment on BP_GuardianDome_C_OnRep_MatchStarted");
static_assert(sizeof(BP_GuardianDome_C_OnRep_MatchStarted) == 0x000050, "Wrong size on BP_GuardianDome_C_OnRep_MatchStarted");
static_assert(offsetof(BP_GuardianDome_C_OnRep_MatchStarted, CallFunc_GetLocalFortPlayerControllers_ReturnValue) == 0x000000, "Member 'BP_GuardianDome_C_OnRep_MatchStarted::CallFunc_GetLocalFortPlayerControllers_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GuardianDome_C_OnRep_MatchStarted, CallFunc_Array_Get_Item) == 0x00000C, "Member 'BP_GuardianDome_C_OnRep_MatchStarted::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_GuardianDome_C_OnRep_MatchStarted, CallFunc_GetMaterial_ReturnValue) == 0x000010, "Member 'BP_GuardianDome_C_OnRep_MatchStarted::CallFunc_GetMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GuardianDome_C_OnRep_MatchStarted, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000014, "Member 'BP_GuardianDome_C_OnRep_MatchStarted::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GuardianDome_C_OnRep_MatchStarted, CallFunc_GetLocalFortPlayerControllers_ReturnValue2) == 0x000018, "Member 'BP_GuardianDome_C_OnRep_MatchStarted::CallFunc_GetLocalFortPlayerControllers_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_GuardianDome_C_OnRep_MatchStarted, CallFunc_GetTeamAffiliation_ReturnValue) == 0x000024, "Member 'BP_GuardianDome_C_OnRep_MatchStarted::CallFunc_GetTeamAffiliation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GuardianDome_C_OnRep_MatchStarted, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BP_GuardianDome_C_OnRep_MatchStarted::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GuardianDome_C_OnRep_MatchStarted, K2Node_SwitchEnum_CmpSuccess) == 0x00002C, "Member 'BP_GuardianDome_C_OnRep_MatchStarted::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_GuardianDome_C_OnRep_MatchStarted, CallFunc_Greater_IntInt_ReturnValue) == 0x00002D, "Member 'BP_GuardianDome_C_OnRep_MatchStarted::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GuardianDome_C_OnRep_MatchStarted, CallFunc_BooleanAND_ReturnValue) == 0x00002E, "Member 'BP_GuardianDome_C_OnRep_MatchStarted::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GuardianDome_C_OnRep_MatchStarted, DomeColor2) == 0x000030, "Member 'BP_GuardianDome_C_OnRep_MatchStarted::DomeColor2' has a wrong offset!");
static_assert(offsetof(BP_GuardianDome_C_OnRep_MatchStarted, DomeColor1) == 0x000040, "Member 'BP_GuardianDome_C_OnRep_MatchStarted::DomeColor1' has a wrong offset!");

// Function BP_GuardianDome.BP_GuardianDome_C.OnRep_DomeEnabled
// 0x0001 (0x0001 - 0x0000)
struct BP_GuardianDome_C_OnRep_DomeEnabled final
{
public:
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_GuardianDome_C_OnRep_DomeEnabled) == 0x000001, "Wrong alignment on BP_GuardianDome_C_OnRep_DomeEnabled");
static_assert(sizeof(BP_GuardianDome_C_OnRep_DomeEnabled) == 0x000001, "Wrong size on BP_GuardianDome_C_OnRep_DomeEnabled");
static_assert(offsetof(BP_GuardianDome_C_OnRep_DomeEnabled, CallFunc_HasAuthority_ReturnValue) == 0x000000, "Member 'BP_GuardianDome_C_OnRep_DomeEnabled::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");

}

#pragma pack(pop)
