#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Pistol_Grip_Clip_TopAction

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// AnimBlueprintGeneratedClass BP_Pistol_Grip_Clip_TopAction.BP_Pistol_Grip_Clip_TopAction_C
// 0x0098 (0x03A8 - 0x0310)
class UBP_Pistol_Grip_Clip_TopAction_C final : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0310(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_6047A5F5443C843C1EB16F90E772A9EC; // 0x0314(0x002C)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1C444D924AC74067230DFA9A23E9CEE2; // 0x0340(0x0044)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_FE7CFCE944C6521565A6F7AC0C7064A1; // 0x0384(0x0024)()

public:
	void ExecuteUbergraph_BP_Pistol_Grip_Clip_TopAction(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Pistol_Grip_Clip_TopAction_C">();
	}
	static class UBP_Pistol_Grip_Clip_TopAction_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Pistol_Grip_Clip_TopAction_C>();
	}
};
static_assert(alignof(UBP_Pistol_Grip_Clip_TopAction_C) == 0x000004, "Wrong alignment on UBP_Pistol_Grip_Clip_TopAction_C");
static_assert(sizeof(UBP_Pistol_Grip_Clip_TopAction_C) == 0x0003A8, "Wrong size on UBP_Pistol_Grip_Clip_TopAction_C");
static_assert(offsetof(UBP_Pistol_Grip_Clip_TopAction_C, UberGraphFrame) == 0x000310, "Member 'UBP_Pistol_Grip_Clip_TopAction_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_Pistol_Grip_Clip_TopAction_C, AnimGraphNode_Root_6047A5F5443C843C1EB16F90E772A9EC) == 0x000314, "Member 'UBP_Pistol_Grip_Clip_TopAction_C::AnimGraphNode_Root_6047A5F5443C843C1EB16F90E772A9EC' has a wrong offset!");
static_assert(offsetof(UBP_Pistol_Grip_Clip_TopAction_C, AnimGraphNode_Slot_1C444D924AC74067230DFA9A23E9CEE2) == 0x000340, "Member 'UBP_Pistol_Grip_Clip_TopAction_C::AnimGraphNode_Slot_1C444D924AC74067230DFA9A23E9CEE2' has a wrong offset!");
static_assert(offsetof(UBP_Pistol_Grip_Clip_TopAction_C, AnimGraphNode_LocalRefPose_FE7CFCE944C6521565A6F7AC0C7064A1) == 0x000384, "Member 'UBP_Pistol_Grip_Clip_TopAction_C::AnimGraphNode_LocalRefPose_FE7CFCE944C6521565A6F7AC0C7064A1' has a wrong offset!");

}

#pragma pack(pop)
