#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SniperRifle_FCSA

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// AnimBlueprintGeneratedClass BP_SniperRifle_FCSA.BP_SniperRifle_FCSA_C
// 0x0098 (0x03A8 - 0x0310)
class UBP_SniperRifle_FCSA_C final : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0310(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_146699F448DB1AAB26EC9F814C49D1D1; // 0x0314(0x002C)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_F7DD3CBC4CA03D5C78826D9E409ECCA2; // 0x0340(0x0044)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_7C8D051E4A0B249DA61DCAA86177450B; // 0x0384(0x0024)()

public:
	void ExecuteUbergraph_BP_SniperRifle_FCSA(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SniperRifle_FCSA_C">();
	}
	static class UBP_SniperRifle_FCSA_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_SniperRifle_FCSA_C>();
	}
};
static_assert(alignof(UBP_SniperRifle_FCSA_C) == 0x000004, "Wrong alignment on UBP_SniperRifle_FCSA_C");
static_assert(sizeof(UBP_SniperRifle_FCSA_C) == 0x0003A8, "Wrong size on UBP_SniperRifle_FCSA_C");
static_assert(offsetof(UBP_SniperRifle_FCSA_C, UberGraphFrame) == 0x000310, "Member 'UBP_SniperRifle_FCSA_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_SniperRifle_FCSA_C, AnimGraphNode_Root_146699F448DB1AAB26EC9F814C49D1D1) == 0x000314, "Member 'UBP_SniperRifle_FCSA_C::AnimGraphNode_Root_146699F448DB1AAB26EC9F814C49D1D1' has a wrong offset!");
static_assert(offsetof(UBP_SniperRifle_FCSA_C, AnimGraphNode_Slot_F7DD3CBC4CA03D5C78826D9E409ECCA2) == 0x000340, "Member 'UBP_SniperRifle_FCSA_C::AnimGraphNode_Slot_F7DD3CBC4CA03D5C78826D9E409ECCA2' has a wrong offset!");
static_assert(offsetof(UBP_SniperRifle_FCSA_C, AnimGraphNode_LocalRefPose_7C8D051E4A0B249DA61DCAA86177450B) == 0x000384, "Member 'UBP_SniperRifle_FCSA_C::AnimGraphNode_LocalRefPose_7C8D051E4A0B249DA61DCAA86177450B' has a wrong offset!");

}

#pragma pack(pop)
