#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTTask_StopMovement

#include "Basic.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function BTTask_StopMovement.BTTask_StopMovement_C.ExecuteUbergraph_BTTask_StopMovement
// 0x0010 (0x0010 - 0x0000)
struct BTTask_StopMovement_C_ExecuteUbergraph_BTTask_StopMovement final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_Event_OwnerActor;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AAIController*                          K2Node_DynamicCast_AsAIController;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BTTask_StopMovement_C_ExecuteUbergraph_BTTask_StopMovement) == 0x000004, "Wrong alignment on BTTask_StopMovement_C_ExecuteUbergraph_BTTask_StopMovement");
static_assert(sizeof(BTTask_StopMovement_C_ExecuteUbergraph_BTTask_StopMovement) == 0x000010, "Wrong size on BTTask_StopMovement_C_ExecuteUbergraph_BTTask_StopMovement");
static_assert(offsetof(BTTask_StopMovement_C_ExecuteUbergraph_BTTask_StopMovement, EntryPoint) == 0x000000, "Member 'BTTask_StopMovement_C_ExecuteUbergraph_BTTask_StopMovement::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTTask_StopMovement_C_ExecuteUbergraph_BTTask_StopMovement, K2Node_Event_OwnerActor) == 0x000004, "Member 'BTTask_StopMovement_C_ExecuteUbergraph_BTTask_StopMovement::K2Node_Event_OwnerActor' has a wrong offset!");
static_assert(offsetof(BTTask_StopMovement_C_ExecuteUbergraph_BTTask_StopMovement, K2Node_DynamicCast_AsAIController) == 0x000008, "Member 'BTTask_StopMovement_C_ExecuteUbergraph_BTTask_StopMovement::K2Node_DynamicCast_AsAIController' has a wrong offset!");
static_assert(offsetof(BTTask_StopMovement_C_ExecuteUbergraph_BTTask_StopMovement, K2Node_DynamicCast_bSuccess) == 0x00000C, "Member 'BTTask_StopMovement_C_ExecuteUbergraph_BTTask_StopMovement::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BTTask_StopMovement.BTTask_StopMovement_C.ReceiveExecute
// 0x0004 (0x0004 - 0x0000)
struct BTTask_StopMovement_C_ReceiveExecute final
{
public:
	class AActor*                                 OwnerActor;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BTTask_StopMovement_C_ReceiveExecute) == 0x000004, "Wrong alignment on BTTask_StopMovement_C_ReceiveExecute");
static_assert(sizeof(BTTask_StopMovement_C_ReceiveExecute) == 0x000004, "Wrong size on BTTask_StopMovement_C_ReceiveExecute");
static_assert(offsetof(BTTask_StopMovement_C_ReceiveExecute, OwnerActor) == 0x000000, "Member 'BTTask_StopMovement_C_ReceiveExecute::OwnerActor' has a wrong offset!");

}

#pragma pack(pop)
