#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Car_Copper

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function Car_Copper.Car_Copper_C.ExecuteUbergraph_Car_Copper
// 0x04A0 (0x04A0 - 0x0000)
struct Car_Copper_C_ExecuteUbergraph_Car_Copper final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_Damage;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  K2Node_Event_DamageTags;                           // 0x0008(0x0018)(ConstParm)
	struct FVector                                K2Node_Event_Momentum;                             // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             K2Node_Event_HitInfo;                              // 0x002C(0x0080)(ConstParm, ContainsInstancedReference)
	class AController*                            K2Node_Event_InstigatedBy;                         // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext;                        // 0x00B4(0x000C)()
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Variable2;                                // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item;                           // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_LastIndex_ReturnValue2;             // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_LastIndex_ReturnValue3;             // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item2;                          // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue2;            // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable3;                                // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UMaterialInstanceDynamic*               CallFunc_GetAnimatingMID_ReturnValue;              // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue3;                  // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_105[0x3];                                      // 0x0105(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakColor_R;                             // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakColor_G;                             // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakColor_B;                             // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakColor_A;                             // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakColor_R2;                            // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakColor_G2;                            // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakColor_B2;                            // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakColor_A2;                            // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0128(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue2;                  // 0x0134(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue4;                  // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_145[0x3];                                      // 0x0145(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_Event_MyComp;                               // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_Event_Other;                                // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    K2Node_Event_OtherComp;                            // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bSelfMoved;                           // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_155[0x3];                                      // 0x0155(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_HitLocation;                          // 0x0158(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                K2Node_Event_HitNormal;                            // 0x0164(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                K2Node_Event_NormalImpulse;                        // 0x0170(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x017C(0x0080)(ConstParm, ContainsInstancedReference)
	struct FVector                                CallFunc_GetComponentVelocity_ReturnValue;         // 0x01FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x020C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_20D[0x3];                                      // 0x020D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X;                            // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Y;                            // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Z;                            // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x021C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21D[0x3];                                      // 0x021D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0220(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x022C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x023C(0x0004)()
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue2;                 // 0x0240(0x0004)()
	float                                         CallFunc_BreakColor_R3;                            // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakColor_G3;                            // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakColor_B3;                            // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakColor_A3;                            // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue3;                  // 0x0254(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue2;        // 0x0260(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue2;    // 0x026C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue3;        // 0x0280(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue3;    // 0x028C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UStaticMeshComponent*                   CallFunc_GetBuildingMeshComponent_ReturnValue;     // 0x029C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x02A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Variable4;                                // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item3;                          // 0x02B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue3;            // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B9[0x3];                                      // 0x02B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue5;                  // 0x02BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_Damage3;                              // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  K2Node_Event_DamageTags3;                          // 0x02C4(0x0018)(ConstParm)
	struct FVector                                K2Node_Event_Momentum3;                            // 0x02DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             K2Node_Event_HitInfo3;                             // 0x02E8(0x0080)(ConstParm, ContainsInstancedReference)
	class AFortPawn*                              K2Node_Event_InstigatedBy3;                        // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_Event_DamageCauser3;                        // 0x036C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext3;                       // 0x0370(0x000C)()
	float                                         K2Node_Event_Damage2;                              // 0x037C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  K2Node_Event_DamageTags2;                          // 0x0380(0x0018)(ConstParm)
	struct FVector                                K2Node_Event_Momentum2;                            // 0x0398(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             K2Node_Event_HitInfo2;                             // 0x03A4(0x0080)(ConstParm, ContainsInstancedReference)
	class AFortPawn*                              K2Node_Event_InstigatedBy2;                        // 0x0424(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_Event_DamageCauser2;                        // 0x0428(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext2;                       // 0x042C(0x000C)()
	float                                         CallFunc_GetBuildingHealthPercentage_ReturnValue;  // 0x0438(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x043C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_449[0x3];                                      // 0x0449(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x044C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue3;                 // 0x0450(0x0004)()
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0454(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0455(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0456(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_457[0x1];                                      // 0x0457(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_GetBuildingMeshComponent_ReturnValue2;    // 0x0458(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetNumMaterials_ReturnValue;              // 0x045C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UStaticMeshComponent*                   CallFunc_GetBuildingMeshComponent_ReturnValue3;    // 0x0460(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue4;            // 0x0464(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_465[0x3];                                      // 0x0465(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0468(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x046C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x046D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46E[0x2];                                      // 0x046E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue2;         // 0x0470(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasHealthLeft_ReturnValue;                // 0x047C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x047D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_47E[0x2];                                      // 0x047E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue2;         // 0x0480(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue4;        // 0x0484(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue4;    // 0x0490(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Car_Copper_C_ExecuteUbergraph_Car_Copper) == 0x000004, "Wrong alignment on Car_Copper_C_ExecuteUbergraph_Car_Copper");
static_assert(sizeof(Car_Copper_C_ExecuteUbergraph_Car_Copper) == 0x0004A0, "Wrong size on Car_Copper_C_ExecuteUbergraph_Car_Copper");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, EntryPoint) == 0x000000, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::EntryPoint' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, K2Node_Event_Damage) == 0x000004, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, K2Node_Event_DamageTags) == 0x000008, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::K2Node_Event_DamageTags' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, K2Node_Event_Momentum) == 0x000020, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::K2Node_Event_Momentum' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, K2Node_Event_HitInfo) == 0x00002C, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::K2Node_Event_HitInfo' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, K2Node_Event_InstigatedBy) == 0x0000AC, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::K2Node_Event_InstigatedBy' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, K2Node_Event_DamageCauser) == 0x0000B0, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::K2Node_Event_DamageCauser' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, K2Node_Event_EffectContext) == 0x0000B4, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::K2Node_Event_EffectContext' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, CallFunc_K2_GetPawn_ReturnValue) == 0x0000C0, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, CallFunc_IsValid_ReturnValue) == 0x0000C4, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, Temp_int_Variable) == 0x0000C8, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, CallFunc_Add_IntInt_ReturnValue) == 0x0000CC, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, CallFunc_Array_LastIndex_ReturnValue) == 0x0000D0, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, Temp_int_Variable2) == 0x0000D4, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::Temp_int_Variable2' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, CallFunc_Array_Get_Item) == 0x0000D8, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000DC, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, CallFunc_Add_IntInt_ReturnValue2) == 0x0000E0, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, CallFunc_Array_LastIndex_ReturnValue2) == 0x0000E4, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::CallFunc_Array_LastIndex_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, CallFunc_Array_LastIndex_ReturnValue3) == 0x0000E8, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::CallFunc_Array_LastIndex_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, CallFunc_Array_Get_Item2) == 0x0000EC, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, CallFunc_LessEqual_IntInt_ReturnValue2) == 0x0000F0, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::CallFunc_LessEqual_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, Temp_int_Variable3) == 0x0000F4, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::Temp_int_Variable3' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000F8, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, CallFunc_GetAnimatingMID_ReturnValue) == 0x0000FC, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::CallFunc_GetAnimatingMID_ReturnValue' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, CallFunc_Add_IntInt_ReturnValue3) == 0x000100, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::CallFunc_Add_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, CallFunc_IsDedicatedServer_ReturnValue) == 0x000104, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, CallFunc_BreakColor_R) == 0x000108, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::CallFunc_BreakColor_R' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, CallFunc_BreakColor_G) == 0x00010C, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::CallFunc_BreakColor_G' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, CallFunc_BreakColor_B) == 0x000110, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::CallFunc_BreakColor_B' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, CallFunc_BreakColor_A) == 0x000114, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::CallFunc_BreakColor_A' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, CallFunc_BreakColor_R2) == 0x000118, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::CallFunc_BreakColor_R2' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, CallFunc_BreakColor_G2) == 0x00011C, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::CallFunc_BreakColor_G2' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, CallFunc_BreakColor_B2) == 0x000120, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::CallFunc_BreakColor_B2' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, CallFunc_BreakColor_A2) == 0x000124, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::CallFunc_BreakColor_A2' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, CallFunc_MakeVector_ReturnValue) == 0x000128, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, CallFunc_MakeVector_ReturnValue2) == 0x000134, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::CallFunc_MakeVector_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, CallFunc_Add_IntInt_ReturnValue4) == 0x000140, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::CallFunc_Add_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000144, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, K2Node_Event_MyComp) == 0x000148, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::K2Node_Event_MyComp' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, K2Node_Event_Other) == 0x00014C, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::K2Node_Event_Other' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, K2Node_Event_OtherComp) == 0x000150, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::K2Node_Event_OtherComp' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, K2Node_Event_bSelfMoved) == 0x000154, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::K2Node_Event_bSelfMoved' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, K2Node_Event_HitLocation) == 0x000158, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::K2Node_Event_HitLocation' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, K2Node_Event_HitNormal) == 0x000164, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::K2Node_Event_HitNormal' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, K2Node_Event_NormalImpulse) == 0x000170, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::K2Node_Event_NormalImpulse' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, K2Node_Event_Hit) == 0x00017C, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, CallFunc_GetComponentVelocity_ReturnValue) == 0x0001FC, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::CallFunc_GetComponentVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000208, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, K2Node_DynamicCast_bSuccess) == 0x00020C, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, CallFunc_BreakVector_X) == 0x000210, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, CallFunc_BreakVector_Y) == 0x000214, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, CallFunc_BreakVector_Z) == 0x000218, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x00021C, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000220, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x00022C, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, CallFunc_K2_SetTimer_ReturnValue) == 0x00023C, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, CallFunc_K2_SetTimer_ReturnValue2) == 0x000240, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::CallFunc_K2_SetTimer_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, CallFunc_BreakColor_R3) == 0x000244, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::CallFunc_BreakColor_R3' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, CallFunc_BreakColor_G3) == 0x000248, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::CallFunc_BreakColor_G3' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, CallFunc_BreakColor_B3) == 0x00024C, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::CallFunc_BreakColor_B3' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, CallFunc_BreakColor_A3) == 0x000250, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::CallFunc_BreakColor_A3' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, CallFunc_MakeVector_ReturnValue3) == 0x000254, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::CallFunc_MakeVector_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, CallFunc_Multiply_VectorFloat_ReturnValue2) == 0x000260, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::CallFunc_Multiply_VectorFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, CallFunc_Conv_VectorToLinearColor_ReturnValue2) == 0x00026C, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::CallFunc_Conv_VectorToLinearColor_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00027C, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, CallFunc_Multiply_VectorFloat_ReturnValue3) == 0x000280, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::CallFunc_Multiply_VectorFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, CallFunc_Conv_VectorToLinearColor_ReturnValue3) == 0x00028C, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::CallFunc_Conv_VectorToLinearColor_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, CallFunc_GetBuildingMeshComponent_ReturnValue) == 0x00029C, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::CallFunc_GetBuildingMeshComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, CallFunc_GetSocketLocation_ReturnValue) == 0x0002A0, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, Temp_int_Variable4) == 0x0002AC, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::Temp_int_Variable4' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x0002B0, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, CallFunc_Array_Get_Item3) == 0x0002B4, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::CallFunc_Array_Get_Item3' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, CallFunc_LessEqual_IntInt_ReturnValue3) == 0x0002B8, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::CallFunc_LessEqual_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, CallFunc_Add_IntInt_ReturnValue5) == 0x0002BC, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::CallFunc_Add_IntInt_ReturnValue5' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, K2Node_Event_Damage3) == 0x0002C0, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::K2Node_Event_Damage3' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, K2Node_Event_DamageTags3) == 0x0002C4, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::K2Node_Event_DamageTags3' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, K2Node_Event_Momentum3) == 0x0002DC, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::K2Node_Event_Momentum3' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, K2Node_Event_HitInfo3) == 0x0002E8, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::K2Node_Event_HitInfo3' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, K2Node_Event_InstigatedBy3) == 0x000368, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::K2Node_Event_InstigatedBy3' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, K2Node_Event_DamageCauser3) == 0x00036C, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::K2Node_Event_DamageCauser3' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, K2Node_Event_EffectContext3) == 0x000370, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::K2Node_Event_EffectContext3' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, K2Node_Event_Damage2) == 0x00037C, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::K2Node_Event_Damage2' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, K2Node_Event_DamageTags2) == 0x000380, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::K2Node_Event_DamageTags2' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, K2Node_Event_Momentum2) == 0x000398, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::K2Node_Event_Momentum2' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, K2Node_Event_HitInfo2) == 0x0003A4, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::K2Node_Event_HitInfo2' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, K2Node_Event_InstigatedBy2) == 0x000424, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::K2Node_Event_InstigatedBy2' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, K2Node_Event_DamageCauser2) == 0x000428, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::K2Node_Event_DamageCauser2' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, K2Node_Event_EffectContext2) == 0x00042C, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::K2Node_Event_EffectContext2' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, CallFunc_GetBuildingHealthPercentage_ReturnValue) == 0x000438, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::CallFunc_GetBuildingHealthPercentage_ReturnValue' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00043C, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, CallFunc_Less_FloatFloat_ReturnValue) == 0x000448, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, CallFunc_RandomFloatInRange_ReturnValue) == 0x00044C, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, CallFunc_K2_SetTimer_ReturnValue3) == 0x000450, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::CallFunc_K2_SetTimer_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000454, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000455, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, CallFunc_BooleanAND_ReturnValue) == 0x000456, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, CallFunc_GetBuildingMeshComponent_ReturnValue2) == 0x000458, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::CallFunc_GetBuildingMeshComponent_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, CallFunc_GetNumMaterials_ReturnValue) == 0x00045C, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::CallFunc_GetNumMaterials_ReturnValue' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, CallFunc_GetBuildingMeshComponent_ReturnValue3) == 0x000460, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::CallFunc_GetBuildingMeshComponent_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, CallFunc_LessEqual_IntInt_ReturnValue4) == 0x000464, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::CallFunc_LessEqual_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000468, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, CallFunc_IsValid_ReturnValue2) == 0x00046C, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, K2Node_Event_EndPlayReason) == 0x00046D, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, CallFunc_K2_GetActorLocation_ReturnValue2) == 0x000470, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::CallFunc_K2_GetActorLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, CallFunc_HasHealthLeft_ReturnValue) == 0x00047C, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::CallFunc_HasHealthLeft_ReturnValue' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, CallFunc_BooleanAND_ReturnValue2) == 0x00047D, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, CallFunc_Multiply_FloatFloat_ReturnValue2) == 0x000480, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::CallFunc_Multiply_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, CallFunc_Multiply_VectorFloat_ReturnValue4) == 0x000484, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::CallFunc_Multiply_VectorFloat_ReturnValue4' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ExecuteUbergraph_Car_Copper, CallFunc_Conv_VectorToLinearColor_ReturnValue4) == 0x000490, "Member 'Car_Copper_C_ExecuteUbergraph_Car_Copper::CallFunc_Conv_VectorToLinearColor_ReturnValue4' has a wrong offset!");

// Function Car_Copper.Car_Copper_C.OnDamageServer
// 0x00BC (0x00BC - 0x0000)
struct Car_Copper_C_OnDamageServer final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  DamageTags;                                        // 0x0004(0x0018)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FVector                                Momentum;                                          // 0x001C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             HitInfo;                                           // 0x0028(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class AController*                            InstigatedBy;                                      // 0x00A8(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 DamageCauser;                                      // 0x00AC(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x00B0(0x000C)(Parm)
};
static_assert(alignof(Car_Copper_C_OnDamageServer) == 0x000004, "Wrong alignment on Car_Copper_C_OnDamageServer");
static_assert(sizeof(Car_Copper_C_OnDamageServer) == 0x0000BC, "Wrong size on Car_Copper_C_OnDamageServer");
static_assert(offsetof(Car_Copper_C_OnDamageServer, Damage) == 0x000000, "Member 'Car_Copper_C_OnDamageServer::Damage' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_OnDamageServer, DamageTags) == 0x000004, "Member 'Car_Copper_C_OnDamageServer::DamageTags' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_OnDamageServer, Momentum) == 0x00001C, "Member 'Car_Copper_C_OnDamageServer::Momentum' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_OnDamageServer, HitInfo) == 0x000028, "Member 'Car_Copper_C_OnDamageServer::HitInfo' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_OnDamageServer, InstigatedBy) == 0x0000A8, "Member 'Car_Copper_C_OnDamageServer::InstigatedBy' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_OnDamageServer, DamageCauser) == 0x0000AC, "Member 'Car_Copper_C_OnDamageServer::DamageCauser' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_OnDamageServer, EffectContext) == 0x0000B0, "Member 'Car_Copper_C_OnDamageServer::EffectContext' has a wrong offset!");

// Function Car_Copper.Car_Copper_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct Car_Copper_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Car_Copper_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on Car_Copper_C_ReceiveEndPlay");
static_assert(sizeof(Car_Copper_C_ReceiveEndPlay) == 0x000001, "Wrong size on Car_Copper_C_ReceiveEndPlay");
static_assert(offsetof(Car_Copper_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'Car_Copper_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function Car_Copper.Car_Copper_C.OnDamagePlayEffects
// 0x00BC (0x00BC - 0x0000)
struct Car_Copper_C_OnDamagePlayEffects final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  DamageTags;                                        // 0x0004(0x0018)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FVector                                Momentum;                                          // 0x001C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             HitInfo;                                           // 0x0028(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class AFortPawn*                              InstigatedBy;                                      // 0x00A8(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 DamageCauser;                                      // 0x00AC(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x00B0(0x000C)(Parm)
};
static_assert(alignof(Car_Copper_C_OnDamagePlayEffects) == 0x000004, "Wrong alignment on Car_Copper_C_OnDamagePlayEffects");
static_assert(sizeof(Car_Copper_C_OnDamagePlayEffects) == 0x0000BC, "Wrong size on Car_Copper_C_OnDamagePlayEffects");
static_assert(offsetof(Car_Copper_C_OnDamagePlayEffects, Damage) == 0x000000, "Member 'Car_Copper_C_OnDamagePlayEffects::Damage' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_OnDamagePlayEffects, DamageTags) == 0x000004, "Member 'Car_Copper_C_OnDamagePlayEffects::DamageTags' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_OnDamagePlayEffects, Momentum) == 0x00001C, "Member 'Car_Copper_C_OnDamagePlayEffects::Momentum' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_OnDamagePlayEffects, HitInfo) == 0x000028, "Member 'Car_Copper_C_OnDamagePlayEffects::HitInfo' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_OnDamagePlayEffects, InstigatedBy) == 0x0000A8, "Member 'Car_Copper_C_OnDamagePlayEffects::InstigatedBy' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_OnDamagePlayEffects, DamageCauser) == 0x0000AC, "Member 'Car_Copper_C_OnDamagePlayEffects::DamageCauser' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_OnDamagePlayEffects, EffectContext) == 0x0000B0, "Member 'Car_Copper_C_OnDamagePlayEffects::EffectContext' has a wrong offset!");

// Function Car_Copper.Car_Copper_C.OnDeathPlayEffects
// 0x00BC (0x00BC - 0x0000)
struct Car_Copper_C_OnDeathPlayEffects final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  DamageTags;                                        // 0x0004(0x0018)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FVector                                Momentum;                                          // 0x001C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             HitInfo;                                           // 0x0028(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class AFortPawn*                              InstigatedBy;                                      // 0x00A8(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 DamageCauser;                                      // 0x00AC(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x00B0(0x000C)(Parm)
};
static_assert(alignof(Car_Copper_C_OnDeathPlayEffects) == 0x000004, "Wrong alignment on Car_Copper_C_OnDeathPlayEffects");
static_assert(sizeof(Car_Copper_C_OnDeathPlayEffects) == 0x0000BC, "Wrong size on Car_Copper_C_OnDeathPlayEffects");
static_assert(offsetof(Car_Copper_C_OnDeathPlayEffects, Damage) == 0x000000, "Member 'Car_Copper_C_OnDeathPlayEffects::Damage' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_OnDeathPlayEffects, DamageTags) == 0x000004, "Member 'Car_Copper_C_OnDeathPlayEffects::DamageTags' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_OnDeathPlayEffects, Momentum) == 0x00001C, "Member 'Car_Copper_C_OnDeathPlayEffects::Momentum' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_OnDeathPlayEffects, HitInfo) == 0x000028, "Member 'Car_Copper_C_OnDeathPlayEffects::HitInfo' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_OnDeathPlayEffects, InstigatedBy) == 0x0000A8, "Member 'Car_Copper_C_OnDeathPlayEffects::InstigatedBy' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_OnDeathPlayEffects, DamageCauser) == 0x0000AC, "Member 'Car_Copper_C_OnDeathPlayEffects::DamageCauser' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_OnDeathPlayEffects, EffectContext) == 0x0000B0, "Member 'Car_Copper_C_OnDeathPlayEffects::EffectContext' has a wrong offset!");

// Function Car_Copper.Car_Copper_C.ReceiveHit
// 0x00B4 (0x00B4 - 0x0000)
struct Car_Copper_C_ReceiveHit final
{
public:
	class UPrimitiveComponent*                    MyComp;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 Other;                                             // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bSelfMoved;                                        // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                HitLocation;                                       // 0x0010(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                HitNormal;                                         // 0x001C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                NormalImpulse;                                     // 0x0028(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             Hit;                                               // 0x0034(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(Car_Copper_C_ReceiveHit) == 0x000004, "Wrong alignment on Car_Copper_C_ReceiveHit");
static_assert(sizeof(Car_Copper_C_ReceiveHit) == 0x0000B4, "Wrong size on Car_Copper_C_ReceiveHit");
static_assert(offsetof(Car_Copper_C_ReceiveHit, MyComp) == 0x000000, "Member 'Car_Copper_C_ReceiveHit::MyComp' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ReceiveHit, Other) == 0x000004, "Member 'Car_Copper_C_ReceiveHit::Other' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ReceiveHit, OtherComp) == 0x000008, "Member 'Car_Copper_C_ReceiveHit::OtherComp' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ReceiveHit, bSelfMoved) == 0x00000C, "Member 'Car_Copper_C_ReceiveHit::bSelfMoved' has a wrong offset!");
static_assert(offsetof(Car_Copper_C_ReceiveHit, HitLocation) == 0x000010, "Member 'Car_Copper_C_ReceiveHit::HitLocation' has a wrong offset!");
