#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Car_Copper

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass Car_Copper.Car_Copper_C
// 0x00DC (0x0A20 - 0x0944)
class ACar_Copper_C : public ABuildingProp
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0944(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         Timeline_2_SirenLightMultiplier_0FF34BB7440D69B151AEB98B69DAACB9; // 0x0948(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ETimelineDirection                            Timeline_2__Direction_0FF34BB7440D69B151AEB98B69DAACB9; // 0x094C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_94D[0x3];                                      // 0x094D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_2;                                        // 0x0950(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         BounceCar_Vertical_Bounce_Component_05733C554001D77C015F47B548F45A12; // 0x0954(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ETimelineDirection                            BounceCar__Direction_05733C554001D77C015F47B548F45A12; // 0x0958(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_959[0x3];                                      // 0x0959(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     BounceCar;                                         // 0x095C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         Timeline_0_AlarmLightMultiplier_0249B75D481A6B889F74E6BC52A3E21B; // 0x0960(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ETimelineDirection                            Timeline_0__Direction_0249B75D481A6B889F74E6BC52A3E21B; // 0x0964(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_965[0x3];                                      // 0x0965(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0968(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          OverallAlarmCycleFinished;                         // 0x096C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_96D[0x3];                                      // 0x096D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           InitialEmissiveMultiplier;                         // 0x0970(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           InitialEmissiveMultiplier2;                        // 0x0980(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         AlarmLightCounter;                                 // 0x0990(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          SoundIsRetriggerable;                              // 0x0994(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          CurrentFlashAnimationCycleFinished;                // 0x0995(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_996[0x2];                                      // 0x0996(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumberOfTimesTheLightsFlashWhenHit;                // 0x0998(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         SirenLightMultiplier;                              // 0x099C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          SirenLightOn;                                      // 0x09A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A1[0x3];                                      // 0x09A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Emissive_Multiplier_2;                             // 0x09A4(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class FName                                   Emissive_Multiplier;                               // 0x09AC(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class USoundBase*                             Sound___HitAlarm;                                  // 0x09B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Use_Emissive_2;                                    // 0x09B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9B9[0x3];                                      // 0x09B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Sound___Jump_on_Car;                               // 0x09BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         SuspensionMovementAmount;                          // 0x09C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ParticleEffectHas_NOT_AlreadyBeenTriggered;        // 0x09C4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9C5[0x3];                                      // 0x09C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               EngineSteamParticleEffect;                         // 0x09C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class USoundBase*                             Sound___Hit_AutoBody;                              // 0x09CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          canMakeJumpingNoiseAgain;                          // 0x09D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          CarAlarmIsCurrentlyMakingNoise;                    // 0x09D1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ReplicatingUseCarAlarmBool;                        // 0x09D2(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          RandomlyDisableSomeCarAlarms;                      // 0x09D3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         PercentageChanceOfCarAlarmsBeingDisabled;          // 0x09D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPointLightComponent*                   interiorAlarmLight;                                // 0x09D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UPointLightComponent*                   HLight1;                                           // 0x09DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                AlarmLightSocketLocation;                          // 0x09E0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                HLight1SocketLocation;                             // 0x09EC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                HLight2SocketLocation;                             // 0x09F8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	TArray<class UMaterialInstanceDynamic*>       AnimatingMIDArray;                                 // 0x0A04(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class UAudioComponent*                        AudibleAlarmSound;                                 // 0x0A10(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          UseCarBounce;                                      // 0x0A14(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          UseCarAlarm;                                       // 0x0A15(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A16[0x2];                                      // 0x0A16(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Headlight_Brightness;                              // 0x0A18(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsSetUseCarAlarmBoolInitialized;                   // 0x0A1C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_Car_Copper(int32 EntryPoint);
	void OnDamageServer(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AController* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void OnDamagePlayEffects(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void OnDeathPlayEffects(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void TriggerLowHealthParticleEffect();
	void FadeSirenLight();
	void StartSirenLight();
	void ReceiveHit(class UPrimitiveComponent* MyComp, class AActor* Other, class UPrimitiveComponent* OtherComp, bool bSelfMoved, const struct FVector& HitLocation, const struct FVector& HitNormal, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void ReceiveBeginPlay();
	void Timeline_2__FireOffNoise__EventFunc();
	void Timeline_2__UpdateFunc();
	void Timeline_2__FinishedFunc();
	void BounceCar__UpdateFunc();
	void BounceCar__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();
	void UserConstructionScript();
	void StopCarAlarmFromPlaying();
	void setcanmakebouncingnoisetrue();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Car_Copper_C">();
	}
	static class ACar_Copper_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACar_Copper_C>();
	}
};
static_assert(alignof(ACar_Copper_C) == 0x000004, "Wrong alignment on ACar_Copper_C");
static_assert(sizeof(ACar_Copper_C) == 0x000A20, "Wrong size on ACar_Copper_C");
static_assert(offsetof(ACar_Copper_C, UberGraphFrame) == 0x000944, "Member 'ACar_Copper_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ACar_Copper_C, Timeline_2_SirenLightMultiplier_0FF34BB7440D69B151AEB98B69DAACB9) == 0x000948, "Member 'ACar_Copper_C::Timeline_2_SirenLightMultiplier_0FF34BB7440D69B151AEB98B69DAACB9' has a wrong offset!");
static_assert(offsetof(ACar_Copper_C, Timeline_2__Direction_0FF34BB7440D69B151AEB98B69DAACB9) == 0x00094C, "Member 'ACar_Copper_C::Timeline_2__Direction_0FF34BB7440D69B151AEB98B69DAACB9' has a wrong offset!");
static_assert(offsetof(ACar_Copper_C, Timeline_2) == 0x000950, "Member 'ACar_Copper_C::Timeline_2' has a wrong offset!");
static_assert(offsetof(ACar_Copper_C, BounceCar_Vertical_Bounce_Component_05733C554001D77C015F47B548F45A12) == 0x000954, "Member 'ACar_Copper_C::BounceCar_Vertical_Bounce_Component_05733C554001D77C015F47B548F45A12' has a wrong offset!");
static_assert(offsetof(ACar_Copper_C, BounceCar__Direction_05733C554001D77C015F47B548F45A12) == 0x000958, "Member 'ACar_Copper_C::BounceCar__Direction_05733C554001D77C015F47B548F45A12' has a wrong offset!");
static_assert(offsetof(ACar_Copper_C, BounceCar) == 0x00095C, "Member 'ACar_Copper_C::BounceCar' has a wrong offset!");
static_assert(offsetof(ACar_Copper_C, Timeline_0_AlarmLightMultiplier_0249B75D481A6B889F74E6BC52A3E21B) == 0x000960, "Member 'ACar_Copper_C::Timeline_0_AlarmLightMultiplier_0249B75D481A6B889F74E6BC52A3E21B' has a wrong offset!");
static_assert(offsetof(ACar_Copper_C, Timeline_0__Direction_0249B75D481A6B889F74E6BC52A3E21B) == 0x000964, "Member 'ACar_Copper_C::Timeline_0__Direction_0249B75D481A6B889F74E6BC52A3E21B' has a wrong offset!");
static_assert(offsetof(ACar_Copper_C, Timeline_0) == 0x000968, "Member 'ACar_Copper_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ACar_Copper_C, OverallAlarmCycleFinished) == 0x00096C, "Member 'ACar_Copper_C::OverallAlarmCycleFinished' has a wrong offset!");
static_assert(offsetof(ACar_Copper_C, InitialEmissiveMultiplier) == 0x000970, "Member 'ACar_Copper_C::InitialEmissiveMultiplier' has a wrong offset!");
static_assert(offsetof(ACar_Copper_C, InitialEmissiveMultiplier2) == 0x000980, "Member 'ACar_Copper_C::InitialEmissiveMultiplier2' has a wrong offset!");
static_assert(offsetof(ACar_Copper_C, AlarmLightCounter) == 0x000990, "Member 'ACar_Copper_C::AlarmLightCounter' has a wrong offset!");
static_assert(offsetof(ACar_Copper_C, SoundIsRetriggerable) == 0x000994, "Member 'ACar_Copper_C::SoundIsRetriggerable' has a wrong offset!");
static_assert(offsetof(ACar_Copper_C, CurrentFlashAnimationCycleFinished) == 0x000995, "Member 'ACar_Copper_C::CurrentFlashAnimationCycleFinished' has a wrong offset!");
static_assert(offsetof(ACar_Copper_C, NumberOfTimesTheLightsFlashWhenHit) == 0x000998, "Member 'ACar_Copper_C::NumberOfTimesTheLightsFlashWhenHit' has a wrong offset!");
static_assert(offsetof(ACar_Copper_C, SirenLightMultiplier) == 0x00099C, "Member 'ACar_Copper_C::SirenLightMultiplier' has a wrong offset!");
static_assert(offsetof(ACar_Copper_C, SirenLightOn) == 0x0009A0, "Member 'ACar_Copper_C::SirenLightOn' has a wrong offset!");
static_assert(offsetof(ACar_Copper_C, Emissive_Multiplier_2) == 0x0009A4, "Member 'ACar_Copper_C::Emissive_Multiplier_2' has a wrong offset!");
static_assert(offsetof(ACar_Copper_C, Emissive_Multiplier) == 0x0009AC, "Member 'ACar_Copper_C::Emissive_Multiplier' has a wrong offset!");
static_assert(offsetof(ACar_Copper_C, Sound___HitAlarm) == 0x0009B4, "Member 'ACar_Copper_C::Sound___HitAlarm' has a wrong offset!");
static_assert(offsetof(ACar_Copper_C, Use_Emissive_2) == 0x0009B8, "Member 'ACar_Copper_C::Use_Emissive_2' has a wrong offset!");
static_assert(offsetof(ACar_Copper_C, Sound___Jump_on_Car) == 0x0009BC, "Member 'ACar_Copper_C::Sound___Jump_on_Car' has a wrong offset!");
static_assert(offsetof(ACar_Copper_C, SuspensionMovementAmount) == 0x0009C0, "Member 'ACar_Copper_C::SuspensionMovementAmount' has a wrong offset!");
static_assert(offsetof(ACar_Copper_C, ParticleEffectHas_NOT_AlreadyBeenTriggered) == 0x0009C4, "Member 'ACar_Copper_C::ParticleEffectHas_NOT_AlreadyBeenTriggered' has a wrong offset!");
static_assert(offsetof(ACar_Copper_C, EngineSteamParticleEffect) == 0x0009C8, "Member 'ACar_Copper_C::EngineSteamParticleEffect' has a wrong offset!");
static_assert(offsetof(ACar_Copper_C, Sound___Hit_AutoBody) == 0x0009CC, "Member 'ACar_Copper_C::Sound___Hit_AutoBody' has a wrong offset!");
static_assert(offsetof(ACar_Copper_C, canMakeJumpingNoiseAgain) == 0x0009D0, "Member 'ACar_Copper_C::canMakeJumpingNoiseAgain' has a wrong offset!");
static_assert(offsetof(ACar_Copper_C, CarAlarmIsCurrentlyMakingNoise) == 0x0009D1, "Member 'ACar_Copper_C::CarAlarmIsCurrentlyMakingNoise' has a wrong offset!");
static_assert(offsetof(ACar_Copper_C, ReplicatingUseCarAlarmBool) == 0x0009D2, "Member 'ACar_Copper_C::ReplicatingUseCarAlarmBool' has a wrong offset!");
static_assert(offsetof(ACar_Copper_C, RandomlyDisableSomeCarAlarms) == 0x0009D3, "Member 'ACar_Copper_C::RandomlyDisableSomeCarAlarms' has a wrong offset!");
static_assert(offsetof(ACar_Copper_C, PercentageChanceOfCarAlarmsBeingDisabled) == 0x0009D4, "Member 'ACar_Copper_C::PercentageChanceOfCarAlarmsBeingDisabled' has a wrong offset!");
static_assert(offsetof(ACar_Copper_C, interiorAlarmLight) == 0x0009D8, "Member 'ACar_Copper_C::interiorAlarmLight' has a wrong offset!");
static_assert(offsetof(ACar_Copper_C, HLight1) == 0x0009DC, "Member 'ACar_Copper_C::HLight1' has a wrong offset!");
static_assert(offsetof(ACar_Copper_C, AlarmLightSocketLocation) == 0x0009E0, "Member 'ACar_Copper_C::AlarmLightSocketLocation' has a wrong offset!");
static_assert(offsetof(ACar_Copper_C, HLight1SocketLocation) == 0x0009EC, "Member 'ACar_Copper_C::HLight1SocketLocation' has a wrong offset!");
static_assert(offsetof(ACar_Copper_C, HLight2SocketLocation) == 0x0009F8, "Member 'ACar_Copper_C::HLight2SocketLocation' has a wrong offset!");
static_assert(offsetof(ACar_Copper_C, AnimatingMIDArray) == 0x000A04, "Member 'ACar_Copper_C::AnimatingMIDArray' has a wrong offset!");
static_assert(offsetof(ACar_Copper_C, AudibleAlarmSound) == 0x000A10, "Member 'ACar_Copper_C::AudibleAlarmSound' has a wrong offset!");
static_assert(offsetof(ACar_Copper_C, UseCarBounce) == 0x000A14, "Member 'ACar_Copper_C::UseCarBounce' has a wrong offset!");
static_assert(offsetof(ACar_Copper_C, UseCarAlarm) == 0x000A15, "Member 'ACar_Copper_C::UseCarAlarm' has a wrong offset!");
static_assert(offsetof(ACar_Copper_C, Headlight_Brightness) == 0x000A18, "Member 'ACar_Copper_C::Headlight_Brightness' has a wrong offset!");
static_assert(offsetof(ACar_Copper_C, IsSetUseCarAlarmBoolInitialized) == 0x000A1C, "Member 'ACar_Copper_C::IsSetUseCarAlarmBoolInitialized' has a wrong offset!");

}

#pragma pack(pop)
