#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CloudSeeker

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass CloudSeeker.CloudSeeker_C
// 0x00D8 (0x0318 - 0x0240)
class ACloudSeeker_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0240(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class UProjectileMovementComponent*           ProjectileMovement_component;                      // 0x0244(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class USphereComponent*                       CollisionSphere;                                   // 0x0248(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UParticleSystemComponent*               InitialLaunchParticleSystem;                       // 0x024C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UPointLightComponent*                   ParticleLight;                                     // 0x0250(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UParticleSystemComponent*               ParticleTrail;                                     // 0x0254(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UBillboardComponent*                    Sprite1;                                           // 0x0258(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UFortSpline*                            MySpline;                                          // 0x025C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         positionAlongPathTime;                             // 0x0260(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         AnimationSpeed;                                    // 0x0264(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         LengthOfSpline;                                    // 0x0268(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                FutureRandomVector;                                // 0x026C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          findNewFutureRandomVector;                         // 0x0278(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_279[0x3];                                      // 0x0279(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         timeToGenerateNewRandomVector;                     // 0x027C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         DeltaTick;                                         // 0x0280(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                OldRandomVector;                                   // 0x0284(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         CurrentTotalTimeToNextVector;                      // 0x0290(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          HasEnoughSplineKnots;                              // 0x0294(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_295[0x3];                                      // 0x0295(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DeviationAmount;                                   // 0x0298(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         randomIntervalMax;                                 // 0x029C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         RandomIntervalMin;                                 // 0x02A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UCurveVector*                           CurveParamsTrollEffect;                            // 0x02A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         InitialLightBrightness;                            // 0x02A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Draw_Debug_Spline;                                 // 0x02AC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          AlreadyDead;                                       // 0x02AD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2AE[0x2];                                      // 0x02AE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        Debug_Path;                                        // 0x02B0(0x000C)(Edit, BlueprintVisible, ZeroConstructor)
	bool                                          Use_Debug_Path;                                    // 0x02BC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_2BD[0x3];                                      // 0x02BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        InternalPath;                                      // 0x02C0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn)
	class UCurveFloat*                            SpeedCurve;                                        // 0x02CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                PreviousFramePosition;                             // 0x02D0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                CurrentFramePosition;                              // 0x02DC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                CurrentVelocity;                                   // 0x02E8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               Object_orientation;                                // 0x02F4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UMaterialInstanceDynamic*               TrailMID;                                          // 0x0300(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          TickSkipped;                                       // 0x0304(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Debug_w_o_custom_events;                           // 0x0305(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Path_Set;                                          // 0x0306(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_307[0x1];                                      // 0x0307(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Speed;                                             // 0x0308(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         Spline_Duration;                                   // 0x030C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class ACorrectcloudStartBlueprint_C*          Correct_cloud_target_actor;                        // 0x0310(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          TransformInternalPoints;                           // 0x0314(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void ExecuteUbergraph_CloudSeeker(int32 EntryPoint);
	void BndEvt__CollisionSphere_K2Node_ComponentBoundEvent_78_ComponentBeginOverlapSignature__DelegateSignature(class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void ReceiveActorBeginOverlap(class AActor* OtherActor);
	void ReceivedAIPath();
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void UserConstructionScript();
	void CreateTheSpline(bool* Continue);
	void Get_Control_Points();
	void updateTargetLocation();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CloudSeeker_C">();
	}
	static class ACloudSeeker_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACloudSeeker_C>();
	}
};
static_assert(alignof(ACloudSeeker_C) == 0x000004, "Wrong alignment on ACloudSeeker_C");
static_assert(sizeof(ACloudSeeker_C) == 0x000318, "Wrong size on ACloudSeeker_C");
static_assert(offsetof(ACloudSeeker_C, UberGraphFrame) == 0x000240, "Member 'ACloudSeeker_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ACloudSeeker_C, ProjectileMovement_component) == 0x000244, "Member 'ACloudSeeker_C::ProjectileMovement_component' has a wrong offset!");
static_assert(offsetof(ACloudSeeker_C, CollisionSphere) == 0x000248, "Member 'ACloudSeeker_C::CollisionSphere' has a wrong offset!");
static_assert(offsetof(ACloudSeeker_C, InitialLaunchParticleSystem) == 0x00024C, "Member 'ACloudSeeker_C::InitialLaunchParticleSystem' has a wrong offset!");
static_assert(offsetof(ACloudSeeker_C, ParticleLight) == 0x000250, "Member 'ACloudSeeker_C::ParticleLight' has a wrong offset!");
static_assert(offsetof(ACloudSeeker_C, ParticleTrail) == 0x000254, "Member 'ACloudSeeker_C::ParticleTrail' has a wrong offset!");
static_assert(offsetof(ACloudSeeker_C, Sprite1) == 0x000258, "Member 'ACloudSeeker_C::Sprite1' has a wrong offset!");
static_assert(offsetof(ACloudSeeker_C, MySpline) == 0x00025C, "Member 'ACloudSeeker_C::MySpline' has a wrong offset!");
static_assert(offsetof(ACloudSeeker_C, positionAlongPathTime) == 0x000260, "Member 'ACloudSeeker_C::positionAlongPathTime' has a wrong offset!");
static_assert(offsetof(ACloudSeeker_C, AnimationSpeed) == 0x000264, "Member 'ACloudSeeker_C::AnimationSpeed' has a wrong offset!");
static_assert(offsetof(ACloudSeeker_C, LengthOfSpline) == 0x000268, "Member 'ACloudSeeker_C::LengthOfSpline' has a wrong offset!");
static_assert(offsetof(ACloudSeeker_C, FutureRandomVector) == 0x00026C, "Member 'ACloudSeeker_C::FutureRandomVector' has a wrong offset!");
static_assert(offsetof(ACloudSeeker_C, findNewFutureRandomVector) == 0x000278, "Member 'ACloudSeeker_C::findNewFutureRandomVector' has a wrong offset!");
static_assert(offsetof(ACloudSeeker_C, timeToGenerateNewRandomVector) == 0x00027C, "Member 'ACloudSeeker_C::timeToGenerateNewRandomVector' has a wrong offset!");
static_assert(offsetof(ACloudSeeker_C, DeltaTick) == 0x000280, "Member 'ACloudSeeker_C::DeltaTick' has a wrong offset!");
static_assert(offsetof(ACloudSeeker_C, OldRandomVector) == 0x000284, "Member 'ACloudSeeker_C::OldRandomVector' has a wrong offset!");
static_assert(offsetof(ACloudSeeker_C, CurrentTotalTimeToNextVector) == 0x000290, "Member 'ACloudSeeker_C::CurrentTotalTimeToNextVector' has a wrong offset!");
static_assert(offsetof(ACloudSeeker_C, HasEnoughSplineKnots) == 0x000294, "Member 'ACloudSeeker_C::HasEnoughSplineKnots' has a wrong offset!");
static_assert(offsetof(ACloudSeeker_C, DeviationAmount) == 0x000298, "Member 'ACloudSeeker_C::DeviationAmount' has a wrong offset!");
static_assert(offsetof(ACloudSeeker_C, randomIntervalMax) == 0x00029C, "Member 'ACloudSeeker_C::randomIntervalMax' has a wrong offset!");
static_assert(offsetof(ACloudSeeker_C, RandomIntervalMin) == 0x0002A0, "Member 'ACloudSeeker_C::RandomIntervalMin' has a wrong offset!");
static_assert(offsetof(ACloudSeeker_C, CurveParamsTrollEffect) == 0x0002A4, "Member 'ACloudSeeker_C::CurveParamsTrollEffect' has a wrong offset!");
static_assert(offsetof(ACloudSeeker_C, InitialLightBrightness) == 0x0002A8, "Member 'ACloudSeeker_C::InitialLightBrightness' has a wrong offset!");
static_assert(offsetof(ACloudSeeker_C, Draw_Debug_Spline) == 0x0002AC, "Member 'ACloudSeeker_C::Draw_Debug_Spline' has a wrong offset!");
static_assert(offsetof(ACloudSeeker_C, AlreadyDead) == 0x0002AD, "Member 'ACloudSeeker_C::AlreadyDead' has a wrong offset!");
static_assert(offsetof(ACloudSeeker_C, Debug_Path) == 0x0002B0, "Member 'ACloudSeeker_C::Debug_Path' has a wrong offset!");
static_assert(offsetof(ACloudSeeker_C, Use_Debug_Path) == 0x0002BC, "Member 'ACloudSeeker_C::Use_Debug_Path' has a wrong offset!");
static_assert(offsetof(ACloudSeeker_C, InternalPath) == 0x0002C0, "Member 'ACloudSeeker_C::InternalPath' has a wrong offset!");
static_assert(offsetof(ACloudSeeker_C, SpeedCurve) == 0x0002CC, "Member 'ACloudSeeker_C::SpeedCurve' has a wrong offset!");
static_assert(offsetof(ACloudSeeker_C, PreviousFramePosition) == 0x0002D0, "Member 'ACloudSeeker_C::PreviousFramePosition' has a wrong offset!");
static_assert(offsetof(ACloudSeeker_C, CurrentFramePosition) == 0x0002DC, "Member 'ACloudSeeker_C::CurrentFramePosition' has a wrong offset!");
static_assert(offsetof(ACloudSeeker_C, CurrentVelocity) == 0x0002E8, "Member 'ACloudSeeker_C::CurrentVelocity' has a wrong offset!");
static_assert(offsetof(ACloudSeeker_C, Object_orientation) == 0x0002F4, "Member 'ACloudSeeker_C::Object_orientation' has a wrong offset!");
static_assert(offsetof(ACloudSeeker_C, TrailMID) == 0x000300, "Member 'ACloudSeeker_C::TrailMID' has a wrong offset!");
static_assert(offsetof(ACloudSeeker_C, TickSkipped) == 0x000304, "Member 'ACloudSeeker_C::TickSkipped' has a wrong offset!");
static_assert(offsetof(ACloudSeeker_C, Debug_w_o_custom_events) == 0x000305, "Member 'ACloudSeeker_C::Debug_w_o_custom_events' has a wrong offset!");
static_assert(offsetof(ACloudSeeker_C, Path_Set) == 0x000306, "Member 'ACloudSeeker_C::Path_Set' has a wrong offset!");
static_assert(offsetof(ACloudSeeker_C, Speed) == 0x000308, "Member 'ACloudSeeker_C::Speed' has a wrong offset!");
static_assert(offsetof(ACloudSeeker_C, Spline_Duration) == 0x00030C, "Member 'ACloudSeeker_C::Spline_Duration' has a wrong offset!");
static_assert(offsetof(ACloudSeeker_C, Correct_cloud_target_actor) == 0x000310, "Member 'ACloudSeeker_C::Correct_cloud_target_actor' has a wrong offset!");
static_assert(offsetof(ACloudSeeker_C, TransformInternalPoints) == 0x000314, "Member 'ACloudSeeker_C::TransformInternalPoints' has a wrong offset!");

}

#pragma pack(pop)
