#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_DebugAttributeGain

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass GA_DebugAttributeGain.GA_DebugAttributeGain_C
// 0x000C (0x06E8 - 0x06DC)
class UGA_DebugAttributeGain_C final : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06DC(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class AFortPlayerPawn*                        Fort_Player_Pawn;                                  // 0x06E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UClass*                                 Debug_Attriubte_Gain;                              // 0x06E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_GA_DebugAttributeGain(int32 EntryPoint);
	void K2_ActivateAbility();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_DebugAttributeGain_C">();
	}
	static class UGA_DebugAttributeGain_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_DebugAttributeGain_C>();
	}
};
static_assert(alignof(UGA_DebugAttributeGain_C) == 0x000004, "Wrong alignment on UGA_DebugAttributeGain_C");
static_assert(sizeof(UGA_DebugAttributeGain_C) == 0x0006E8, "Wrong size on UGA_DebugAttributeGain_C");
static_assert(offsetof(UGA_DebugAttributeGain_C, UberGraphFrame) == 0x0006DC, "Member 'UGA_DebugAttributeGain_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_DebugAttributeGain_C, Fort_Player_Pawn) == 0x0006E0, "Member 'UGA_DebugAttributeGain_C::Fort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(UGA_DebugAttributeGain_C, Debug_Attriubte_Gain) == 0x0006E4, "Member 'UGA_DebugAttributeGain_C::Debug_Attriubte_Gain' has a wrong offset!");

}

#pragma pack(pop)
