#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_DefaultPlayer_TrapCreated

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function GA_DefaultPlayer_TrapCreated.GA_DefaultPlayer_TrapCreated_C.ExecuteUbergraph_GA_DefaultPlayer_TrapCreated
// 0x0080 (0x0080 - 0x0000)
struct GA_DefaultPlayer_TrapCreated_C_ExecuteUbergraph_GA_DefaultPlayer_TrapCreated final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0004(0x0058)(ConstParm)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromActor_ReturnValue;   // 0x0060(0x0014)()
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_ApplyGameplayEffectContainer_ReturnValue; // 0x0074(0x000C)(ConstParm, ZeroConstructor, ReferenceParm)
};
static_assert(alignof(GA_DefaultPlayer_TrapCreated_C_ExecuteUbergraph_GA_DefaultPlayer_TrapCreated) == 0x000004, "Wrong alignment on GA_DefaultPlayer_TrapCreated_C_ExecuteUbergraph_GA_DefaultPlayer_TrapCreated");
static_assert(sizeof(GA_DefaultPlayer_TrapCreated_C_ExecuteUbergraph_GA_DefaultPlayer_TrapCreated) == 0x000080, "Wrong size on GA_DefaultPlayer_TrapCreated_C_ExecuteUbergraph_GA_DefaultPlayer_TrapCreated");
static_assert(offsetof(GA_DefaultPlayer_TrapCreated_C_ExecuteUbergraph_GA_DefaultPlayer_TrapCreated, EntryPoint) == 0x000000, "Member 'GA_DefaultPlayer_TrapCreated_C_ExecuteUbergraph_GA_DefaultPlayer_TrapCreated::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_DefaultPlayer_TrapCreated_C_ExecuteUbergraph_GA_DefaultPlayer_TrapCreated, K2Node_Event_EventData) == 0x000004, "Member 'GA_DefaultPlayer_TrapCreated_C_ExecuteUbergraph_GA_DefaultPlayer_TrapCreated::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(GA_DefaultPlayer_TrapCreated_C_ExecuteUbergraph_GA_DefaultPlayer_TrapCreated, CallFunc_K2_CommitAbility_ReturnValue) == 0x00005C, "Member 'GA_DefaultPlayer_TrapCreated_C_ExecuteUbergraph_GA_DefaultPlayer_TrapCreated::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_DefaultPlayer_TrapCreated_C_ExecuteUbergraph_GA_DefaultPlayer_TrapCreated, CallFunc_AbilityTargetDataFromActor_ReturnValue) == 0x000060, "Member 'GA_DefaultPlayer_TrapCreated_C_ExecuteUbergraph_GA_DefaultPlayer_TrapCreated::CallFunc_AbilityTargetDataFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_DefaultPlayer_TrapCreated_C_ExecuteUbergraph_GA_DefaultPlayer_TrapCreated, CallFunc_ApplyGameplayEffectContainer_ReturnValue) == 0x000074, "Member 'GA_DefaultPlayer_TrapCreated_C_ExecuteUbergraph_GA_DefaultPlayer_TrapCreated::CallFunc_ApplyGameplayEffectContainer_ReturnValue' has a wrong offset!");

// Function GA_DefaultPlayer_TrapCreated.GA_DefaultPlayer_TrapCreated_C.K2_ActivateAbilityFromEvent
// 0x0058 (0x0058 - 0x0000)
struct GA_DefaultPlayer_TrapCreated_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x0058)(ConstParm, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_DefaultPlayer_TrapCreated_C_K2_ActivateAbilityFromEvent) == 0x000004, "Wrong alignment on GA_DefaultPlayer_TrapCreated_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(GA_DefaultPlayer_TrapCreated_C_K2_ActivateAbilityFromEvent) == 0x000058, "Wrong size on GA_DefaultPlayer_TrapCreated_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(GA_DefaultPlayer_TrapCreated_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'GA_DefaultPlayer_TrapCreated_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

}

#pragma pack(pop)
