#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_DebugAttributeGain

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function GA_DebugAttributeGain.GA_DebugAttributeGain_C.ExecuteUbergraph_GA_DebugAttributeGain
// 0x00DC (0x00DC - 0x0000)
struct GA_DebugAttributeGain_C_ExecuteUbergraph_GA_DebugAttributeGain final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue;                 // 0x0004(0x0034)(ContainsInstancedReference)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_MakeStruct_GameplayEventData;               // 0x0040(0x0058)()
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromActor_ReturnValue;   // 0x0098(0x0014)()
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x00AC(0x000C)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue; // 0x00BC(0x000C)()
	struct FActiveGameplayEffectHandle            CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue; // 0x00C8(0x0004)()
	int32                                         CallFunc_GetActiveGameplayEffectStackCount_ReturnValue; // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FString                                 CallFunc_BuildString_Int_ReturnValue;              // 0x00D0(0x000C)(ZeroConstructor)
};
static_assert(alignof(GA_DebugAttributeGain_C_ExecuteUbergraph_GA_DebugAttributeGain) == 0x000004, "Wrong alignment on GA_DebugAttributeGain_C_ExecuteUbergraph_GA_DebugAttributeGain");
static_assert(sizeof(GA_DebugAttributeGain_C_ExecuteUbergraph_GA_DebugAttributeGain) == 0x0000DC, "Wrong size on GA_DebugAttributeGain_C_ExecuteUbergraph_GA_DebugAttributeGain");
static_assert(offsetof(GA_DebugAttributeGain_C_ExecuteUbergraph_GA_DebugAttributeGain, EntryPoint) == 0x000000, "Member 'GA_DebugAttributeGain_C_ExecuteUbergraph_GA_DebugAttributeGain::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_DebugAttributeGain_C_ExecuteUbergraph_GA_DebugAttributeGain, CallFunc_GetActorInfo_ReturnValue) == 0x000004, "Member 'GA_DebugAttributeGain_C_ExecuteUbergraph_GA_DebugAttributeGain::CallFunc_GetActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_DebugAttributeGain_C_ExecuteUbergraph_GA_DebugAttributeGain, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000038, "Member 'GA_DebugAttributeGain_C_ExecuteUbergraph_GA_DebugAttributeGain::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GA_DebugAttributeGain_C_ExecuteUbergraph_GA_DebugAttributeGain, K2Node_DynamicCast_bSuccess) == 0x00003C, "Member 'GA_DebugAttributeGain_C_ExecuteUbergraph_GA_DebugAttributeGain::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_DebugAttributeGain_C_ExecuteUbergraph_GA_DebugAttributeGain, K2Node_MakeStruct_GameplayEventData) == 0x000040, "Member 'GA_DebugAttributeGain_C_ExecuteUbergraph_GA_DebugAttributeGain::K2Node_MakeStruct_GameplayEventData' has a wrong offset!");
static_assert(offsetof(GA_DebugAttributeGain_C_ExecuteUbergraph_GA_DebugAttributeGain, CallFunc_AbilityTargetDataFromActor_ReturnValue) == 0x000098, "Member 'GA_DebugAttributeGain_C_ExecuteUbergraph_GA_DebugAttributeGain::CallFunc_AbilityTargetDataFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_DebugAttributeGain_C_ExecuteUbergraph_GA_DebugAttributeGain, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x0000AC, "Member 'GA_DebugAttributeGain_C_ExecuteUbergraph_GA_DebugAttributeGain::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_DebugAttributeGain_C_ExecuteUbergraph_GA_DebugAttributeGain, CallFunc_K2_CommitAbility_ReturnValue) == 0x0000B8, "Member 'GA_DebugAttributeGain_C_ExecuteUbergraph_GA_DebugAttributeGain::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_DebugAttributeGain_C_ExecuteUbergraph_GA_DebugAttributeGain, CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue) == 0x0000BC, "Member 'GA_DebugAttributeGain_C_ExecuteUbergraph_GA_DebugAttributeGain::CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_DebugAttributeGain_C_ExecuteUbergraph_GA_DebugAttributeGain, CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue) == 0x0000C8, "Member 'GA_DebugAttributeGain_C_ExecuteUbergraph_GA_DebugAttributeGain::CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_DebugAttributeGain_C_ExecuteUbergraph_GA_DebugAttributeGain, CallFunc_GetActiveGameplayEffectStackCount_ReturnValue) == 0x0000CC, "Member 'GA_DebugAttributeGain_C_ExecuteUbergraph_GA_DebugAttributeGain::CallFunc_GetActiveGameplayEffectStackCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_DebugAttributeGain_C_ExecuteUbergraph_GA_DebugAttributeGain, CallFunc_BuildString_Int_ReturnValue) == 0x0000D0, "Member 'GA_DebugAttributeGain_C_ExecuteUbergraph_GA_DebugAttributeGain::CallFunc_BuildString_Int_ReturnValue' has a wrong offset!");

}

#pragma pack(pop)
