#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_DefaultPlayer_HarvestBuffSwitch

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// GameplayAbilityBlueprintGeneratedClass GA_DefaultPlayer_HarvestBuffSwitch.GA_DefaultPlayer_HarvestBuffSwitch_C
// 0x0098 (0x0774 - 0x06DC)
class UGA_DefaultPlayer_HarvestBuffSwitch_C final : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06DC(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayTagContainer                  TC_ImpactWeapon;                                   // 0x06E0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  TC_HarvestBuff_T1;                                 // 0x06F8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  TC_LaserFocus;                                     // 0x0710(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UClass*                                 GE_LaserFocus;                                     // 0x0728(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  TC_ImpactWeapon_Stick;                             // 0x072C(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  TC_ImpactWeapon_Pickaxe;                           // 0x0744(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  TC_HarvestBuff_T2;                                 // 0x075C(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_GA_DefaultPlayer_HarvestBuffSwitch(int32 EntryPoint);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_DefaultPlayer_HarvestBuffSwitch_C">();
	}
	static class UGA_DefaultPlayer_HarvestBuffSwitch_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_DefaultPlayer_HarvestBuffSwitch_C>();
	}
};
static_assert(alignof(UGA_DefaultPlayer_HarvestBuffSwitch_C) == 0x000004, "Wrong alignment on UGA_DefaultPlayer_HarvestBuffSwitch_C");
static_assert(sizeof(UGA_DefaultPlayer_HarvestBuffSwitch_C) == 0x000774, "Wrong size on UGA_DefaultPlayer_HarvestBuffSwitch_C");
static_assert(offsetof(UGA_DefaultPlayer_HarvestBuffSwitch_C, UberGraphFrame) == 0x0006DC, "Member 'UGA_DefaultPlayer_HarvestBuffSwitch_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_DefaultPlayer_HarvestBuffSwitch_C, TC_ImpactWeapon) == 0x0006E0, "Member 'UGA_DefaultPlayer_HarvestBuffSwitch_C::TC_ImpactWeapon' has a wrong offset!");
static_assert(offsetof(UGA_DefaultPlayer_HarvestBuffSwitch_C, TC_HarvestBuff_T1) == 0x0006F8, "Member 'UGA_DefaultPlayer_HarvestBuffSwitch_C::TC_HarvestBuff_T1' has a wrong offset!");
static_assert(offsetof(UGA_DefaultPlayer_HarvestBuffSwitch_C, TC_LaserFocus) == 0x000710, "Member 'UGA_DefaultPlayer_HarvestBuffSwitch_C::TC_LaserFocus' has a wrong offset!");
static_assert(offsetof(UGA_DefaultPlayer_HarvestBuffSwitch_C, GE_LaserFocus) == 0x000728, "Member 'UGA_DefaultPlayer_HarvestBuffSwitch_C::GE_LaserFocus' has a wrong offset!");
static_assert(offsetof(UGA_DefaultPlayer_HarvestBuffSwitch_C, TC_ImpactWeapon_Stick) == 0x00072C, "Member 'UGA_DefaultPlayer_HarvestBuffSwitch_C::TC_ImpactWeapon_Stick' has a wrong offset!");
static_assert(offsetof(UGA_DefaultPlayer_HarvestBuffSwitch_C, TC_ImpactWeapon_Pickaxe) == 0x000744, "Member 'UGA_DefaultPlayer_HarvestBuffSwitch_C::TC_ImpactWeapon_Pickaxe' has a wrong offset!");
static_assert(offsetof(UGA_DefaultPlayer_HarvestBuffSwitch_C, TC_HarvestBuff_T2) == 0x00075C, "Member 'UGA_DefaultPlayer_HarvestBuffSwitch_C::TC_HarvestBuff_T2' has a wrong offset!");

}

#pragma pack(pop)
