#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_DefaultPlayer_Stunned

#include "Basic.hpp"

#include "GAB_GenericStunned_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass GA_DefaultPlayer_Stunned.GA_DefaultPlayer_Stunned_C
// 0x0068 (0x0748 - 0x06E0)
class UGA_DefaultPlayer_Stunned_C final : public UGAB_GenericStunned_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_DefaultPlayer_Stunned_C;         // 0x06E0(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class UAnimMontage*                           TakerSoulSuckVictimMontage;                        // 0x06E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FGameplayTag                           TC_GT_NPCAbilityAttackMeleeSoulSuck;               // 0x06E8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           TC_NPCAbilityAttackMeleeSoulSuckRelease;           // 0x06F0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  TC_NPCAbilityAttackMeleeSoulSuck;                  // 0x06F8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class AFortPawn*                              PlayerPawn;                                        // 0x0710(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class FName                                   SoulSuckMontageSection;                            // 0x0714(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class FName                                   SoulSuckCurrentMontageSection;                     // 0x071C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         SoulSuckGoalActorNormalizedHealth;                 // 0x0724(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FFortFeedbackHandle                    StunFeedbackEvent;                                 // 0x0728(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UClass*                                 SoulSuckCameraShake;                               // 0x0738(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UCameraAnimInst*                        SoulSuckCameraAnimInst;                            // 0x073C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class APlayerCameraManager*                   PlayerCameraManager;                               // 0x0740(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class APlayerController*                      PlayerController;                                  // 0x0744(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_GA_DefaultPlayer_Stunned(int32 EntryPoint);
	void SoulSuckEndCheck();
	void ResetSoulSuckRelease();
	void SoulSuckCheck();
	void ResetSoulSuckLift();
	void K2_OnEndAbility();
	void K2_ActivateAbility();
	void OnComplete_B4CDDE17442A807B7592E7A70F4F6DEF();
	void OnInterrupted_B4CDDE17442A807B7592E7A70F4F6DEF();
	void OnCancelled_B4CDDE17442A807B7592E7A70F4F6DEF();
	void OnComplete_F3FA8C4A4CF8BA1E44F6768A402E7D71();
	void OnInterrupted_F3FA8C4A4CF8BA1E44F6768A402E7D71();
	void Triggered_3C8EA97E467ED88E163FF0B4F830736D(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Cancelled_3C8EA97E467ED88E163FF0B4F830736D(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Completed_3C8EA97E467ED88E163FF0B4F830736D(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_DefaultPlayer_Stunned_C">();
	}
	static class UGA_DefaultPlayer_Stunned_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_DefaultPlayer_Stunned_C>();
	}
};
static_assert(alignof(UGA_DefaultPlayer_Stunned_C) == 0x000004, "Wrong alignment on UGA_DefaultPlayer_Stunned_C");
static_assert(sizeof(UGA_DefaultPlayer_Stunned_C) == 0x000748, "Wrong size on UGA_DefaultPlayer_Stunned_C");
static_assert(offsetof(UGA_DefaultPlayer_Stunned_C, UberGraphFrame_GA_DefaultPlayer_Stunned_C) == 0x0006E0, "Member 'UGA_DefaultPlayer_Stunned_C::UberGraphFrame_GA_DefaultPlayer_Stunned_C' has a wrong offset!");
static_assert(offsetof(UGA_DefaultPlayer_Stunned_C, TakerSoulSuckVictimMontage) == 0x0006E4, "Member 'UGA_DefaultPlayer_Stunned_C::TakerSoulSuckVictimMontage' has a wrong offset!");
static_assert(offsetof(UGA_DefaultPlayer_Stunned_C, TC_GT_NPCAbilityAttackMeleeSoulSuck) == 0x0006E8, "Member 'UGA_DefaultPlayer_Stunned_C::TC_GT_NPCAbilityAttackMeleeSoulSuck' has a wrong offset!");
static_assert(offsetof(UGA_DefaultPlayer_Stunned_C, TC_NPCAbilityAttackMeleeSoulSuckRelease) == 0x0006F0, "Member 'UGA_DefaultPlayer_Stunned_C::TC_NPCAbilityAttackMeleeSoulSuckRelease' has a wrong offset!");
static_assert(offsetof(UGA_DefaultPlayer_Stunned_C, TC_NPCAbilityAttackMeleeSoulSuck) == 0x0006F8, "Member 'UGA_DefaultPlayer_Stunned_C::TC_NPCAbilityAttackMeleeSoulSuck' has a wrong offset!");
static_assert(offsetof(UGA_DefaultPlayer_Stunned_C, PlayerPawn) == 0x000710, "Member 'UGA_DefaultPlayer_Stunned_C::PlayerPawn' has a wrong offset!");
static_assert(offsetof(UGA_DefaultPlayer_Stunned_C, SoulSuckMontageSection) == 0x000714, "Member 'UGA_DefaultPlayer_Stunned_C::SoulSuckMontageSection' has a wrong offset!");
static_assert(offsetof(UGA_DefaultPlayer_Stunned_C, SoulSuckCurrentMontageSection) == 0x00071C, "Member 'UGA_DefaultPlayer_Stunned_C::SoulSuckCurrentMontageSection' has a wrong offset!");
static_assert(offsetof(UGA_DefaultPlayer_Stunned_C, SoulSuckGoalActorNormalizedHealth) == 0x000724, "Member 'UGA_DefaultPlayer_Stunned_C::SoulSuckGoalActorNormalizedHealth' has a wrong offset!");
static_assert(offsetof(UGA_DefaultPlayer_Stunned_C, StunFeedbackEvent) == 0x000728, "Member 'UGA_DefaultPlayer_Stunned_C::StunFeedbackEvent' has a wrong offset!");
static_assert(offsetof(UGA_DefaultPlayer_Stunned_C, SoulSuckCameraShake) == 0x000738, "Member 'UGA_DefaultPlayer_Stunned_C::SoulSuckCameraShake' has a wrong offset!");
static_assert(offsetof(UGA_DefaultPlayer_Stunned_C, SoulSuckCameraAnimInst) == 0x00073C, "Member 'UGA_DefaultPlayer_Stunned_C::SoulSuckCameraAnimInst' has a wrong offset!");
static_assert(offsetof(UGA_DefaultPlayer_Stunned_C, PlayerCameraManager) == 0x000740, "Member 'UGA_DefaultPlayer_Stunned_C::PlayerCameraManager' has a wrong offset!");
static_assert(offsetof(UGA_DefaultPlayer_Stunned_C, PlayerController) == 0x000744, "Member 'UGA_DefaultPlayer_Stunned_C::PlayerController' has a wrong offset!");

}

#pragma pack(pop)
