#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_NPC_ElementalDamage

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function GA_NPC_ElementalDamage.GA_NPC_ElementalDamage_C.ExecuteUbergraph_GA_NPC_ElementalDamage
// 0x0078 (0x0078 - 0x0000)
struct GA_NPC_ElementalDamage_C_ExecuteUbergraph_GA_NPC_ElementalDamage final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0004(0x0058)(ConstParm)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingSMActor*                       K2Node_DynamicCast_AsBuilding_SMActor;             // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortAIPawn*                            K2Node_DynamicCast_AsFort_AIPawn;                  // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_NPC_ElementalDamage_C_ExecuteUbergraph_GA_NPC_ElementalDamage) == 0x000004, "Wrong alignment on GA_NPC_ElementalDamage_C_ExecuteUbergraph_GA_NPC_ElementalDamage");
static_assert(sizeof(GA_NPC_ElementalDamage_C_ExecuteUbergraph_GA_NPC_ElementalDamage) == 0x000078, "Wrong size on GA_NPC_ElementalDamage_C_ExecuteUbergraph_GA_NPC_ElementalDamage");
static_assert(offsetof(GA_NPC_ElementalDamage_C_ExecuteUbergraph_GA_NPC_ElementalDamage, EntryPoint) == 0x000000, "Member 'GA_NPC_ElementalDamage_C_ExecuteUbergraph_GA_NPC_ElementalDamage::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_NPC_ElementalDamage_C_ExecuteUbergraph_GA_NPC_ElementalDamage, K2Node_Event_EventData) == 0x000004, "Member 'GA_NPC_ElementalDamage_C_ExecuteUbergraph_GA_NPC_ElementalDamage::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(GA_NPC_ElementalDamage_C_ExecuteUbergraph_GA_NPC_ElementalDamage, CallFunc_K2_CommitAbility_ReturnValue) == 0x00005C, "Member 'GA_NPC_ElementalDamage_C_ExecuteUbergraph_GA_NPC_ElementalDamage::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NPC_ElementalDamage_C_ExecuteUbergraph_GA_NPC_ElementalDamage, K2Node_DynamicCast_AsBuilding_SMActor) == 0x000060, "Member 'GA_NPC_ElementalDamage_C_ExecuteUbergraph_GA_NPC_ElementalDamage::K2Node_DynamicCast_AsBuilding_SMActor' has a wrong offset!");
static_assert(offsetof(GA_NPC_ElementalDamage_C_ExecuteUbergraph_GA_NPC_ElementalDamage, K2Node_DynamicCast_bSuccess) == 0x000064, "Member 'GA_NPC_ElementalDamage_C_ExecuteUbergraph_GA_NPC_ElementalDamage::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_NPC_ElementalDamage_C_ExecuteUbergraph_GA_NPC_ElementalDamage, K2Node_DynamicCast_AsFort_Pawn) == 0x000068, "Member 'GA_NPC_ElementalDamage_C_ExecuteUbergraph_GA_NPC_ElementalDamage::K2Node_DynamicCast_AsFort_Pawn' has a wrong offset!");
static_assert(offsetof(GA_NPC_ElementalDamage_C_ExecuteUbergraph_GA_NPC_ElementalDamage, K2Node_DynamicCast_bSuccess2) == 0x00006C, "Member 'GA_NPC_ElementalDamage_C_ExecuteUbergraph_GA_NPC_ElementalDamage::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(GA_NPC_ElementalDamage_C_ExecuteUbergraph_GA_NPC_ElementalDamage, K2Node_DynamicCast_AsFort_AIPawn) == 0x000070, "Member 'GA_NPC_ElementalDamage_C_ExecuteUbergraph_GA_NPC_ElementalDamage::K2Node_DynamicCast_AsFort_AIPawn' has a wrong offset!");
static_assert(offsetof(GA_NPC_ElementalDamage_C_ExecuteUbergraph_GA_NPC_ElementalDamage, K2Node_DynamicCast_bSuccess3) == 0x000074, "Member 'GA_NPC_ElementalDamage_C_ExecuteUbergraph_GA_NPC_ElementalDamage::K2Node_DynamicCast_bSuccess3' has a wrong offset!");

// Function GA_NPC_ElementalDamage.GA_NPC_ElementalDamage_C.K2_ActivateAbilityFromEvent
// 0x0058 (0x0058 - 0x0000)
struct GA_NPC_ElementalDamage_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x0058)(ConstParm, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_NPC_ElementalDamage_C_K2_ActivateAbilityFromEvent) == 0x000004, "Wrong alignment on GA_NPC_ElementalDamage_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(GA_NPC_ElementalDamage_C_K2_ActivateAbilityFromEvent) == 0x000058, "Wrong size on GA_NPC_ElementalDamage_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(GA_NPC_ElementalDamage_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'GA_NPC_ElementalDamage_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

// Function GA_NPC_ElementalDamage.GA_NPC_ElementalDamage_C.Apply Elemental EffectsToPawn
// 0x009C (0x009C - 0x0000)
struct GA_NPC_ElementalDamage_C_Apply_Elemental_EffectsToPawn final
{
public:
	class AFortAIPawn*                            FortAIPawn;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortPawn*                              TargetActor;                                       // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         DamageDealt;                                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromActor_ReturnValue;   // 0x000C(0x0014)()
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_FFloor_ReturnValue;                       // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue2;         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_FFloor_ReturnValue2;                      // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_FFloor_ReturnValue3;                      // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x0038(0x000C)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_GetNumGameplayTagsInContainer_ReturnValue; // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetNumGameplayTagsInContainer_ReturnValue2; // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue2;         // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E[0x2];                                       // 0x004E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAllMatchingGameplayTags_self_CastInput; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAllMatchingGameplayTags_ReturnValue;   // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAllMatchingGameplayTags_self2_CastInput; // 0x005C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAllMatchingGameplayTags_ReturnValue2;  // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x0066(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_67[0x1];                                       // 0x0067(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumGameplayTagsInContainer_ReturnValue3; // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetNumGameplayTagsInContainer_ReturnValue4; // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue3;         // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue4;         // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72[0x2];                                       // 0x0072(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAllMatchingGameplayTags_self3_CastInput; // 0x0074(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAllMatchingGameplayTags_ReturnValue3;  // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAllMatchingGameplayTags_self4_CastInput; // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAllMatchingGameplayTags_ReturnValue4;  // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue3;                  // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue4;                  // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8B[0x1];                                       // 0x008B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumGameplayTagsInContainer_ReturnValue5; // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAllMatchingGameplayTags_self5_CastInput; // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAllMatchingGameplayTags_ReturnValue5;  // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue5;         // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue5;                  // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_NPC_ElementalDamage_C_Apply_Elemental_EffectsToPawn) == 0x000004, "Wrong alignment on GA_NPC_ElementalDamage_C_Apply_Elemental_EffectsToPawn");
static_assert(sizeof(GA_NPC_ElementalDamage_C_Apply_Elemental_EffectsToPawn) == 0x00009C, "Wrong size on GA_NPC_ElementalDamage_C_Apply_Elemental_EffectsToPawn");
static_assert(offsetof(GA_NPC_ElementalDamage_C_Apply_Elemental_EffectsToPawn, FortAIPawn) == 0x000000, "Member 'GA_NPC_ElementalDamage_C_Apply_Elemental_EffectsToPawn::FortAIPawn' has a wrong offset!");
static_assert(offsetof(GA_NPC_ElementalDamage_C_Apply_Elemental_EffectsToPawn, TargetActor) == 0x000004, "Member 'GA_NPC_ElementalDamage_C_Apply_Elemental_EffectsToPawn::TargetActor' has a wrong offset!");
static_assert(offsetof(GA_NPC_ElementalDamage_C_Apply_Elemental_EffectsToPawn, DamageDealt) == 0x000008, "Member 'GA_NPC_ElementalDamage_C_Apply_Elemental_EffectsToPawn::DamageDealt' has a wrong offset!");
static_assert(offsetof(GA_NPC_ElementalDamage_C_Apply_Elemental_EffectsToPawn, CallFunc_AbilityTargetDataFromActor_ReturnValue) == 0x00000C, "Member 'GA_NPC_ElementalDamage_C_Apply_Elemental_EffectsToPawn::CallFunc_AbilityTargetDataFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NPC_ElementalDamage_C_Apply_Elemental_EffectsToPawn, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000020, "Member 'GA_NPC_ElementalDamage_C_Apply_Elemental_EffectsToPawn::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NPC_ElementalDamage_C_Apply_Elemental_EffectsToPawn, CallFunc_FFloor_ReturnValue) == 0x000024, "Member 'GA_NPC_ElementalDamage_C_Apply_Elemental_EffectsToPawn::CallFunc_FFloor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NPC_ElementalDamage_C_Apply_Elemental_EffectsToPawn, CallFunc_Multiply_FloatFloat_ReturnValue2) == 0x000028, "Member 'GA_NPC_ElementalDamage_C_Apply_Elemental_EffectsToPawn::CallFunc_Multiply_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_NPC_ElementalDamage_C_Apply_Elemental_EffectsToPawn, CallFunc_FFloor_ReturnValue2) == 0x00002C, "Member 'GA_NPC_ElementalDamage_C_Apply_Elemental_EffectsToPawn::CallFunc_FFloor_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_NPC_ElementalDamage_C_Apply_Elemental_EffectsToPawn, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000030, "Member 'GA_NPC_ElementalDamage_C_Apply_Elemental_EffectsToPawn::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NPC_ElementalDamage_C_Apply_Elemental_EffectsToPawn, CallFunc_FFloor_ReturnValue3) == 0x000034, "Member 'GA_NPC_ElementalDamage_C_Apply_Elemental_EffectsToPawn::CallFunc_FFloor_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_NPC_ElementalDamage_C_Apply_Elemental_EffectsToPawn, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x000038, "Member 'GA_NPC_ElementalDamage_C_Apply_Elemental_EffectsToPawn::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NPC_ElementalDamage_C_Apply_Elemental_EffectsToPawn, CallFunc_GetNumGameplayTagsInContainer_ReturnValue) == 0x000044, "Member 'GA_NPC_ElementalDamage_C_Apply_Elemental_EffectsToPawn::CallFunc_GetNumGameplayTagsInContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NPC_ElementalDamage_C_Apply_Elemental_EffectsToPawn, CallFunc_GetNumGameplayTagsInContainer_ReturnValue2) == 0x000048, "Member 'GA_NPC_ElementalDamage_C_Apply_Elemental_EffectsToPawn::CallFunc_GetNumGameplayTagsInContainer_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_NPC_ElementalDamage_C_Apply_Elemental_EffectsToPawn, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00004C, "Member 'GA_NPC_ElementalDamage_C_Apply_Elemental_EffectsToPawn::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NPC_ElementalDamage_C_Apply_Elemental_EffectsToPawn, CallFunc_GreaterEqual_IntInt_ReturnValue2) == 0x00004D, "Member 'GA_NPC_ElementalDamage_C_Apply_Elemental_EffectsToPawn::CallFunc_GreaterEqual_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_NPC_ElementalDamage_C_Apply_Elemental_EffectsToPawn, CallFunc_HasAllMatchingGameplayTags_self_CastInput) == 0x000050, "Member 'GA_NPC_ElementalDamage_C_Apply_Elemental_EffectsToPawn::CallFunc_HasAllMatchingGameplayTags_self_CastInput' has a wrong offset!");
static_assert(offsetof(GA_NPC_ElementalDamage_C_Apply_Elemental_EffectsToPawn, CallFunc_HasAllMatchingGameplayTags_ReturnValue) == 0x000058, "Member 'GA_NPC_ElementalDamage_C_Apply_Elemental_EffectsToPawn::CallFunc_HasAllMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NPC_ElementalDamage_C_Apply_Elemental_EffectsToPawn, CallFunc_HasAllMatchingGameplayTags_self2_CastInput) == 0x00005C, "Member 'GA_NPC_ElementalDamage_C_Apply_Elemental_EffectsToPawn::CallFunc_HasAllMatchingGameplayTags_self2_CastInput' has a wrong offset!");
static_assert(offsetof(GA_NPC_ElementalDamage_C_Apply_Elemental_EffectsToPawn, CallFunc_HasAllMatchingGameplayTags_ReturnValue2) == 0x000064, "Member 'GA_NPC_ElementalDamage_C_Apply_Elemental_EffectsToPawn::CallFunc_HasAllMatchingGameplayTags_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_NPC_ElementalDamage_C_Apply_Elemental_EffectsToPawn, CallFunc_BooleanAND_ReturnValue) == 0x000065, "Member 'GA_NPC_ElementalDamage_C_Apply_Elemental_EffectsToPawn::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NPC_ElementalDamage_C_Apply_Elemental_EffectsToPawn, CallFunc_BooleanAND_ReturnValue2) == 0x000066, "Member 'GA_NPC_ElementalDamage_C_Apply_Elemental_EffectsToPawn::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_NPC_ElementalDamage_C_Apply_Elemental_EffectsToPawn, CallFunc_GetNumGameplayTagsInContainer_ReturnValue3) == 0x000068, "Member 'GA_NPC_ElementalDamage_C_Apply_Elemental_EffectsToPawn::CallFunc_GetNumGameplayTagsInContainer_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_NPC_ElementalDamage_C_Apply_Elemental_EffectsToPawn, CallFunc_GetNumGameplayTagsInContainer_ReturnValue4) == 0x00006C, "Member 'GA_NPC_ElementalDamage_C_Apply_Elemental_EffectsToPawn::CallFunc_GetNumGameplayTagsInContainer_ReturnValue4' has a wrong offset!");
static_assert(offsetof(GA_NPC_ElementalDamage_C_Apply_Elemental_EffectsToPawn, CallFunc_GreaterEqual_IntInt_ReturnValue3) == 0x000070, "Member 'GA_NPC_ElementalDamage_C_Apply_Elemental_EffectsToPawn::CallFunc_GreaterEqual_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_NPC_ElementalDamage_C_Apply_Elemental_EffectsToPawn, CallFunc_GreaterEqual_IntInt_ReturnValue4) == 0x000071, "Member 'GA_NPC_ElementalDamage_C_Apply_Elemental_EffectsToPawn::CallFunc_GreaterEqual_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(GA_NPC_ElementalDamage_C_Apply_Elemental_EffectsToPawn, CallFunc_HasAllMatchingGameplayTags_self3_CastInput) == 0x000074, "Member 'GA_NPC_ElementalDamage_C_Apply_Elemental_EffectsToPawn::CallFunc_HasAllMatchingGameplayTags_self3_CastInput' has a wrong offset!");
static_assert(offsetof(GA_NPC_ElementalDamage_C_Apply_Elemental_EffectsToPawn, CallFunc_HasAllMatchingGameplayTags_ReturnValue3) == 0x00007C, "Member 'GA_NPC_ElementalDamage_C_Apply_Elemental_EffectsToPawn::CallFunc_HasAllMatchingGameplayTags_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_NPC_ElementalDamage_C_Apply_Elemental_EffectsToPawn, CallFunc_HasAllMatchingGameplayTags_self4_CastInput) == 0x000080, "Member 'GA_NPC_ElementalDamage_C_Apply_Elemental_EffectsToPawn::CallFunc_HasAllMatchingGameplayTags_self4_CastInput' has a wrong offset!");
static_assert(offsetof(GA_NPC_ElementalDamage_C_Apply_Elemental_EffectsToPawn, CallFunc_HasAllMatchingGameplayTags_ReturnValue4) == 0x000088, "Member 'GA_NPC_ElementalDamage_C_Apply_Elemental_EffectsToPawn::CallFunc_HasAllMatchingGameplayTags_ReturnValue4' has a wrong offset!");
static_assert(offsetof(GA_NPC_ElementalDamage_C_Apply_Elemental_EffectsToPawn, CallFunc_BooleanAND_ReturnValue3) == 0x000089, "Member 'GA_NPC_ElementalDamage_C_Apply_Elemental_EffectsToPawn::CallFunc_BooleanAND_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_NPC_ElementalDamage_C_Apply_Elemental_EffectsToPawn, CallFunc_BooleanAND_ReturnValue4) == 0x00008A, "Member 'GA_NPC_ElementalDamage_C_Apply_Elemental_EffectsToPawn::CallFunc_BooleanAND_ReturnValue4' has a wrong offset!");
static_assert(offsetof(GA_NPC_ElementalDamage_C_Apply_Elemental_EffectsToPawn, CallFunc_GetNumGameplayTagsInContainer_ReturnValue5) == 0x00008C, "Member 'GA_NPC_ElementalDamage_C_Apply_Elemental_EffectsToPawn::CallFunc_GetNumGameplayTagsInContainer_ReturnValue5' has a wrong offset!");
static_assert(offsetof(GA_NPC_ElementalDamage_C_Apply_Elemental_EffectsToPawn, CallFunc_HasAllMatchingGameplayTags_self5_CastInput) == 0x000090, "Member 'GA_NPC_ElementalDamage_C_Apply_Elemental_EffectsToPawn::CallFunc_HasAllMatchingGameplayTags_self5_CastInput' has a wrong offset!");
static_assert(offsetof(GA_NPC_ElementalDamage_C_Apply_Elemental_EffectsToPawn, CallFunc_HasAllMatchingGameplayTags_ReturnValue5) == 0x000098, "Member 'GA_NPC_ElementalDamage_C_Apply_Elemental_EffectsToPawn::CallFunc_HasAllMatchingGameplayTags_ReturnValue5' has a wrong offset!");
static_assert(offsetof(GA_NPC_ElementalDamage_C_Apply_Elemental_EffectsToPawn, CallFunc_GreaterEqual_IntInt_ReturnValue5) == 0x000099, "Member 'GA_NPC_ElementalDamage_C_Apply_Elemental_EffectsToPawn::CallFunc_GreaterEqual_IntInt_ReturnValue5' has a wrong offset!");
static_assert(offsetof(GA_NPC_ElementalDamage_C_Apply_Elemental_EffectsToPawn, CallFunc_BooleanAND_ReturnValue5) == 0x00009A, "Member 'GA_NPC_ElementalDamage_C_Apply_Elemental_EffectsToPawn::CallFunc_BooleanAND_ReturnValue5' has a wrong offset!");

// Function GA_NPC_ElementalDamage.GA_NPC_ElementalDamage_C.ApplyElementalEffectstoBuilding
// 0x0090 (0x0090 - 0x0000)
struct GA_NPC_ElementalDamage_C_ApplyElementalEffectstoBuilding final
{
public:
	class AFortAIPawn*                            FortAIPawn;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class ABuildingSMActor*                       TargetActor;                                       // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         DamageDealt;                                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_FFloor_ReturnValue;                       // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromActor_ReturnValue;   // 0x0010(0x0014)()
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum3_CmpSuccess;                     // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27[0x1];                                       // 0x0027(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumGameplayTagsInContainer_ReturnValue; // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetNumGameplayTagsInContainer_ReturnValue2; // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue2;         // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAllMatchingGameplayTags_self_CastInput; // 0x0034(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAllMatchingGameplayTags_ReturnValue;   // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumGameplayTagsInContainer_ReturnValue3; // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue3;         // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46[0x2];                                       // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAllMatchingGameplayTags_self2_CastInput; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAllMatchingGameplayTags_ReturnValue2;  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAllMatchingGameplayTags_self3_CastInput; // 0x0054(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAllMatchingGameplayTags_ReturnValue3;  // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue3;                  // 0x005E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F[0x1];                                       // 0x005F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumGameplayTagsInContainer_ReturnValue4; // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetNumGameplayTagsInContainer_ReturnValue5; // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue4;         // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue5;         // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A[0x2];                                       // 0x006A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAllMatchingGameplayTags_self4_CastInput; // 0x006C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAllMatchingGameplayTags_ReturnValue4;  // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAllMatchingGameplayTags_self5_CastInput; // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAllMatchingGameplayTags_ReturnValue5;  // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue4;                  // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue5;                  // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_83[0x1];                                       // 0x0083(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x0084(0x000C)(ZeroConstructor, ReferenceParm)
};
static_assert(alignof(GA_NPC_ElementalDamage_C_ApplyElementalEffectstoBuilding) == 0x000004, "Wrong alignment on GA_NPC_ElementalDamage_C_ApplyElementalEffectstoBuilding");
static_assert(sizeof(GA_NPC_ElementalDamage_C_ApplyElementalEffectstoBuilding) == 0x000090, "Wrong size on GA_NPC_ElementalDamage_C_ApplyElementalEffectstoBuilding");
static_assert(offsetof(GA_NPC_ElementalDamage_C_ApplyElementalEffectstoBuilding, FortAIPawn) == 0x000000, "Member 'GA_NPC_ElementalDamage_C_ApplyElementalEffectstoBuilding::FortAIPawn' has a wrong offset!");
static_assert(offsetof(GA_NPC_ElementalDamage_C_ApplyElementalEffectstoBuilding, TargetActor) == 0x000004, "Member 'GA_NPC_ElementalDamage_C_ApplyElementalEffectstoBuilding::TargetActor' has a wrong offset!");
