#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_SentryGun_Deployment

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "CoreUObject_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass GA_SentryGun_Deployment.GA_SentryGun_Deployment_C
// 0x003C (0x0718 - 0x06DC)
class UGA_SentryGun_Deployment_C final : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06DC(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class UClass*                                 SentryGunClass;                                    // 0x06E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                PlacementOffset;                                   // 0x06E4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UAnimMontage*                           PlacementMontage;                                  // 0x06F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class AFortAbilityDecoTool*                   DecoTool;                                          // 0x06F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FAbilityToolSpawnParameters            SpawnParameters;                                   // 0x06F8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_GA_SentryGun_Deployment(int32 EntryPoint);
	void K2_ActivateAbility();
	void OnComplete_387F05EC44E79E9A30983C9DECC9ADE7();
	void OnInterrupted_387F05EC44E79E9A30983C9DECC9ADE7();
	void OnCancelled_387F05EC44E79E9A30983C9DECC9ADE7();
	void TempStatScaling(class AFortPawn* InstigatorPawn, class AActor* SentryGun);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_SentryGun_Deployment_C">();
	}
	static class UGA_SentryGun_Deployment_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_SentryGun_Deployment_C>();
	}
};
static_assert(alignof(UGA_SentryGun_Deployment_C) == 0x000004, "Wrong alignment on UGA_SentryGun_Deployment_C");
static_assert(sizeof(UGA_SentryGun_Deployment_C) == 0x000718, "Wrong size on UGA_SentryGun_Deployment_C");
static_assert(offsetof(UGA_SentryGun_Deployment_C, UberGraphFrame) == 0x0006DC, "Member 'UGA_SentryGun_Deployment_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_SentryGun_Deployment_C, SentryGunClass) == 0x0006E0, "Member 'UGA_SentryGun_Deployment_C::SentryGunClass' has a wrong offset!");
static_assert(offsetof(UGA_SentryGun_Deployment_C, PlacementOffset) == 0x0006E4, "Member 'UGA_SentryGun_Deployment_C::PlacementOffset' has a wrong offset!");
static_assert(offsetof(UGA_SentryGun_Deployment_C, PlacementMontage) == 0x0006F0, "Member 'UGA_SentryGun_Deployment_C::PlacementMontage' has a wrong offset!");
static_assert(offsetof(UGA_SentryGun_Deployment_C, DecoTool) == 0x0006F4, "Member 'UGA_SentryGun_Deployment_C::DecoTool' has a wrong offset!");
static_assert(offsetof(UGA_SentryGun_Deployment_C, SpawnParameters) == 0x0006F8, "Member 'UGA_SentryGun_Deployment_C::SpawnParameters' has a wrong offset!");

}

#pragma pack(pop)
