#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_SentryGun_Deployment

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function GA_SentryGun_Deployment.GA_SentryGun_Deployment_C.ExecuteUbergraph_GA_SentryGun_Deployment
// 0x0078 (0x0078 - 0x0000)
struct GA_SentryGun_Deployment_C_ExecuteUbergraph_GA_SentryGun_Deployment final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	struct FAbilityToolSpawnParameters            CallFunc_GetSpawnParameters_OutSpawnParamters;     // 0x0024(0x0020)()
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue; // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x004C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortAbilityDecoTool*                   K2Node_DynamicCast_AsFort_Ability_Deco_Tool;       // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingActor*                         CallFunc_AbilitySpawnDeco_ReturnValue;             // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_SentryGun_Deployment_C_ExecuteUbergraph_GA_SentryGun_Deployment) == 0x000004, "Wrong alignment on GA_SentryGun_Deployment_C_ExecuteUbergraph_GA_SentryGun_Deployment");
static_assert(sizeof(GA_SentryGun_Deployment_C_ExecuteUbergraph_GA_SentryGun_Deployment) == 0x000078, "Wrong size on GA_SentryGun_Deployment_C_ExecuteUbergraph_GA_SentryGun_Deployment");
static_assert(offsetof(GA_SentryGun_Deployment_C_ExecuteUbergraph_GA_SentryGun_Deployment, EntryPoint) == 0x000000, "Member 'GA_SentryGun_Deployment_C_ExecuteUbergraph_GA_SentryGun_Deployment::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_SentryGun_Deployment_C_ExecuteUbergraph_GA_SentryGun_Deployment, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'GA_SentryGun_Deployment_C_ExecuteUbergraph_GA_SentryGun_Deployment::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_SentryGun_Deployment_C_ExecuteUbergraph_GA_SentryGun_Deployment, K2Node_CreateDelegate_OutputDelegate2) == 0x000014, "Member 'GA_SentryGun_Deployment_C_ExecuteUbergraph_GA_SentryGun_Deployment::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GA_SentryGun_Deployment_C_ExecuteUbergraph_GA_SentryGun_Deployment, CallFunc_GetSpawnParameters_OutSpawnParamters) == 0x000024, "Member 'GA_SentryGun_Deployment_C_ExecuteUbergraph_GA_SentryGun_Deployment::CallFunc_GetSpawnParameters_OutSpawnParamters' has a wrong offset!");
static_assert(offsetof(GA_SentryGun_Deployment_C_ExecuteUbergraph_GA_SentryGun_Deployment, CallFunc_K2_CommitAbility_ReturnValue) == 0x000044, "Member 'GA_SentryGun_Deployment_C_ExecuteUbergraph_GA_SentryGun_Deployment::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SentryGun_Deployment_C_ExecuteUbergraph_GA_SentryGun_Deployment, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue) == 0x000048, "Member 'GA_SentryGun_Deployment_C_ExecuteUbergraph_GA_SentryGun_Deployment::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SentryGun_Deployment_C_ExecuteUbergraph_GA_SentryGun_Deployment, K2Node_CreateDelegate_OutputDelegate3) == 0x00004C, "Member 'GA_SentryGun_Deployment_C_ExecuteUbergraph_GA_SentryGun_Deployment::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(GA_SentryGun_Deployment_C_ExecuteUbergraph_GA_SentryGun_Deployment, CallFunc_IsValid_ReturnValue) == 0x00005C, "Member 'GA_SentryGun_Deployment_C_ExecuteUbergraph_GA_SentryGun_Deployment::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SentryGun_Deployment_C_ExecuteUbergraph_GA_SentryGun_Deployment, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000060, "Member 'GA_SentryGun_Deployment_C_ExecuteUbergraph_GA_SentryGun_Deployment::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SentryGun_Deployment_C_ExecuteUbergraph_GA_SentryGun_Deployment, K2Node_DynamicCast_AsFort_Pawn) == 0x000064, "Member 'GA_SentryGun_Deployment_C_ExecuteUbergraph_GA_SentryGun_Deployment::K2Node_DynamicCast_AsFort_Pawn' has a wrong offset!");
static_assert(offsetof(GA_SentryGun_Deployment_C_ExecuteUbergraph_GA_SentryGun_Deployment, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'GA_SentryGun_Deployment_C_ExecuteUbergraph_GA_SentryGun_Deployment::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_SentryGun_Deployment_C_ExecuteUbergraph_GA_SentryGun_Deployment, K2Node_DynamicCast_AsFort_Ability_Deco_Tool) == 0x00006C, "Member 'GA_SentryGun_Deployment_C_ExecuteUbergraph_GA_SentryGun_Deployment::K2Node_DynamicCast_AsFort_Ability_Deco_Tool' has a wrong offset!");
static_assert(offsetof(GA_SentryGun_Deployment_C_ExecuteUbergraph_GA_SentryGun_Deployment, K2Node_DynamicCast_bSuccess2) == 0x000070, "Member 'GA_SentryGun_Deployment_C_ExecuteUbergraph_GA_SentryGun_Deployment::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(GA_SentryGun_Deployment_C_ExecuteUbergraph_GA_SentryGun_Deployment, CallFunc_AbilitySpawnDeco_ReturnValue) == 0x000074, "Member 'GA_SentryGun_Deployment_C_ExecuteUbergraph_GA_SentryGun_Deployment::CallFunc_AbilitySpawnDeco_ReturnValue' has a wrong offset!");

// Function GA_SentryGun_Deployment.GA_SentryGun_Deployment_C.TempStatScaling
// 0x0058 (0x0058 - 0x0000)
struct GA_SentryGun_Deployment_C_TempStatScaling final
{
public:
	class AFortPawn*                              InstigatorPawn;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 SentryGun;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromActor_ReturnValue;   // 0x0008(0x0014)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute; // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue; // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingSpec_ReturnValue;             // 0x002C(0x000C)()
	struct FGameplayEffectSpecHandle              CallFunc_AssignSetByCallerMagnitude_ReturnValue;   // 0x0038(0x000C)()
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_K2_ApplyGameplayEffectSpecToTarget_ReturnValue; // 0x0044(0x000C)(ZeroConstructor, ReferenceParm)
	class UClass*                                 GE_BGABuff;                                        // 0x0050(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         LocalDamageBoost;                                  // 0x0054(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_SentryGun_Deployment_C_TempStatScaling) == 0x000004, "Wrong alignment on GA_SentryGun_Deployment_C_TempStatScaling");
static_assert(sizeof(GA_SentryGun_Deployment_C_TempStatScaling) == 0x000058, "Wrong size on GA_SentryGun_Deployment_C_TempStatScaling");
static_assert(offsetof(GA_SentryGun_Deployment_C_TempStatScaling, InstigatorPawn) == 0x000000, "Member 'GA_SentryGun_Deployment_C_TempStatScaling::InstigatorPawn' has a wrong offset!");
static_assert(offsetof(GA_SentryGun_Deployment_C_TempStatScaling, SentryGun) == 0x000004, "Member 'GA_SentryGun_Deployment_C_TempStatScaling::SentryGun' has a wrong offset!");
static_assert(offsetof(GA_SentryGun_Deployment_C_TempStatScaling, CallFunc_AbilityTargetDataFromActor_ReturnValue) == 0x000008, "Member 'GA_SentryGun_Deployment_C_TempStatScaling::CallFunc_AbilityTargetDataFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SentryGun_Deployment_C_TempStatScaling, CallFunc_IsValid_ReturnValue) == 0x00001C, "Member 'GA_SentryGun_Deployment_C_TempStatScaling::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SentryGun_Deployment_C_TempStatScaling, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000020, "Member 'GA_SentryGun_Deployment_C_TempStatScaling::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SentryGun_Deployment_C_TempStatScaling, CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute) == 0x000024, "Member 'GA_SentryGun_Deployment_C_TempStatScaling::CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute' has a wrong offset!");
static_assert(offsetof(GA_SentryGun_Deployment_C_TempStatScaling, CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue) == 0x000028, "Member 'GA_SentryGun_Deployment_C_TempStatScaling::CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SentryGun_Deployment_C_TempStatScaling, CallFunc_MakeOutgoingSpec_ReturnValue) == 0x00002C, "Member 'GA_SentryGun_Deployment_C_TempStatScaling::CallFunc_MakeOutgoingSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SentryGun_Deployment_C_TempStatScaling, CallFunc_AssignSetByCallerMagnitude_ReturnValue) == 0x000038, "Member 'GA_SentryGun_Deployment_C_TempStatScaling::CallFunc_AssignSetByCallerMagnitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SentryGun_Deployment_C_TempStatScaling, CallFunc_K2_ApplyGameplayEffectSpecToTarget_ReturnValue) == 0x000044, "Member 'GA_SentryGun_Deployment_C_TempStatScaling::CallFunc_K2_ApplyGameplayEffectSpecToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SentryGun_Deployment_C_TempStatScaling, GE_BGABuff) == 0x000050, "Member 'GA_SentryGun_Deployment_C_TempStatScaling::GE_BGABuff' has a wrong offset!");
static_assert(offsetof(GA_SentryGun_Deployment_C_TempStatScaling, LocalDamageBoost) == 0x000054, "Member 'GA_SentryGun_Deployment_C_TempStatScaling::LocalDamageBoost' has a wrong offset!");

}

#pragma pack(pop)
