#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Track

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// GameplayAbilityBlueprintGeneratedClass GA_Track.GA_Track_C
// 0x002C (0x0708 - 0x06DC)
class UGA_Track_C final : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06DC(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x06E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class AFortAbilityDecoTool*                   DecoTool;                                          // 0x06E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FAbilityToolSpawnParameters            SpawnParameters;                                   // 0x06E8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_GA_Track(int32 EntryPoint);
	void K2_ActivateAbility();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Track_C">();
	}
	static class UGA_Track_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Track_C>();
	}
};
static_assert(alignof(UGA_Track_C) == 0x000004, "Wrong alignment on UGA_Track_C");
static_assert(sizeof(UGA_Track_C) == 0x000708, "Wrong size on UGA_Track_C");
static_assert(offsetof(UGA_Track_C, UberGraphFrame) == 0x0006DC, "Member 'UGA_Track_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Track_C, PlayerPawn) == 0x0006E0, "Member 'UGA_Track_C::PlayerPawn' has a wrong offset!");
static_assert(offsetof(UGA_Track_C, DecoTool) == 0x0006E4, "Member 'UGA_Track_C::DecoTool' has a wrong offset!");
static_assert(offsetof(UGA_Track_C, SpawnParameters) == 0x0006E8, "Member 'UGA_Track_C::SpawnParameters' has a wrong offset!");

}

#pragma pack(pop)
