#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Trap_RailTurret

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function GA_Trap_RailTurret.GA_Trap_RailTurret_C.ExecuteUbergraph_GA_Trap_RailTurret
// 0x00D0 (0x00D0 - 0x0000)
struct GA_Trap_RailTurret_C_ExecuteUbergraph_GA_Trap_RailTurret final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ABuildingTrap*                          K2Node_DynamicCast_AsBuilding_Trap;                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0010(0x0008)()
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable2;                             // 0x0018(0x0014)()
	class UFortAbilityTask_WaitTargetSelection*   CallFunc_WaitTargetSelection_ReturnValue;          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<class AActor*>                         CallFunc_GetActorsFromTargetData_ReturnValue;      // 0x0030(0x000C)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E[0x2];                                       // 0x004E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData;                     // 0x0050(0x0014)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag;                 // 0x0064(0x0008)()
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate;              // 0x0070(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue2; // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ABuildingTrap*                          K2Node_DynamicCast_AsBuilding_Trap2;               // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDamageDelay_ReturnValue;               // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetFireDelay_ReturnValue;                 // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue3; // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ABuildingTrap*                          K2Node_DynamicCast_AsBuilding_Trap3;               // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData2;                    // 0x00A0(0x0014)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag2;                // 0x00B4(0x0008)()
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate2;             // 0x00BC(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_HasValidTarget_ValidTarget;               // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasValidTarget_ValidTarget2;              // 0x00CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Trap_RailTurret_C_ExecuteUbergraph_GA_Trap_RailTurret) == 0x000004, "Wrong alignment on GA_Trap_RailTurret_C_ExecuteUbergraph_GA_Trap_RailTurret");
static_assert(sizeof(GA_Trap_RailTurret_C_ExecuteUbergraph_GA_Trap_RailTurret) == 0x0000D0, "Wrong size on GA_Trap_RailTurret_C_ExecuteUbergraph_GA_Trap_RailTurret");
static_assert(offsetof(GA_Trap_RailTurret_C_ExecuteUbergraph_GA_Trap_RailTurret, EntryPoint) == 0x000000, "Member 'GA_Trap_RailTurret_C_ExecuteUbergraph_GA_Trap_RailTurret::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Trap_RailTurret_C_ExecuteUbergraph_GA_Trap_RailTurret, CallFunc_GetOwningActorFromActorInfo_ReturnValue) == 0x000004, "Member 'GA_Trap_RailTurret_C_ExecuteUbergraph_GA_Trap_RailTurret::CallFunc_GetOwningActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_RailTurret_C_ExecuteUbergraph_GA_Trap_RailTurret, K2Node_DynamicCast_AsBuilding_Trap) == 0x000008, "Member 'GA_Trap_RailTurret_C_ExecuteUbergraph_GA_Trap_RailTurret::K2Node_DynamicCast_AsBuilding_Trap' has a wrong offset!");
static_assert(offsetof(GA_Trap_RailTurret_C_ExecuteUbergraph_GA_Trap_RailTurret, K2Node_DynamicCast_bSuccess) == 0x00000C, "Member 'GA_Trap_RailTurret_C_ExecuteUbergraph_GA_Trap_RailTurret::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Trap_RailTurret_C_ExecuteUbergraph_GA_Trap_RailTurret, Temp_struct_Variable) == 0x000010, "Member 'GA_Trap_RailTurret_C_ExecuteUbergraph_GA_Trap_RailTurret::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Trap_RailTurret_C_ExecuteUbergraph_GA_Trap_RailTurret, Temp_struct_Variable2) == 0x000018, "Member 'GA_Trap_RailTurret_C_ExecuteUbergraph_GA_Trap_RailTurret::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(GA_Trap_RailTurret_C_ExecuteUbergraph_GA_Trap_RailTurret, CallFunc_WaitTargetSelection_ReturnValue) == 0x00002C, "Member 'GA_Trap_RailTurret_C_ExecuteUbergraph_GA_Trap_RailTurret::CallFunc_WaitTargetSelection_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_RailTurret_C_ExecuteUbergraph_GA_Trap_RailTurret, CallFunc_GetActorsFromTargetData_ReturnValue) == 0x000030, "Member 'GA_Trap_RailTurret_C_ExecuteUbergraph_GA_Trap_RailTurret::CallFunc_GetActorsFromTargetData_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_RailTurret_C_ExecuteUbergraph_GA_Trap_RailTurret, CallFunc_Array_Length_ReturnValue) == 0x00003C, "Member 'GA_Trap_RailTurret_C_ExecuteUbergraph_GA_Trap_RailTurret::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_RailTurret_C_ExecuteUbergraph_GA_Trap_RailTurret, CallFunc_Array_Get_Item) == 0x000040, "Member 'GA_Trap_RailTurret_C_ExecuteUbergraph_GA_Trap_RailTurret::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GA_Trap_RailTurret_C_ExecuteUbergraph_GA_Trap_RailTurret, CallFunc_Greater_IntInt_ReturnValue) == 0x000044, "Member 'GA_Trap_RailTurret_C_ExecuteUbergraph_GA_Trap_RailTurret::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_RailTurret_C_ExecuteUbergraph_GA_Trap_RailTurret, K2Node_DynamicCast_AsFort_Pawn) == 0x000048, "Member 'GA_Trap_RailTurret_C_ExecuteUbergraph_GA_Trap_RailTurret::K2Node_DynamicCast_AsFort_Pawn' has a wrong offset!");
static_assert(offsetof(GA_Trap_RailTurret_C_ExecuteUbergraph_GA_Trap_RailTurret, K2Node_DynamicCast_bSuccess2) == 0x00004C, "Member 'GA_Trap_RailTurret_C_ExecuteUbergraph_GA_Trap_RailTurret::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(GA_Trap_RailTurret_C_ExecuteUbergraph_GA_Trap_RailTurret, CallFunc_IsValid_ReturnValue) == 0x00004D, "Member 'GA_Trap_RailTurret_C_ExecuteUbergraph_GA_Trap_RailTurret::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_RailTurret_C_ExecuteUbergraph_GA_Trap_RailTurret, K2Node_CustomEvent_TargetData) == 0x000050, "Member 'GA_Trap_RailTurret_C_ExecuteUbergraph_GA_Trap_RailTurret::K2Node_CustomEvent_TargetData' has a wrong offset!");
static_assert(offsetof(GA_Trap_RailTurret_C_ExecuteUbergraph_GA_Trap_RailTurret, K2Node_CustomEvent_ApplicationTag) == 0x000064, "Member 'GA_Trap_RailTurret_C_ExecuteUbergraph_GA_Trap_RailTurret::K2Node_CustomEvent_ApplicationTag' has a wrong offset!");
static_assert(offsetof(GA_Trap_RailTurret_C_ExecuteUbergraph_GA_Trap_RailTurret, CallFunc_K2_CommitAbility_ReturnValue) == 0x00006C, "Member 'GA_Trap_RailTurret_C_ExecuteUbergraph_GA_Trap_RailTurret::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_RailTurret_C_ExecuteUbergraph_GA_Trap_RailTurret, K2Node_CreateDelegate_OutputDelegate) == 0x000070, "Member 'GA_Trap_RailTurret_C_ExecuteUbergraph_GA_Trap_RailTurret::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Trap_RailTurret_C_ExecuteUbergraph_GA_Trap_RailTurret, CallFunc_GetOwningActorFromActorInfo_ReturnValue2) == 0x000080, "Member 'GA_Trap_RailTurret_C_ExecuteUbergraph_GA_Trap_RailTurret::CallFunc_GetOwningActorFromActorInfo_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Trap_RailTurret_C_ExecuteUbergraph_GA_Trap_RailTurret, K2Node_DynamicCast_AsBuilding_Trap2) == 0x000084, "Member 'GA_Trap_RailTurret_C_ExecuteUbergraph_GA_Trap_RailTurret::K2Node_DynamicCast_AsBuilding_Trap2' has a wrong offset!");
static_assert(offsetof(GA_Trap_RailTurret_C_ExecuteUbergraph_GA_Trap_RailTurret, K2Node_DynamicCast_bSuccess3) == 0x000088, "Member 'GA_Trap_RailTurret_C_ExecuteUbergraph_GA_Trap_RailTurret::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(GA_Trap_RailTurret_C_ExecuteUbergraph_GA_Trap_RailTurret, CallFunc_GetDamageDelay_ReturnValue) == 0x00008C, "Member 'GA_Trap_RailTurret_C_ExecuteUbergraph_GA_Trap_RailTurret::CallFunc_GetDamageDelay_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_RailTurret_C_ExecuteUbergraph_GA_Trap_RailTurret, CallFunc_GetFireDelay_ReturnValue) == 0x000090, "Member 'GA_Trap_RailTurret_C_ExecuteUbergraph_GA_Trap_RailTurret::CallFunc_GetFireDelay_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_RailTurret_C_ExecuteUbergraph_GA_Trap_RailTurret, CallFunc_GetOwningActorFromActorInfo_ReturnValue3) == 0x000094, "Member 'GA_Trap_RailTurret_C_ExecuteUbergraph_GA_Trap_RailTurret::CallFunc_GetOwningActorFromActorInfo_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Trap_RailTurret_C_ExecuteUbergraph_GA_Trap_RailTurret, K2Node_DynamicCast_AsBuilding_Trap3) == 0x000098, "Member 'GA_Trap_RailTurret_C_ExecuteUbergraph_GA_Trap_RailTurret::K2Node_DynamicCast_AsBuilding_Trap3' has a wrong offset!");
static_assert(offsetof(GA_Trap_RailTurret_C_ExecuteUbergraph_GA_Trap_RailTurret, K2Node_DynamicCast_bSuccess4) == 0x00009C, "Member 'GA_Trap_RailTurret_C_ExecuteUbergraph_GA_Trap_RailTurret::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(GA_Trap_RailTurret_C_ExecuteUbergraph_GA_Trap_RailTurret, K2Node_CustomEvent_TargetData2) == 0x0000A0, "Member 'GA_Trap_RailTurret_C_ExecuteUbergraph_GA_Trap_RailTurret::K2Node_CustomEvent_TargetData2' has a wrong offset!");
static_assert(offsetof(GA_Trap_RailTurret_C_ExecuteUbergraph_GA_Trap_RailTurret, K2Node_CustomEvent_ApplicationTag2) == 0x0000B4, "Member 'GA_Trap_RailTurret_C_ExecuteUbergraph_GA_Trap_RailTurret::K2Node_CustomEvent_ApplicationTag2' has a wrong offset!");
static_assert(offsetof(GA_Trap_RailTurret_C_ExecuteUbergraph_GA_Trap_RailTurret, K2Node_CreateDelegate_OutputDelegate2) == 0x0000BC, "Member 'GA_Trap_RailTurret_C_ExecuteUbergraph_GA_Trap_RailTurret::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GA_Trap_RailTurret_C_ExecuteUbergraph_GA_Trap_RailTurret, CallFunc_HasValidTarget_ValidTarget) == 0x0000CC, "Member 'GA_Trap_RailTurret_C_ExecuteUbergraph_GA_Trap_RailTurret::CallFunc_HasValidTarget_ValidTarget' has a wrong offset!");
static_assert(offsetof(GA_Trap_RailTurret_C_ExecuteUbergraph_GA_Trap_RailTurret, CallFunc_HasValidTarget_ValidTarget2) == 0x0000CD, "Member 'GA_Trap_RailTurret_C_ExecuteUbergraph_GA_Trap_RailTurret::CallFunc_HasValidTarget_ValidTarget2' has a wrong offset!");

// Function GA_Trap_RailTurret.GA_Trap_RailTurret_C.Targeted_DF598E9A4A91186F4A43BC9986F864A0
// 0x001C (0x001C - 0x0000)
struct GA_Trap_RailTurret_C_Targeted_DF598E9A4A91186F4A43BC9986F864A0 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0014)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0014(0x0008)(Parm)
};
static_assert(alignof(GA_Trap_RailTurret_C_Targeted_DF598E9A4A91186F4A43BC9986F864A0) == 0x000004, "Wrong alignment on GA_Trap_RailTurret_C_Targeted_DF598E9A4A91186F4A43BC9986F864A0");
static_assert(sizeof(GA_Trap_RailTurret_C_Targeted_DF598E9A4A91186F4A43BC9986F864A0) == 0x00001C, "Wrong size on GA_Trap_RailTurret_C_Targeted_DF598E9A4A91186F4A43BC9986F864A0");
static_assert(offsetof(GA_Trap_RailTurret_C_Targeted_DF598E9A4A91186F4A43BC9986F864A0, TargetData) == 0x000000, "Member 'GA_Trap_RailTurret_C_Targeted_DF598E9A4A91186F4A43BC9986F864A0::TargetData' has a wrong offset!");
static_assert(offsetof(GA_Trap_RailTurret_C_Targeted_DF598E9A4A91186F4A43BC9986F864A0, ApplicationTag) == 0x000014, "Member 'GA_Trap_RailTurret_C_Targeted_DF598E9A4A91186F4A43BC9986F864A0::ApplicationTag' has a wrong offset!");

// Function GA_Trap_RailTurret.GA_Trap_RailTurret_C.Cancelled_DF598E9A4A91186F4A43BC9986F864A0
// 0x001C (0x001C - 0x0000)
struct GA_Trap_RailTurret_C_Cancelled_DF598E9A4A91186F4A43BC9986F864A0 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0014)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0014(0x0008)(Parm)
};
static_assert(alignof(GA_Trap_RailTurret_C_Cancelled_DF598E9A4A91186F4A43BC9986F864A0) == 0x000004, "Wrong alignment on GA_Trap_RailTurret_C_Cancelled_DF598E9A4A91186F4A43BC9986F864A0");
static_assert(sizeof(GA_Trap_RailTurret_C_Cancelled_DF598E9A4A91186F4A43BC9986F864A0) == 0x00001C, "Wrong size on GA_Trap_RailTurret_C_Cancelled_DF598E9A4A91186F4A43BC9986F864A0");
static_assert(offsetof(GA_Trap_RailTurret_C_Cancelled_DF598E9A4A91186F4A43BC9986F864A0, TargetData) == 0x000000, "Member 'GA_Trap_RailTurret_C_Cancelled_DF598E9A4A91186F4A43BC9986F864A0::TargetData' has a wrong offset!");
static_assert(offsetof(GA_Trap_RailTurret_C_Cancelled_DF598E9A4A91186F4A43BC9986F864A0, ApplicationTag) == 0x000014, "Member 'GA_Trap_RailTurret_C_Cancelled_DF598E9A4A91186F4A43BC9986F864A0::ApplicationTag' has a wrong offset!");

// Function GA_Trap_RailTurret.GA_Trap_RailTurret_C.HasValidTarget
// 0x0010 (0x0010 - 0x0000)
struct GA_Trap_RailTurret_C_HasValidTarget final
{
public:
	bool                                          ValidTarget;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetMaxHealth_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Trap_RailTurret_C_HasValidTarget) == 0x000004, "Wrong alignment on GA_Trap_RailTurret_C_HasValidTarget");
static_assert(sizeof(GA_Trap_RailTurret_C_HasValidTarget) == 0x000010, "Wrong size on GA_Trap_RailTurret_C_HasValidTarget");
static_assert(offsetof(GA_Trap_RailTurret_C_HasValidTarget, ValidTarget) == 0x000000, "Member 'GA_Trap_RailTurret_C_HasValidTarget::ValidTarget' has a wrong offset!");
static_assert(offsetof(GA_Trap_RailTurret_C_HasValidTarget, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000001, "Member 'GA_Trap_RailTurret_C_HasValidTarget::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_RailTurret_C_HasValidTarget, CallFunc_GetMaxHealth_ReturnValue) == 0x000004, "Member 'GA_Trap_RailTurret_C_HasValidTarget::CallFunc_GetMaxHealth_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_RailTurret_C_HasValidTarget, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000008, "Member 'GA_Trap_RailTurret_C_HasValidTarget::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_RailTurret_C_HasValidTarget, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00000C, "Member 'GA_Trap_RailTurret_C_HasValidTarget::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_RailTurret_C_HasValidTarget, CallFunc_BooleanAND_ReturnValue) == 0x00000D, "Member 'GA_Trap_RailTurret_C_HasValidTarget::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function GA_Trap_RailTurret.GA_Trap_RailTurret_C.Fire
// 0x0120 (0x0120 - 0x0000)
struct GA_Trap_RailTurret_C_Fire final
{
public:
	class AFortPawn*                              Enemy;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class ABuildingTrap*                          ThisTrap;                                          // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetFireLocationAndRotation_ReturnValue;   // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetTrapLevel_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFortGameplayEffectContainerSpec       CallFunc_MakeGameplayEffectContainerSpec_ReturnValue; // 0x0068(0x0064)()
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x00D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x00E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x00F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0108(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortProjectileBase*                    CallFunc_SpawnProjectile_ReturnValue;              // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Trap_RailTurret_C_Fire) == 0x000010, "Wrong alignment on GA_Trap_RailTurret_C_Fire");
static_assert(sizeof(GA_Trap_RailTurret_C_Fire) == 0x000120, "Wrong size on GA_Trap_RailTurret_C_Fire");
static_assert(offsetof(GA_Trap_RailTurret_C_Fire, Enemy) == 0x000000, "Member 'GA_Trap_RailTurret_C_Fire::Enemy' has a wrong offset!");
static_assert(offsetof(GA_Trap_RailTurret_C_Fire, ThisTrap) == 0x000004, "Member 'GA_Trap_RailTurret_C_Fire::ThisTrap' has a wrong offset!");
static_assert(offsetof(GA_Trap_RailTurret_C_Fire, CallFunc_GetFireLocationAndRotation_ReturnValue) == 0x000010, "Member 'GA_Trap_RailTurret_C_Fire::CallFunc_GetFireLocationAndRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_RailTurret_C_Fire, CallFunc_GetTrapLevel_ReturnValue) == 0x000040, "Member 'GA_Trap_RailTurret_C_Fire::CallFunc_GetTrapLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_RailTurret_C_Fire, CallFunc_BreakTransform_Location) == 0x000044, "Member 'GA_Trap_RailTurret_C_Fire::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(GA_Trap_RailTurret_C_Fire, CallFunc_BreakTransform_Rotation) == 0x000050, "Member 'GA_Trap_RailTurret_C_Fire::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(GA_Trap_RailTurret_C_Fire, CallFunc_BreakTransform_Scale) == 0x00005C, "Member 'GA_Trap_RailTurret_C_Fire::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(GA_Trap_RailTurret_C_Fire, CallFunc_MakeGameplayEffectContainerSpec_ReturnValue) == 0x000068, "Member 'GA_Trap_RailTurret_C_Fire::CallFunc_MakeGameplayEffectContainerSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_RailTurret_C_Fire, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000CC, "Member 'GA_Trap_RailTurret_C_Fire::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_RailTurret_C_Fire, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0000D8, "Member 'GA_Trap_RailTurret_C_Fire::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_RailTurret_C_Fire, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x0000E4, "Member 'GA_Trap_RailTurret_C_Fire::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_RailTurret_C_Fire, CallFunc_Normal_ReturnValue) == 0x0000F0, "Member 'GA_Trap_RailTurret_C_Fire::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_RailTurret_C_Fire, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0000FC, "Member 'GA_Trap_RailTurret_C_Fire::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_RailTurret_C_Fire, CallFunc_Add_VectorVector_ReturnValue) == 0x000108, "Member 'GA_Trap_RailTurret_C_Fire::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_RailTurret_C_Fire, CallFunc_SpawnProjectile_ReturnValue) == 0x000114, "Member 'GA_Trap_RailTurret_C_Fire::CallFunc_SpawnProjectile_ReturnValue' has a wrong offset!");

}

#pragma pack(pop)
