#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Trap_Wall_Launcher

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function GA_Trap_Wall_Launcher.GA_Trap_Wall_Launcher_C.ExecuteUbergraph_GA_Trap_Wall_Launcher
// 0x0100 (0x0100 - 0x0000)
struct GA_Trap_Wall_Launcher_C_ExecuteUbergraph_GA_Trap_Wall_Launcher final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ABuildingTrap*                          K2Node_DynamicCast_AsBuilding_Trap;                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue2; // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ABuildingTrap*                          K2Node_DynamicCast_AsBuilding_Trap2;               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetDamageDelay_ReturnValue;               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetFireDelay_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetTouchingDamageTargets_ReturnValue;     // 0x0034(0x000C)(ZeroConstructor, ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ACharacter*                             K2Node_DynamicCast_AsCharacter;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E[0x2];                                       // 0x004E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromActor_ReturnValue;   // 0x0050(0x0014)()
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_ApplyGameplayEffectContainer_ReturnValue; // 0x0064(0x000C)(ConstParm, ZeroConstructor, ReferenceParm)
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue;                 // 0x0070(0x0034)(ContainsInstancedReference)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x00B0(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_TransformDirection_ReturnValue;           // 0x00EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Trap_Wall_Launcher_C_ExecuteUbergraph_GA_Trap_Wall_Launcher) == 0x000010, "Wrong alignment on GA_Trap_Wall_Launcher_C_ExecuteUbergraph_GA_Trap_Wall_Launcher");
static_assert(sizeof(GA_Trap_Wall_Launcher_C_ExecuteUbergraph_GA_Trap_Wall_Launcher) == 0x000100, "Wrong size on GA_Trap_Wall_Launcher_C_ExecuteUbergraph_GA_Trap_Wall_Launcher");
static_assert(offsetof(GA_Trap_Wall_Launcher_C_ExecuteUbergraph_GA_Trap_Wall_Launcher, EntryPoint) == 0x000000, "Member 'GA_Trap_Wall_Launcher_C_ExecuteUbergraph_GA_Trap_Wall_Launcher::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Trap_Wall_Launcher_C_ExecuteUbergraph_GA_Trap_Wall_Launcher, CallFunc_GetOwningActorFromActorInfo_ReturnValue) == 0x000004, "Member 'GA_Trap_Wall_Launcher_C_ExecuteUbergraph_GA_Trap_Wall_Launcher::CallFunc_GetOwningActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_Wall_Launcher_C_ExecuteUbergraph_GA_Trap_Wall_Launcher, K2Node_DynamicCast_AsBuilding_Trap) == 0x000008, "Member 'GA_Trap_Wall_Launcher_C_ExecuteUbergraph_GA_Trap_Wall_Launcher::K2Node_DynamicCast_AsBuilding_Trap' has a wrong offset!");
static_assert(offsetof(GA_Trap_Wall_Launcher_C_ExecuteUbergraph_GA_Trap_Wall_Launcher, K2Node_DynamicCast_bSuccess) == 0x00000C, "Member 'GA_Trap_Wall_Launcher_C_ExecuteUbergraph_GA_Trap_Wall_Launcher::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Trap_Wall_Launcher_C_ExecuteUbergraph_GA_Trap_Wall_Launcher, CallFunc_GetOwningActorFromActorInfo_ReturnValue2) == 0x000010, "Member 'GA_Trap_Wall_Launcher_C_ExecuteUbergraph_GA_Trap_Wall_Launcher::CallFunc_GetOwningActorFromActorInfo_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Trap_Wall_Launcher_C_ExecuteUbergraph_GA_Trap_Wall_Launcher, K2Node_DynamicCast_AsBuilding_Trap2) == 0x000014, "Member 'GA_Trap_Wall_Launcher_C_ExecuteUbergraph_GA_Trap_Wall_Launcher::K2Node_DynamicCast_AsBuilding_Trap2' has a wrong offset!");
static_assert(offsetof(GA_Trap_Wall_Launcher_C_ExecuteUbergraph_GA_Trap_Wall_Launcher, K2Node_DynamicCast_bSuccess2) == 0x000018, "Member 'GA_Trap_Wall_Launcher_C_ExecuteUbergraph_GA_Trap_Wall_Launcher::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(GA_Trap_Wall_Launcher_C_ExecuteUbergraph_GA_Trap_Wall_Launcher, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'GA_Trap_Wall_Launcher_C_ExecuteUbergraph_GA_Trap_Wall_Launcher::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GA_Trap_Wall_Launcher_C_ExecuteUbergraph_GA_Trap_Wall_Launcher, CallFunc_GetDamageDelay_ReturnValue) == 0x000020, "Member 'GA_Trap_Wall_Launcher_C_ExecuteUbergraph_GA_Trap_Wall_Launcher::CallFunc_GetDamageDelay_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_Wall_Launcher_C_ExecuteUbergraph_GA_Trap_Wall_Launcher, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'GA_Trap_Wall_Launcher_C_ExecuteUbergraph_GA_Trap_Wall_Launcher::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_Wall_Launcher_C_ExecuteUbergraph_GA_Trap_Wall_Launcher, CallFunc_GetFireDelay_ReturnValue) == 0x000028, "Member 'GA_Trap_Wall_Launcher_C_ExecuteUbergraph_GA_Trap_Wall_Launcher::CallFunc_GetFireDelay_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_Wall_Launcher_C_ExecuteUbergraph_GA_Trap_Wall_Launcher, Temp_int_Array_Index_Variable) == 0x00002C, "Member 'GA_Trap_Wall_Launcher_C_ExecuteUbergraph_GA_Trap_Wall_Launcher::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GA_Trap_Wall_Launcher_C_ExecuteUbergraph_GA_Trap_Wall_Launcher, CallFunc_K2_CommitAbility_ReturnValue) == 0x000030, "Member 'GA_Trap_Wall_Launcher_C_ExecuteUbergraph_GA_Trap_Wall_Launcher::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_Wall_Launcher_C_ExecuteUbergraph_GA_Trap_Wall_Launcher, CallFunc_GetTouchingDamageTargets_ReturnValue) == 0x000034, "Member 'GA_Trap_Wall_Launcher_C_ExecuteUbergraph_GA_Trap_Wall_Launcher::CallFunc_GetTouchingDamageTargets_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_Wall_Launcher_C_ExecuteUbergraph_GA_Trap_Wall_Launcher, CallFunc_Array_Get_Item) == 0x000040, "Member 'GA_Trap_Wall_Launcher_C_ExecuteUbergraph_GA_Trap_Wall_Launcher::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GA_Trap_Wall_Launcher_C_ExecuteUbergraph_GA_Trap_Wall_Launcher, CallFunc_Array_Length_ReturnValue) == 0x000044, "Member 'GA_Trap_Wall_Launcher_C_ExecuteUbergraph_GA_Trap_Wall_Launcher::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_Wall_Launcher_C_ExecuteUbergraph_GA_Trap_Wall_Launcher, K2Node_DynamicCast_AsCharacter) == 0x000048, "Member 'GA_Trap_Wall_Launcher_C_ExecuteUbergraph_GA_Trap_Wall_Launcher::K2Node_DynamicCast_AsCharacter' has a wrong offset!");
static_assert(offsetof(GA_Trap_Wall_Launcher_C_ExecuteUbergraph_GA_Trap_Wall_Launcher, K2Node_DynamicCast_bSuccess3) == 0x00004C, "Member 'GA_Trap_Wall_Launcher_C_ExecuteUbergraph_GA_Trap_Wall_Launcher::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(GA_Trap_Wall_Launcher_C_ExecuteUbergraph_GA_Trap_Wall_Launcher, CallFunc_Less_IntInt_ReturnValue) == 0x00004D, "Member 'GA_Trap_Wall_Launcher_C_ExecuteUbergraph_GA_Trap_Wall_Launcher::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_Wall_Launcher_C_ExecuteUbergraph_GA_Trap_Wall_Launcher, CallFunc_AbilityTargetDataFromActor_ReturnValue) == 0x000050, "Member 'GA_Trap_Wall_Launcher_C_ExecuteUbergraph_GA_Trap_Wall_Launcher::CallFunc_AbilityTargetDataFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_Wall_Launcher_C_ExecuteUbergraph_GA_Trap_Wall_Launcher, CallFunc_ApplyGameplayEffectContainer_ReturnValue) == 0x000064, "Member 'GA_Trap_Wall_Launcher_C_ExecuteUbergraph_GA_Trap_Wall_Launcher::CallFunc_ApplyGameplayEffectContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_Wall_Launcher_C_ExecuteUbergraph_GA_Trap_Wall_Launcher, CallFunc_GetActorInfo_ReturnValue) == 0x000070, "Member 'GA_Trap_Wall_Launcher_C_ExecuteUbergraph_GA_Trap_Wall_Launcher::CallFunc_GetActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_Wall_Launcher_C_ExecuteUbergraph_GA_Trap_Wall_Launcher, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0000A4, "Member 'GA_Trap_Wall_Launcher_C_ExecuteUbergraph_GA_Trap_Wall_Launcher::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_Wall_Launcher_C_ExecuteUbergraph_GA_Trap_Wall_Launcher, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000A8, "Member 'GA_Trap_Wall_Launcher_C_ExecuteUbergraph_GA_Trap_Wall_Launcher::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_Wall_Launcher_C_ExecuteUbergraph_GA_Trap_Wall_Launcher, CallFunc_GetTransform_ReturnValue) == 0x0000B0, "Member 'GA_Trap_Wall_Launcher_C_ExecuteUbergraph_GA_Trap_Wall_Launcher::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_Wall_Launcher_C_ExecuteUbergraph_GA_Trap_Wall_Launcher, CallFunc_MakeVector_ReturnValue) == 0x0000E0, "Member 'GA_Trap_Wall_Launcher_C_ExecuteUbergraph_GA_Trap_Wall_Launcher::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_Wall_Launcher_C_ExecuteUbergraph_GA_Trap_Wall_Launcher, CallFunc_TransformDirection_ReturnValue) == 0x0000EC, "Member 'GA_Trap_Wall_Launcher_C_ExecuteUbergraph_GA_Trap_Wall_Launcher::CallFunc_TransformDirection_ReturnValue' has a wrong offset!");

}

#pragma pack(pop)
