#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Track

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function GA_Track.GA_Track_C.ExecuteUbergraph_GA_Track
// 0x00F0 (0x00F0 - 0x0000)
struct GA_Track_C_ExecuteUbergraph_GA_Track final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue;                 // 0x0004(0x0034)(ContainsInstancedReference)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_MakeStruct_GameplayEventData;               // 0x0040(0x0058)()
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromActor_ReturnValue;   // 0x0098(0x0014)()
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x00AC(0x000C)(ZeroConstructor, ReferenceParm)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C2[0x2];                                       // 0x00C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortAbilityDecoTool*                   K2Node_DynamicCast_AsFort_Ability_Deco_Tool;       // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue2;            // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CA[0x2];                                       // 0x00CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAbilityToolSpawnParameters            CallFunc_GetSpawnParameters_OutSpawnParamters;     // 0x00CC(0x0020)()
	class ABuildingActor*                         CallFunc_AbilitySpawnDeco_ReturnValue;             // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Track_C_ExecuteUbergraph_GA_Track) == 0x000004, "Wrong alignment on GA_Track_C_ExecuteUbergraph_GA_Track");
static_assert(sizeof(GA_Track_C_ExecuteUbergraph_GA_Track) == 0x0000F0, "Wrong size on GA_Track_C_ExecuteUbergraph_GA_Track");
static_assert(offsetof(GA_Track_C_ExecuteUbergraph_GA_Track, EntryPoint) == 0x000000, "Member 'GA_Track_C_ExecuteUbergraph_GA_Track::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Track_C_ExecuteUbergraph_GA_Track, CallFunc_GetActorInfo_ReturnValue) == 0x000004, "Member 'GA_Track_C_ExecuteUbergraph_GA_Track::CallFunc_GetActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Track_C_ExecuteUbergraph_GA_Track, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000038, "Member 'GA_Track_C_ExecuteUbergraph_GA_Track::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GA_Track_C_ExecuteUbergraph_GA_Track, K2Node_DynamicCast_bSuccess) == 0x00003C, "Member 'GA_Track_C_ExecuteUbergraph_GA_Track::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Track_C_ExecuteUbergraph_GA_Track, K2Node_MakeStruct_GameplayEventData) == 0x000040, "Member 'GA_Track_C_ExecuteUbergraph_GA_Track::K2Node_MakeStruct_GameplayEventData' has a wrong offset!");
static_assert(offsetof(GA_Track_C_ExecuteUbergraph_GA_Track, CallFunc_AbilityTargetDataFromActor_ReturnValue) == 0x000098, "Member 'GA_Track_C_ExecuteUbergraph_GA_Track::CallFunc_AbilityTargetDataFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Track_C_ExecuteUbergraph_GA_Track, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x0000AC, "Member 'GA_Track_C_ExecuteUbergraph_GA_Track::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Track_C_ExecuteUbergraph_GA_Track, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x0000B8, "Member 'GA_Track_C_ExecuteUbergraph_GA_Track::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Track_C_ExecuteUbergraph_GA_Track, K2Node_DynamicCast_AsFort_Pawn) == 0x0000BC, "Member 'GA_Track_C_ExecuteUbergraph_GA_Track::K2Node_DynamicCast_AsFort_Pawn' has a wrong offset!");
static_assert(offsetof(GA_Track_C_ExecuteUbergraph_GA_Track, K2Node_DynamicCast_bSuccess2) == 0x0000C0, "Member 'GA_Track_C_ExecuteUbergraph_GA_Track::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(GA_Track_C_ExecuteUbergraph_GA_Track, CallFunc_K2_CommitAbility_ReturnValue) == 0x0000C1, "Member 'GA_Track_C_ExecuteUbergraph_GA_Track::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Track_C_ExecuteUbergraph_GA_Track, K2Node_DynamicCast_AsFort_Ability_Deco_Tool) == 0x0000C4, "Member 'GA_Track_C_ExecuteUbergraph_GA_Track::K2Node_DynamicCast_AsFort_Ability_Deco_Tool' has a wrong offset!");
static_assert(offsetof(GA_Track_C_ExecuteUbergraph_GA_Track, K2Node_DynamicCast_bSuccess3) == 0x0000C8, "Member 'GA_Track_C_ExecuteUbergraph_GA_Track::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(GA_Track_C_ExecuteUbergraph_GA_Track, CallFunc_K2_CommitAbility_ReturnValue2) == 0x0000C9, "Member 'GA_Track_C_ExecuteUbergraph_GA_Track::CallFunc_K2_CommitAbility_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Track_C_ExecuteUbergraph_GA_Track, CallFunc_GetSpawnParameters_OutSpawnParamters) == 0x0000CC, "Member 'GA_Track_C_ExecuteUbergraph_GA_Track::CallFunc_GetSpawnParameters_OutSpawnParamters' has a wrong offset!");
static_assert(offsetof(GA_Track_C_ExecuteUbergraph_GA_Track, CallFunc_AbilitySpawnDeco_ReturnValue) == 0x0000EC, "Member 'GA_Track_C_ExecuteUbergraph_GA_Track::CallFunc_AbilitySpawnDeco_ReturnValue' has a wrong offset!");

}

#pragma pack(pop)
