#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Trap_Wall_Launcher

#include "Basic.hpp"

#include "GA_TrapGeneric_classes.hpp"
#include "Engine_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// GameplayAbilityBlueprintGeneratedClass GA_Trap_Wall_Launcher.GA_Trap_Wall_Launcher_C
// 0x000C (0x0700 - 0x06F4)
class UGA_Trap_Wall_Launcher_C final : public UGA_TrapGeneric_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_Trap_Wall_Launcher_C;            // 0x06F4(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         LaunchStrength;                                    // 0x06F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         Mass_Benchmark;                                    // 0x06FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_GA_Trap_Wall_Launcher(int32 EntryPoint);
	void K2_ActivateAbility();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Trap_Wall_Launcher_C">();
	}
	static class UGA_Trap_Wall_Launcher_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Trap_Wall_Launcher_C>();
	}
};
static_assert(alignof(UGA_Trap_Wall_Launcher_C) == 0x000004, "Wrong alignment on UGA_Trap_Wall_Launcher_C");
static_assert(sizeof(UGA_Trap_Wall_Launcher_C) == 0x000700, "Wrong size on UGA_Trap_Wall_Launcher_C");
static_assert(offsetof(UGA_Trap_Wall_Launcher_C, UberGraphFrame_GA_Trap_Wall_Launcher_C) == 0x0006F4, "Member 'UGA_Trap_Wall_Launcher_C::UberGraphFrame_GA_Trap_Wall_Launcher_C' has a wrong offset!");
static_assert(offsetof(UGA_Trap_Wall_Launcher_C, LaunchStrength) == 0x0006F8, "Member 'UGA_Trap_Wall_Launcher_C::LaunchStrength' has a wrong offset!");
static_assert(offsetof(UGA_Trap_Wall_Launcher_C, Mass_Benchmark) == 0x0006FC, "Member 'UGA_Trap_Wall_Launcher_C::Mass_Benchmark' has a wrong offset!");

}

#pragma pack(pop)
