#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GAB_SmasherRoarRampage

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function GAB_SmasherRoarRampage.GAB_SmasherRoarRampage_C.ExecuteUbergraph_GAB_SmasherRoarRampage
// 0x0094 (0x0094 - 0x0000)
struct GAB_SmasherRoarRampage_C_ExecuteUbergraph_GAB_SmasherRoarRampage final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_GetAIAbilityTarget_ReturnValue;           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate4;             // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate5;             // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_ApplyGameplayEffectContainer_ReturnValue; // 0x0058(0x000C)(ConstParm, ZeroConstructor, ReferenceParm)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate6;             // 0x0064(0x0010)(ZeroConstructor, NoDestructor)
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue; // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7A[0x2];                                       // 0x007A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAIAbilityTarget_ReturnValue2;          // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UFortAbilityTask_MoveAI*                CallFunc_CreateMoveAITask_ReturnValue;             // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_86[0x2];                                       // 0x0086(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue;            // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ASmasherPawn_BossRampage_C*             K2Node_DynamicCast_AsSmasher_Pawn_Boss_Rampage;    // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GAB_SmasherRoarRampage_C_ExecuteUbergraph_GAB_SmasherRoarRampage) == 0x000004, "Wrong alignment on GAB_SmasherRoarRampage_C_ExecuteUbergraph_GAB_SmasherRoarRampage");
static_assert(sizeof(GAB_SmasherRoarRampage_C_ExecuteUbergraph_GAB_SmasherRoarRampage) == 0x000094, "Wrong size on GAB_SmasherRoarRampage_C_ExecuteUbergraph_GAB_SmasherRoarRampage");
static_assert(offsetof(GAB_SmasherRoarRampage_C_ExecuteUbergraph_GAB_SmasherRoarRampage, EntryPoint) == 0x000000, "Member 'GAB_SmasherRoarRampage_C_ExecuteUbergraph_GAB_SmasherRoarRampage::EntryPoint' has a wrong offset!");
static_assert(offsetof(GAB_SmasherRoarRampage_C_ExecuteUbergraph_GAB_SmasherRoarRampage, CallFunc_GetAIAbilityTarget_ReturnValue) == 0x000004, "Member 'GAB_SmasherRoarRampage_C_ExecuteUbergraph_GAB_SmasherRoarRampage::CallFunc_GetAIAbilityTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_SmasherRoarRampage_C_ExecuteUbergraph_GAB_SmasherRoarRampage, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'GAB_SmasherRoarRampage_C_ExecuteUbergraph_GAB_SmasherRoarRampage::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GAB_SmasherRoarRampage_C_ExecuteUbergraph_GAB_SmasherRoarRampage, K2Node_CreateDelegate_OutputDelegate2) == 0x000018, "Member 'GAB_SmasherRoarRampage_C_ExecuteUbergraph_GAB_SmasherRoarRampage::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GAB_SmasherRoarRampage_C_ExecuteUbergraph_GAB_SmasherRoarRampage, K2Node_CreateDelegate_OutputDelegate3) == 0x000028, "Member 'GAB_SmasherRoarRampage_C_ExecuteUbergraph_GAB_SmasherRoarRampage::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(GAB_SmasherRoarRampage_C_ExecuteUbergraph_GAB_SmasherRoarRampage, K2Node_CreateDelegate_OutputDelegate4) == 0x000038, "Member 'GAB_SmasherRoarRampage_C_ExecuteUbergraph_GAB_SmasherRoarRampage::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(GAB_SmasherRoarRampage_C_ExecuteUbergraph_GAB_SmasherRoarRampage, K2Node_CreateDelegate_OutputDelegate5) == 0x000048, "Member 'GAB_SmasherRoarRampage_C_ExecuteUbergraph_GAB_SmasherRoarRampage::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(GAB_SmasherRoarRampage_C_ExecuteUbergraph_GAB_SmasherRoarRampage, CallFunc_ApplyGameplayEffectContainer_ReturnValue) == 0x000058, "Member 'GAB_SmasherRoarRampage_C_ExecuteUbergraph_GAB_SmasherRoarRampage::CallFunc_ApplyGameplayEffectContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_SmasherRoarRampage_C_ExecuteUbergraph_GAB_SmasherRoarRampage, K2Node_CreateDelegate_OutputDelegate6) == 0x000064, "Member 'GAB_SmasherRoarRampage_C_ExecuteUbergraph_GAB_SmasherRoarRampage::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");
static_assert(offsetof(GAB_SmasherRoarRampage_C_ExecuteUbergraph_GAB_SmasherRoarRampage, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue) == 0x000074, "Member 'GAB_SmasherRoarRampage_C_ExecuteUbergraph_GAB_SmasherRoarRampage::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_SmasherRoarRampage_C_ExecuteUbergraph_GAB_SmasherRoarRampage, CallFunc_IsValid_ReturnValue) == 0x000078, "Member 'GAB_SmasherRoarRampage_C_ExecuteUbergraph_GAB_SmasherRoarRampage::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_SmasherRoarRampage_C_ExecuteUbergraph_GAB_SmasherRoarRampage, CallFunc_K2_CommitAbility_ReturnValue) == 0x000079, "Member 'GAB_SmasherRoarRampage_C_ExecuteUbergraph_GAB_SmasherRoarRampage::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_SmasherRoarRampage_C_ExecuteUbergraph_GAB_SmasherRoarRampage, CallFunc_GetAIAbilityTarget_ReturnValue2) == 0x00007C, "Member 'GAB_SmasherRoarRampage_C_ExecuteUbergraph_GAB_SmasherRoarRampage::CallFunc_GetAIAbilityTarget_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GAB_SmasherRoarRampage_C_ExecuteUbergraph_GAB_SmasherRoarRampage, CallFunc_CreateMoveAITask_ReturnValue) == 0x000080, "Member 'GAB_SmasherRoarRampage_C_ExecuteUbergraph_GAB_SmasherRoarRampage::CallFunc_CreateMoveAITask_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_SmasherRoarRampage_C_ExecuteUbergraph_GAB_SmasherRoarRampage, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000084, "Member 'GAB_SmasherRoarRampage_C_ExecuteUbergraph_GAB_SmasherRoarRampage::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_SmasherRoarRampage_C_ExecuteUbergraph_GAB_SmasherRoarRampage, CallFunc_IsValid_ReturnValue2) == 0x000085, "Member 'GAB_SmasherRoarRampage_C_ExecuteUbergraph_GAB_SmasherRoarRampage::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GAB_SmasherRoarRampage_C_ExecuteUbergraph_GAB_SmasherRoarRampage, CallFunc_GetActivatingPawn_ReturnValue) == 0x000088, "Member 'GAB_SmasherRoarRampage_C_ExecuteUbergraph_GAB_SmasherRoarRampage::CallFunc_GetActivatingPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_SmasherRoarRampage_C_ExecuteUbergraph_GAB_SmasherRoarRampage, K2Node_DynamicCast_AsSmasher_Pawn_Boss_Rampage) == 0x00008C, "Member 'GAB_SmasherRoarRampage_C_ExecuteUbergraph_GAB_SmasherRoarRampage::K2Node_DynamicCast_AsSmasher_Pawn_Boss_Rampage' has a wrong offset!");
static_assert(offsetof(GAB_SmasherRoarRampage_C_ExecuteUbergraph_GAB_SmasherRoarRampage, K2Node_DynamicCast_bSuccess) == 0x000090, "Member 'GAB_SmasherRoarRampage_C_ExecuteUbergraph_GAB_SmasherRoarRampage::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

#pragma pack(pop)
