#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GAB_SmasherMelee

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GAB_AIBaseMelee_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// GameplayAbilityBlueprintGeneratedClass GAB_SmasherMelee.GAB_SmasherMelee_C
// 0x000C (0x06F4 - 0x06E8)
class UGAB_SmasherMelee_C : public UGAB_AIBaseMelee_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GAB_SmasherMelee_C;                 // 0x06E8(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class UClass*                                 GE_SmasherMeleeSuccess;                            // 0x06EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UClass*                                 GE_SmasherMeleeFailure;                            // 0x06F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_GAB_SmasherMelee(int32 EntryPoint);
	void K2_OnEndAbility();
	void MoveToLoop();
	void K2_ActivateAbility();
	void OnComplete_6E0FFA2F4367D5F26D5F5CB20E78DEFC();
	void OnInterrupted_6E0FFA2F4367D5F26D5F5CB20E78DEFC();
	void OnCancelled_6E0FFA2F4367D5F26D5F5CB20E78DEFC();
	void Triggered_D4EB604A4AFDAD65E3461A86287A3EFE(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Cancelled_D4EB604A4AFDAD65E3461A86287A3EFE(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Completed_D4EB604A4AFDAD65E3461A86287A3EFE(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GAB_SmasherMelee_C">();
	}
	static class UGAB_SmasherMelee_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGAB_SmasherMelee_C>();
	}
};
static_assert(alignof(UGAB_SmasherMelee_C) == 0x000004, "Wrong alignment on UGAB_SmasherMelee_C");
static_assert(sizeof(UGAB_SmasherMelee_C) == 0x0006F4, "Wrong size on UGAB_SmasherMelee_C");
static_assert(offsetof(UGAB_SmasherMelee_C, UberGraphFrame_GAB_SmasherMelee_C) == 0x0006E8, "Member 'UGAB_SmasherMelee_C::UberGraphFrame_GAB_SmasherMelee_C' has a wrong offset!");
static_assert(offsetof(UGAB_SmasherMelee_C, GE_SmasherMeleeSuccess) == 0x0006EC, "Member 'UGAB_SmasherMelee_C::GE_SmasherMeleeSuccess' has a wrong offset!");
static_assert(offsetof(UGAB_SmasherMelee_C, GE_SmasherMeleeFailure) == 0x0006F0, "Member 'UGAB_SmasherMelee_C::GE_SmasherMeleeFailure' has a wrong offset!");

}

#pragma pack(pop)
