#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GAB_HuskyHuskApplyFullBodyHit

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function GAB_HuskyHuskApplyFullBodyHit.GAB_HuskyHuskApplyFullBodyHit_C.ExecuteUbergraph_GAB_HuskyHuskApplyFullBodyHit
// 0x0084 (0x0084 - 0x0000)
struct GAB_HuskyHuskApplyFullBodyHit_C_ExecuteUbergraph_GAB_HuskyHuskApplyFullBodyHit final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue;            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AHuskPawn_Sploder_C*                    K2Node_DynamicCast_AsHusk_Pawn_Sploder;            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AHuskPawn_C*                            K2Node_DynamicCast_AsHusk_Pawn;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Percent_IntInt_ReturnValue2;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger2_CmpSuccess;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAllMatchingGameplayTags_self_CastInput; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAllMatchingGameplayTags_ReturnValue;   // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue3;                  // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Percent_IntInt_ReturnValue3;              // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger3_CmpSuccess;                  // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue4;                  // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue2;        // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue3;        // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue2;           // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsFrontalHit_ReturnValue;                 // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GAB_HuskyHuskApplyFullBodyHit_C_ExecuteUbergraph_GAB_HuskyHuskApplyFullBodyHit) == 0x000004, "Wrong alignment on GAB_HuskyHuskApplyFullBodyHit_C_ExecuteUbergraph_GAB_HuskyHuskApplyFullBodyHit");
static_assert(sizeof(GAB_HuskyHuskApplyFullBodyHit_C_ExecuteUbergraph_GAB_HuskyHuskApplyFullBodyHit) == 0x000084, "Wrong size on GAB_HuskyHuskApplyFullBodyHit_C_ExecuteUbergraph_GAB_HuskyHuskApplyFullBodyHit");
static_assert(offsetof(GAB_HuskyHuskApplyFullBodyHit_C_ExecuteUbergraph_GAB_HuskyHuskApplyFullBodyHit, EntryPoint) == 0x000000, "Member 'GAB_HuskyHuskApplyFullBodyHit_C_ExecuteUbergraph_GAB_HuskyHuskApplyFullBodyHit::EntryPoint' has a wrong offset!");
static_assert(offsetof(GAB_HuskyHuskApplyFullBodyHit_C_ExecuteUbergraph_GAB_HuskyHuskApplyFullBodyHit, CallFunc_GetActivatingPawn_ReturnValue) == 0x000004, "Member 'GAB_HuskyHuskApplyFullBodyHit_C_ExecuteUbergraph_GAB_HuskyHuskApplyFullBodyHit::CallFunc_GetActivatingPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_HuskyHuskApplyFullBodyHit_C_ExecuteUbergraph_GAB_HuskyHuskApplyFullBodyHit, K2Node_DynamicCast_AsHusk_Pawn_Sploder) == 0x000008, "Member 'GAB_HuskyHuskApplyFullBodyHit_C_ExecuteUbergraph_GAB_HuskyHuskApplyFullBodyHit::K2Node_DynamicCast_AsHusk_Pawn_Sploder' has a wrong offset!");
static_assert(offsetof(GAB_HuskyHuskApplyFullBodyHit_C_ExecuteUbergraph_GAB_HuskyHuskApplyFullBodyHit, K2Node_DynamicCast_bSuccess) == 0x00000C, "Member 'GAB_HuskyHuskApplyFullBodyHit_C_ExecuteUbergraph_GAB_HuskyHuskApplyFullBodyHit::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GAB_HuskyHuskApplyFullBodyHit_C_ExecuteUbergraph_GAB_HuskyHuskApplyFullBodyHit, K2Node_DynamicCast_AsHusk_Pawn) == 0x000010, "Member 'GAB_HuskyHuskApplyFullBodyHit_C_ExecuteUbergraph_GAB_HuskyHuskApplyFullBodyHit::K2Node_DynamicCast_AsHusk_Pawn' has a wrong offset!");
static_assert(offsetof(GAB_HuskyHuskApplyFullBodyHit_C_ExecuteUbergraph_GAB_HuskyHuskApplyFullBodyHit, K2Node_DynamicCast_bSuccess2) == 0x000014, "Member 'GAB_HuskyHuskApplyFullBodyHit_C_ExecuteUbergraph_GAB_HuskyHuskApplyFullBodyHit::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(GAB_HuskyHuskApplyFullBodyHit_C_ExecuteUbergraph_GAB_HuskyHuskApplyFullBodyHit, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'GAB_HuskyHuskApplyFullBodyHit_C_ExecuteUbergraph_GAB_HuskyHuskApplyFullBodyHit::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_HuskyHuskApplyFullBodyHit_C_ExecuteUbergraph_GAB_HuskyHuskApplyFullBodyHit, CallFunc_Percent_IntInt_ReturnValue) == 0x00001C, "Member 'GAB_HuskyHuskApplyFullBodyHit_C_ExecuteUbergraph_GAB_HuskyHuskApplyFullBodyHit::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_HuskyHuskApplyFullBodyHit_C_ExecuteUbergraph_GAB_HuskyHuskApplyFullBodyHit, CallFunc_Add_IntInt_ReturnValue2) == 0x000020, "Member 'GAB_HuskyHuskApplyFullBodyHit_C_ExecuteUbergraph_GAB_HuskyHuskApplyFullBodyHit::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GAB_HuskyHuskApplyFullBodyHit_C_ExecuteUbergraph_GAB_HuskyHuskApplyFullBodyHit, K2Node_SwitchInteger_CmpSuccess) == 0x000024, "Member 'GAB_HuskyHuskApplyFullBodyHit_C_ExecuteUbergraph_GAB_HuskyHuskApplyFullBodyHit::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GAB_HuskyHuskApplyFullBodyHit_C_ExecuteUbergraph_GAB_HuskyHuskApplyFullBodyHit, CallFunc_Percent_IntInt_ReturnValue2) == 0x000028, "Member 'GAB_HuskyHuskApplyFullBodyHit_C_ExecuteUbergraph_GAB_HuskyHuskApplyFullBodyHit::CallFunc_Percent_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GAB_HuskyHuskApplyFullBodyHit_C_ExecuteUbergraph_GAB_HuskyHuskApplyFullBodyHit, K2Node_SwitchInteger2_CmpSuccess) == 0x00002C, "Member 'GAB_HuskyHuskApplyFullBodyHit_C_ExecuteUbergraph_GAB_HuskyHuskApplyFullBodyHit::K2Node_SwitchInteger2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GAB_HuskyHuskApplyFullBodyHit_C_ExecuteUbergraph_GAB_HuskyHuskApplyFullBodyHit, CallFunc_HasAllMatchingGameplayTags_self_CastInput) == 0x000030, "Member 'GAB_HuskyHuskApplyFullBodyHit_C_ExecuteUbergraph_GAB_HuskyHuskApplyFullBodyHit::CallFunc_HasAllMatchingGameplayTags_self_CastInput' has a wrong offset!");
static_assert(offsetof(GAB_HuskyHuskApplyFullBodyHit_C_ExecuteUbergraph_GAB_HuskyHuskApplyFullBodyHit, CallFunc_HasAllMatchingGameplayTags_ReturnValue) == 0x000038, "Member 'GAB_HuskyHuskApplyFullBodyHit_C_ExecuteUbergraph_GAB_HuskyHuskApplyFullBodyHit::CallFunc_HasAllMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_HuskyHuskApplyFullBodyHit_C_ExecuteUbergraph_GAB_HuskyHuskApplyFullBodyHit, CallFunc_Add_IntInt_ReturnValue3) == 0x00003C, "Member 'GAB_HuskyHuskApplyFullBodyHit_C_ExecuteUbergraph_GAB_HuskyHuskApplyFullBodyHit::CallFunc_Add_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GAB_HuskyHuskApplyFullBodyHit_C_ExecuteUbergraph_GAB_HuskyHuskApplyFullBodyHit, CallFunc_Percent_IntInt_ReturnValue3) == 0x000040, "Member 'GAB_HuskyHuskApplyFullBodyHit_C_ExecuteUbergraph_GAB_HuskyHuskApplyFullBodyHit::CallFunc_Percent_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GAB_HuskyHuskApplyFullBodyHit_C_ExecuteUbergraph_GAB_HuskyHuskApplyFullBodyHit, K2Node_SwitchInteger3_CmpSuccess) == 0x000044, "Member 'GAB_HuskyHuskApplyFullBodyHit_C_ExecuteUbergraph_GAB_HuskyHuskApplyFullBodyHit::K2Node_SwitchInteger3_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GAB_HuskyHuskApplyFullBodyHit_C_ExecuteUbergraph_GAB_HuskyHuskApplyFullBodyHit, CallFunc_Add_IntInt_ReturnValue4) == 0x000048, "Member 'GAB_HuskyHuskApplyFullBodyHit_C_ExecuteUbergraph_GAB_HuskyHuskApplyFullBodyHit::CallFunc_Add_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(GAB_HuskyHuskApplyFullBodyHit_C_ExecuteUbergraph_GAB_HuskyHuskApplyFullBodyHit, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x00004C, "Member 'GAB_HuskyHuskApplyFullBodyHit_C_ExecuteUbergraph_GAB_HuskyHuskApplyFullBodyHit::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_HuskyHuskApplyFullBodyHit_C_ExecuteUbergraph_GAB_HuskyHuskApplyFullBodyHit, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000050, "Member 'GAB_HuskyHuskApplyFullBodyHit_C_ExecuteUbergraph_GAB_HuskyHuskApplyFullBodyHit::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_HuskyHuskApplyFullBodyHit_C_ExecuteUbergraph_GAB_HuskyHuskApplyFullBodyHit, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000054, "Member 'GAB_HuskyHuskApplyFullBodyHit_C_ExecuteUbergraph_GAB_HuskyHuskApplyFullBodyHit::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_HuskyHuskApplyFullBodyHit_C_ExecuteUbergraph_GAB_HuskyHuskApplyFullBodyHit, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000058, "Member 'GAB_HuskyHuskApplyFullBodyHit_C_ExecuteUbergraph_GAB_HuskyHuskApplyFullBodyHit::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_HuskyHuskApplyFullBodyHit_C_ExecuteUbergraph_GAB_HuskyHuskApplyFullBodyHit, CallFunc_Multiply_VectorFloat_ReturnValue2) == 0x000064, "Member 'GAB_HuskyHuskApplyFullBodyHit_C_ExecuteUbergraph_GAB_HuskyHuskApplyFullBodyHit::CallFunc_Multiply_VectorFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GAB_HuskyHuskApplyFullBodyHit_C_ExecuteUbergraph_GAB_HuskyHuskApplyFullBodyHit, CallFunc_Multiply_VectorFloat_ReturnValue3) == 0x000070, "Member 'GAB_HuskyHuskApplyFullBodyHit_C_ExecuteUbergraph_GAB_HuskyHuskApplyFullBodyHit::CallFunc_Multiply_VectorFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GAB_HuskyHuskApplyFullBodyHit_C_ExecuteUbergraph_GAB_HuskyHuskApplyFullBodyHit, CallFunc_GetActivatingPawn_ReturnValue2) == 0x00007C, "Member 'GAB_HuskyHuskApplyFullBodyHit_C_ExecuteUbergraph_GAB_HuskyHuskApplyFullBodyHit::CallFunc_GetActivatingPawn_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GAB_HuskyHuskApplyFullBodyHit_C_ExecuteUbergraph_GAB_HuskyHuskApplyFullBodyHit, CallFunc_IsFrontalHit_ReturnValue) == 0x000080, "Member 'GAB_HuskyHuskApplyFullBodyHit_C_ExecuteUbergraph_GAB_HuskyHuskApplyFullBodyHit::CallFunc_IsFrontalHit_ReturnValue' has a wrong offset!");

}

#pragma pack(pop)
