#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GAB_SploderPropaneRanged

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function GAB_SploderPropaneRanged.GAB_SploderPropaneRanged_C.ExecuteUbergraph_GAB_SploderPropaneRanged
// 0x0200 (0x0200 - 0x0000)
struct GAB_SploderPropaneRanged_C_ExecuteUbergraph_GAB_SploderPropaneRanged final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData2;                    // 0x0018(0x0014)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag2;                // 0x002C(0x0008)()
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData;                     // 0x0034(0x0014)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag;                 // 0x0048(0x0008)()
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0050(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0060(0x0008)()
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable2;                             // 0x0068(0x0014)()
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_ApplyGameplayEffectContainer_ReturnValue; // 0x007C(0x000C)(ConstParm, ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_Event_ApplicationTag;                       // 0x008C(0x0008)()
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData3;                    // 0x0094(0x0014)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag3;                // 0x00A8(0x0008)()
	class UFortAbilityTask_PlayMontageWaitTarget* CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue; // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate3;             // 0x00B8(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFortGameplayEffectContainerSpec       CallFunc_MakeGameplayEffectContainerSpec_ReturnValue; // 0x00CC(0x0064)()
	float                                         CallFunc_GetProjectileInitialValues_outProjectileSpeed; // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_GetProjectileInitialValues_outSpawnDirection; // 0x0134(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetProjectileInitialValues_outProjectileGravity; // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_GetProjectileInitialValues_HomingTarget;  // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetFireLocation_ReturnValue;              // 0x0148(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Conv_RotatorToVector_ReturnValue;         // 0x0154(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue;            // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AHuskPawn_Sploder_C*                    K2Node_DynamicCast_AsHusk_Pawn_Sploder;            // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetActorRotation_ReturnValue;             // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16A[0x2];                                      // 0x016A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x016C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0178(0x0080)(ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F9[0x3];                                      // 0x01F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAIAbilityTarget_ReturnValue;           // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GAB_SploderPropaneRanged_C_ExecuteUbergraph_GAB_SploderPropaneRanged) == 0x000004, "Wrong alignment on GAB_SploderPropaneRanged_C_ExecuteUbergraph_GAB_SploderPropaneRanged");
static_assert(sizeof(GAB_SploderPropaneRanged_C_ExecuteUbergraph_GAB_SploderPropaneRanged) == 0x000200, "Wrong size on GAB_SploderPropaneRanged_C_ExecuteUbergraph_GAB_SploderPropaneRanged");
static_assert(offsetof(GAB_SploderPropaneRanged_C_ExecuteUbergraph_GAB_SploderPropaneRanged, EntryPoint) == 0x000000, "Member 'GAB_SploderPropaneRanged_C_ExecuteUbergraph_GAB_SploderPropaneRanged::EntryPoint' has a wrong offset!");
static_assert(offsetof(GAB_SploderPropaneRanged_C_ExecuteUbergraph_GAB_SploderPropaneRanged, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'GAB_SploderPropaneRanged_C_ExecuteUbergraph_GAB_SploderPropaneRanged::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GAB_SploderPropaneRanged_C_ExecuteUbergraph_GAB_SploderPropaneRanged, CallFunc_Not_PreBool_ReturnValue) == 0x000014, "Member 'GAB_SploderPropaneRanged_C_ExecuteUbergraph_GAB_SploderPropaneRanged::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_SploderPropaneRanged_C_ExecuteUbergraph_GAB_SploderPropaneRanged, K2Node_CustomEvent_TargetData2) == 0x000018, "Member 'GAB_SploderPropaneRanged_C_ExecuteUbergraph_GAB_SploderPropaneRanged::K2Node_CustomEvent_TargetData2' has a wrong offset!");
static_assert(offsetof(GAB_SploderPropaneRanged_C_ExecuteUbergraph_GAB_SploderPropaneRanged, K2Node_CustomEvent_ApplicationTag2) == 0x00002C, "Member 'GAB_SploderPropaneRanged_C_ExecuteUbergraph_GAB_SploderPropaneRanged::K2Node_CustomEvent_ApplicationTag2' has a wrong offset!");
static_assert(offsetof(GAB_SploderPropaneRanged_C_ExecuteUbergraph_GAB_SploderPropaneRanged, K2Node_CustomEvent_TargetData) == 0x000034, "Member 'GAB_SploderPropaneRanged_C_ExecuteUbergraph_GAB_SploderPropaneRanged::K2Node_CustomEvent_TargetData' has a wrong offset!");
static_assert(offsetof(GAB_SploderPropaneRanged_C_ExecuteUbergraph_GAB_SploderPropaneRanged, K2Node_CustomEvent_ApplicationTag) == 0x000048, "Member 'GAB_SploderPropaneRanged_C_ExecuteUbergraph_GAB_SploderPropaneRanged::K2Node_CustomEvent_ApplicationTag' has a wrong offset!");
static_assert(offsetof(GAB_SploderPropaneRanged_C_ExecuteUbergraph_GAB_SploderPropaneRanged, K2Node_CreateDelegate_OutputDelegate2) == 0x000050, "Member 'GAB_SploderPropaneRanged_C_ExecuteUbergraph_GAB_SploderPropaneRanged::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GAB_SploderPropaneRanged_C_ExecuteUbergraph_GAB_SploderPropaneRanged, Temp_struct_Variable) == 0x000060, "Member 'GAB_SploderPropaneRanged_C_ExecuteUbergraph_GAB_SploderPropaneRanged::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GAB_SploderPropaneRanged_C_ExecuteUbergraph_GAB_SploderPropaneRanged, Temp_struct_Variable2) == 0x000068, "Member 'GAB_SploderPropaneRanged_C_ExecuteUbergraph_GAB_SploderPropaneRanged::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(GAB_SploderPropaneRanged_C_ExecuteUbergraph_GAB_SploderPropaneRanged, CallFunc_ApplyGameplayEffectContainer_ReturnValue) == 0x00007C, "Member 'GAB_SploderPropaneRanged_C_ExecuteUbergraph_GAB_SploderPropaneRanged::CallFunc_ApplyGameplayEffectContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_SploderPropaneRanged_C_ExecuteUbergraph_GAB_SploderPropaneRanged, CallFunc_K2_CommitAbility_ReturnValue) == 0x000088, "Member 'GAB_SploderPropaneRanged_C_ExecuteUbergraph_GAB_SploderPropaneRanged::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_SploderPropaneRanged_C_ExecuteUbergraph_GAB_SploderPropaneRanged, K2Node_Event_ApplicationTag) == 0x00008C, "Member 'GAB_SploderPropaneRanged_C_ExecuteUbergraph_GAB_SploderPropaneRanged::K2Node_Event_ApplicationTag' has a wrong offset!");
static_assert(offsetof(GAB_SploderPropaneRanged_C_ExecuteUbergraph_GAB_SploderPropaneRanged, K2Node_CustomEvent_TargetData3) == 0x000094, "Member 'GAB_SploderPropaneRanged_C_ExecuteUbergraph_GAB_SploderPropaneRanged::K2Node_CustomEvent_TargetData3' has a wrong offset!");
static_assert(offsetof(GAB_SploderPropaneRanged_C_ExecuteUbergraph_GAB_SploderPropaneRanged, K2Node_CustomEvent_ApplicationTag3) == 0x0000A8, "Member 'GAB_SploderPropaneRanged_C_ExecuteUbergraph_GAB_SploderPropaneRanged::K2Node_CustomEvent_ApplicationTag3' has a wrong offset!");
static_assert(offsetof(GAB_SploderPropaneRanged_C_ExecuteUbergraph_GAB_SploderPropaneRanged, CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue) == 0x0000B0, "Member 'GAB_SploderPropaneRanged_C_ExecuteUbergraph_GAB_SploderPropaneRanged::CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_SploderPropaneRanged_C_ExecuteUbergraph_GAB_SploderPropaneRanged, CallFunc_IsValid_ReturnValue) == 0x0000B4, "Member 'GAB_SploderPropaneRanged_C_ExecuteUbergraph_GAB_SploderPropaneRanged::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_SploderPropaneRanged_C_ExecuteUbergraph_GAB_SploderPropaneRanged, K2Node_CreateDelegate_OutputDelegate3) == 0x0000B8, "Member 'GAB_SploderPropaneRanged_C_ExecuteUbergraph_GAB_SploderPropaneRanged::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(GAB_SploderPropaneRanged_C_ExecuteUbergraph_GAB_SploderPropaneRanged, CallFunc_Add_IntInt_ReturnValue) == 0x0000C8, "Member 'GAB_SploderPropaneRanged_C_ExecuteUbergraph_GAB_SploderPropaneRanged::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_SploderPropaneRanged_C_ExecuteUbergraph_GAB_SploderPropaneRanged, CallFunc_MakeGameplayEffectContainerSpec_ReturnValue) == 0x0000CC, "Member 'GAB_SploderPropaneRanged_C_ExecuteUbergraph_GAB_SploderPropaneRanged::CallFunc_MakeGameplayEffectContainerSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_SploderPropaneRanged_C_ExecuteUbergraph_GAB_SploderPropaneRanged, CallFunc_GetProjectileInitialValues_outProjectileSpeed) == 0x000130, "Member 'GAB_SploderPropaneRanged_C_ExecuteUbergraph_GAB_SploderPropaneRanged::CallFunc_GetProjectileInitialValues_outProjectileSpeed' has a wrong offset!");
static_assert(offsetof(GAB_SploderPropaneRanged_C_ExecuteUbergraph_GAB_SploderPropaneRanged, CallFunc_GetProjectileInitialValues_outSpawnDirection) == 0x000134, "Member 'GAB_SploderPropaneRanged_C_ExecuteUbergraph_GAB_SploderPropaneRanged::CallFunc_GetProjectileInitialValues_outSpawnDirection' has a wrong offset!");
static_assert(offsetof(GAB_SploderPropaneRanged_C_ExecuteUbergraph_GAB_SploderPropaneRanged, CallFunc_GetProjectileInitialValues_outProjectileGravity) == 0x000140, "Member 'GAB_SploderPropaneRanged_C_ExecuteUbergraph_GAB_SploderPropaneRanged::CallFunc_GetProjectileInitialValues_outProjectileGravity' has a wrong offset!");
static_assert(offsetof(GAB_SploderPropaneRanged_C_ExecuteUbergraph_GAB_SploderPropaneRanged, CallFunc_GetProjectileInitialValues_HomingTarget) == 0x000144, "Member 'GAB_SploderPropaneRanged_C_ExecuteUbergraph_GAB_SploderPropaneRanged::CallFunc_GetProjectileInitialValues_HomingTarget' has a wrong offset!");
static_assert(offsetof(GAB_SploderPropaneRanged_C_ExecuteUbergraph_GAB_SploderPropaneRanged, CallFunc_GetFireLocation_ReturnValue) == 0x000148, "Member 'GAB_SploderPropaneRanged_C_ExecuteUbergraph_GAB_SploderPropaneRanged::CallFunc_GetFireLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_SploderPropaneRanged_C_ExecuteUbergraph_GAB_SploderPropaneRanged, CallFunc_Conv_RotatorToVector_ReturnValue) == 0x000154, "Member 'GAB_SploderPropaneRanged_C_ExecuteUbergraph_GAB_SploderPropaneRanged::CallFunc_Conv_RotatorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_SploderPropaneRanged_C_ExecuteUbergraph_GAB_SploderPropaneRanged, CallFunc_GetActivatingPawn_ReturnValue) == 0x000160, "Member 'GAB_SploderPropaneRanged_C_ExecuteUbergraph_GAB_SploderPropaneRanged::CallFunc_GetActivatingPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_SploderPropaneRanged_C_ExecuteUbergraph_GAB_SploderPropaneRanged, K2Node_DynamicCast_AsHusk_Pawn_Sploder) == 0x000164, "Member 'GAB_SploderPropaneRanged_C_ExecuteUbergraph_GAB_SploderPropaneRanged::K2Node_DynamicCast_AsHusk_Pawn_Sploder' has a wrong offset!");
static_assert(offsetof(GAB_SploderPropaneRanged_C_ExecuteUbergraph_GAB_SploderPropaneRanged, K2Node_DynamicCast_bSuccess) == 0x000168, "Member 'GAB_SploderPropaneRanged_C_ExecuteUbergraph_GAB_SploderPropaneRanged::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GAB_SploderPropaneRanged_C_ExecuteUbergraph_GAB_SploderPropaneRanged, CallFunc_SetActorRotation_ReturnValue) == 0x000169, "Member 'GAB_SploderPropaneRanged_C_ExecuteUbergraph_GAB_SploderPropaneRanged::CallFunc_SetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_SploderPropaneRanged_C_ExecuteUbergraph_GAB_SploderPropaneRanged, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x00016C, "Member 'GAB_SploderPropaneRanged_C_ExecuteUbergraph_GAB_SploderPropaneRanged::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_SploderPropaneRanged_C_ExecuteUbergraph_GAB_SploderPropaneRanged, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000178, "Member 'GAB_SploderPropaneRanged_C_ExecuteUbergraph_GAB_SploderPropaneRanged::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(GAB_SploderPropaneRanged_C_ExecuteUbergraph_GAB_SploderPropaneRanged, CallFunc_K2_SetActorLocation_ReturnValue) == 0x0001F8, "Member 'GAB_SploderPropaneRanged_C_ExecuteUbergraph_GAB_SploderPropaneRanged::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_SploderPropaneRanged_C_ExecuteUbergraph_GAB_SploderPropaneRanged, CallFunc_GetAIAbilityTarget_ReturnValue) == 0x0001FC, "Member 'GAB_SploderPropaneRanged_C_ExecuteUbergraph_GAB_SploderPropaneRanged::CallFunc_GetAIAbilityTarget_ReturnValue' has a wrong offset!");

// Function GAB_SploderPropaneRanged.GAB_SploderPropaneRanged_C.K2_TriggerFromAnimation
// 0x0008 (0x0008 - 0x0000)
struct GAB_SploderPropaneRanged_C_K2_TriggerFromAnimation final
{
public:
	struct FGameplayTag                           ApplicationTag;                                    // 0x0000(0x0008)(Parm)
};
static_assert(alignof(GAB_SploderPropaneRanged_C_K2_TriggerFromAnimation) == 0x000004, "Wrong alignment on GAB_SploderPropaneRanged_C_K2_TriggerFromAnimation");
static_assert(sizeof(GAB_SploderPropaneRanged_C_K2_TriggerFromAnimation) == 0x000008, "Wrong size on GAB_SploderPropaneRanged_C_K2_TriggerFromAnimation");
static_assert(offsetof(GAB_SploderPropaneRanged_C_K2_TriggerFromAnimation, ApplicationTag) == 0x000000, "Member 'GAB_SploderPropaneRanged_C_K2_TriggerFromAnimation::ApplicationTag' has a wrong offset!");

// Function GAB_SploderPropaneRanged.GAB_SploderPropaneRanged_C.Triggered_7140D7AF47CBF730450F82998BCBF32A
// 0x001C (0x001C - 0x0000)
struct GAB_SploderPropaneRanged_C_Triggered_7140D7AF47CBF730450F82998BCBF32A final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0014)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0014(0x0008)(Parm)
};
static_assert(alignof(GAB_SploderPropaneRanged_C_Triggered_7140D7AF47CBF730450F82998BCBF32A) == 0x000004, "Wrong alignment on GAB_SploderPropaneRanged_C_Triggered_7140D7AF47CBF730450F82998BCBF32A");
static_assert(sizeof(GAB_SploderPropaneRanged_C_Triggered_7140D7AF47CBF730450F82998BCBF32A) == 0x00001C, "Wrong size on GAB_SploderPropaneRanged_C_Triggered_7140D7AF47CBF730450F82998BCBF32A");
static_assert(offsetof(GAB_SploderPropaneRanged_C_Triggered_7140D7AF47CBF730450F82998BCBF32A, TargetData) == 0x000000, "Member 'GAB_SploderPropaneRanged_C_Triggered_7140D7AF47CBF730450F82998BCBF32A::TargetData' has a wrong offset!");
static_assert(offsetof(GAB_SploderPropaneRanged_C_Triggered_7140D7AF47CBF730450F82998BCBF32A, ApplicationTag) == 0x000014, "Member 'GAB_SploderPropaneRanged_C_Triggered_7140D7AF47CBF730450F82998BCBF32A::ApplicationTag' has a wrong offset!");

// Function GAB_SploderPropaneRanged.GAB_SploderPropaneRanged_C.Cancelled_7140D7AF47CBF730450F82998BCBF32A
// 0x001C (0x001C - 0x0000)
struct GAB_SploderPropaneRanged_C_Cancelled_7140D7AF47CBF730450F82998BCBF32A final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0014)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0014(0x0008)(Parm)
};
static_assert(alignof(GAB_SploderPropaneRanged_C_Cancelled_7140D7AF47CBF730450F82998BCBF32A) == 0x000004, "Wrong alignment on GAB_SploderPropaneRanged_C_Cancelled_7140D7AF47CBF730450F82998BCBF32A");
static_assert(sizeof(GAB_SploderPropaneRanged_C_Cancelled_7140D7AF47CBF730450F82998BCBF32A) == 0x00001C, "Wrong size on GAB_SploderPropaneRanged_C_Cancelled_7140D7AF47CBF730450F82998BCBF32A");
static_assert(offsetof(GAB_SploderPropaneRanged_C_Cancelled_7140D7AF47CBF730450F82998BCBF32A, TargetData) == 0x000000, "Member 'GAB_SploderPropaneRanged_C_Cancelled_7140D7AF47CBF730450F82998BCBF32A::TargetData' has a wrong offset!");
static_assert(offsetof(GAB_SploderPropaneRanged_C_Cancelled_7140D7AF47CBF730450F82998BCBF32A, ApplicationTag) == 0x000014, "Member 'GAB_SploderPropaneRanged_C_Cancelled_7140D7AF47CBF730450F82998BCBF32A::ApplicationTag' has a wrong offset!");

// Function GAB_SploderPropaneRanged.GAB_SploderPropaneRanged_C.Completed_7140D7AF47CBF730450F82998BCBF32A
// 0x001C (0x001C - 0x0000)
struct GAB_SploderPropaneRanged_C_Completed_7140D7AF47CBF730450F82998BCBF32A final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0014)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0014(0x0008)(Parm)
};
static_assert(alignof(GAB_SploderPropaneRanged_C_Completed_7140D7AF47CBF730450F82998BCBF32A) == 0x000004, "Wrong alignment on GAB_SploderPropaneRanged_C_Completed_7140D7AF47CBF730450F82998BCBF32A");
static_assert(sizeof(GAB_SploderPropaneRanged_C_Completed_7140D7AF47CBF730450F82998BCBF32A) == 0x00001C, "Wrong size on GAB_SploderPropaneRanged_C_Completed_7140D7AF47CBF730450F82998BCBF32A");
static_assert(offsetof(GAB_SploderPropaneRanged_C_Completed_7140D7AF47CBF730450F82998BCBF32A, TargetData) == 0x000000, "Member 'GAB_SploderPropaneRanged_C_Completed_7140D7AF47CBF730450F82998BCBF32A::TargetData' has a wrong offset!");
static_assert(offsetof(GAB_SploderPropaneRanged_C_Completed_7140D7AF47CBF730450F82998BCBF32A, ApplicationTag) == 0x000014, "Member 'GAB_SploderPropaneRanged_C_Completed_7140D7AF47CBF730450F82998BCBF32A::ApplicationTag' has a wrong offset!");

}

#pragma pack(pop)
