#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GAB_SmasherRoar

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function GAB_SmasherRoar.GAB_SmasherRoar_C.K2_CanActivateAbility
// 0x0078 (0x0078 - 0x0000)
struct GAB_SmasherRoar_C_K2_CanActivateAbility final
{
public:
	struct FGameplayAbilityActorInfo              ActorInfo;                                         // 0x0000(0x0034)(Parm, ContainsInstancedReference)
	struct FGameplayTagContainer                  RelevantTags;                                      // 0x0034(0x0018)(Parm, OutParm)
	bool                                          ReturnValue;                                       // 0x004C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAIAbilityTarget_ReturnValue;           // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ABuildingActor*                         K2Node_DynamicCast_AsBuilding_Actor;               // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingFloor*                         K2Node_DynamicCast_AsBuilding_Floor;               // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62[0x2];                                       // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingRoof*                          K2Node_DynamicCast_AsBuilding_Roof;                // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingStairs*                        K2Node_DynamicCast_AsBuilding_Stairs;              // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue2;                   // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x0073(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue3;                   // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GAB_SmasherRoar_C_K2_CanActivateAbility) == 0x000004, "Wrong alignment on GAB_SmasherRoar_C_K2_CanActivateAbility");
static_assert(sizeof(GAB_SmasherRoar_C_K2_CanActivateAbility) == 0x000078, "Wrong size on GAB_SmasherRoar_C_K2_CanActivateAbility");
static_assert(offsetof(GAB_SmasherRoar_C_K2_CanActivateAbility, ActorInfo) == 0x000000, "Member 'GAB_SmasherRoar_C_K2_CanActivateAbility::ActorInfo' has a wrong offset!");
static_assert(offsetof(GAB_SmasherRoar_C_K2_CanActivateAbility, RelevantTags) == 0x000034, "Member 'GAB_SmasherRoar_C_K2_CanActivateAbility::RelevantTags' has a wrong offset!");
static_assert(offsetof(GAB_SmasherRoar_C_K2_CanActivateAbility, ReturnValue) == 0x00004C, "Member 'GAB_SmasherRoar_C_K2_CanActivateAbility::ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_SmasherRoar_C_K2_CanActivateAbility, CallFunc_GetAIAbilityTarget_ReturnValue) == 0x000050, "Member 'GAB_SmasherRoar_C_K2_CanActivateAbility::CallFunc_GetAIAbilityTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_SmasherRoar_C_K2_CanActivateAbility, K2Node_DynamicCast_AsBuilding_Actor) == 0x000054, "Member 'GAB_SmasherRoar_C_K2_CanActivateAbility::K2Node_DynamicCast_AsBuilding_Actor' has a wrong offset!");
static_assert(offsetof(GAB_SmasherRoar_C_K2_CanActivateAbility, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'GAB_SmasherRoar_C_K2_CanActivateAbility::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GAB_SmasherRoar_C_K2_CanActivateAbility, K2Node_DynamicCast_AsBuilding_Floor) == 0x00005C, "Member 'GAB_SmasherRoar_C_K2_CanActivateAbility::K2Node_DynamicCast_AsBuilding_Floor' has a wrong offset!");
static_assert(offsetof(GAB_SmasherRoar_C_K2_CanActivateAbility, K2Node_DynamicCast_bSuccess2) == 0x000060, "Member 'GAB_SmasherRoar_C_K2_CanActivateAbility::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(GAB_SmasherRoar_C_K2_CanActivateAbility, CallFunc_Not_PreBool_ReturnValue) == 0x000061, "Member 'GAB_SmasherRoar_C_K2_CanActivateAbility::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_SmasherRoar_C_K2_CanActivateAbility, K2Node_DynamicCast_AsBuilding_Roof) == 0x000064, "Member 'GAB_SmasherRoar_C_K2_CanActivateAbility::K2Node_DynamicCast_AsBuilding_Roof' has a wrong offset!");
static_assert(offsetof(GAB_SmasherRoar_C_K2_CanActivateAbility, K2Node_DynamicCast_bSuccess3) == 0x000068, "Member 'GAB_SmasherRoar_C_K2_CanActivateAbility::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(GAB_SmasherRoar_C_K2_CanActivateAbility, K2Node_DynamicCast_AsBuilding_Stairs) == 0x00006C, "Member 'GAB_SmasherRoar_C_K2_CanActivateAbility::K2Node_DynamicCast_AsBuilding_Stairs' has a wrong offset!");
static_assert(offsetof(GAB_SmasherRoar_C_K2_CanActivateAbility, K2Node_DynamicCast_bSuccess4) == 0x000070, "Member 'GAB_SmasherRoar_C_K2_CanActivateAbility::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(GAB_SmasherRoar_C_K2_CanActivateAbility, CallFunc_BooleanOR_ReturnValue) == 0x000071, "Member 'GAB_SmasherRoar_C_K2_CanActivateAbility::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_SmasherRoar_C_K2_CanActivateAbility, CallFunc_BooleanOR_ReturnValue2) == 0x000072, "Member 'GAB_SmasherRoar_C_K2_CanActivateAbility::CallFunc_BooleanOR_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GAB_SmasherRoar_C_K2_CanActivateAbility, CallFunc_Not_PreBool_ReturnValue2) == 0x000073, "Member 'GAB_SmasherRoar_C_K2_CanActivateAbility::CallFunc_Not_PreBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GAB_SmasherRoar_C_K2_CanActivateAbility, CallFunc_BooleanAND_ReturnValue) == 0x000074, "Member 'GAB_SmasherRoar_C_K2_CanActivateAbility::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_SmasherRoar_C_K2_CanActivateAbility, CallFunc_BooleanOR_ReturnValue3) == 0x000075, "Member 'GAB_SmasherRoar_C_K2_CanActivateAbility::CallFunc_BooleanOR_ReturnValue3' has a wrong offset!");

}

#pragma pack(pop)
