#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GAB_HuskBeehiveRanged

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function GAB_HuskBeehiveRanged.GAB_HuskBeehiveRanged_C.ExecuteUbergraph_GAB_HuskBeehiveRanged
// 0x0158 (0x0158 - 0x0000)
struct GAB_HuskBeehiveRanged_C_ExecuteUbergraph_GAB_HuskBeehiveRanged final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFortGameplayEffectContainerSpec       CallFunc_MakeGameplayEffectContainerSpec_ReturnValue; // 0x0004(0x0064)()
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate;              // 0x0068(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData3;                    // 0x0078(0x0014)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag3;                // 0x008C(0x0008)()
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData2;                    // 0x0094(0x0014)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag2;                // 0x00A8(0x0008)()
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate2;             // 0x00B0(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData;                     // 0x00C0(0x0014)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag;                 // 0x00D4(0x0008)()
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate3;             // 0x00DC(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x00EC(0x0008)()
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable2;                             // 0x00F4(0x0014)()
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_ApplyGameplayEffectContainer_ReturnValue; // 0x0108(0x000C)(ConstParm, ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_115[0x3];                                      // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_Event_ApplicationTag;                       // 0x0118(0x0008)()
	class UFortAbilityTask_PlayMontageWaitTarget* CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue; // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue;            // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x3];                                      // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetFireLocation_ReturnValue;              // 0x012C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetProjectileInitialValues_outProjectileSpeed; // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_GetProjectileInitialValues_outSpawnDirection; // 0x013C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetProjectileInitialValues_outProjectileGravity; // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_GetProjectileInitialValues_HomingTarget;  // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortProjectileBase*                    CallFunc_SpawnProjectile_ReturnValue;              // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GAB_HuskBeehiveRanged_C_ExecuteUbergraph_GAB_HuskBeehiveRanged) == 0x000004, "Wrong alignment on GAB_HuskBeehiveRanged_C_ExecuteUbergraph_GAB_HuskBeehiveRanged");
static_assert(sizeof(GAB_HuskBeehiveRanged_C_ExecuteUbergraph_GAB_HuskBeehiveRanged) == 0x000158, "Wrong size on GAB_HuskBeehiveRanged_C_ExecuteUbergraph_GAB_HuskBeehiveRanged");
static_assert(offsetof(GAB_HuskBeehiveRanged_C_ExecuteUbergraph_GAB_HuskBeehiveRanged, EntryPoint) == 0x000000, "Member 'GAB_HuskBeehiveRanged_C_ExecuteUbergraph_GAB_HuskBeehiveRanged::EntryPoint' has a wrong offset!");
static_assert(offsetof(GAB_HuskBeehiveRanged_C_ExecuteUbergraph_GAB_HuskBeehiveRanged, CallFunc_MakeGameplayEffectContainerSpec_ReturnValue) == 0x000004, "Member 'GAB_HuskBeehiveRanged_C_ExecuteUbergraph_GAB_HuskBeehiveRanged::CallFunc_MakeGameplayEffectContainerSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_HuskBeehiveRanged_C_ExecuteUbergraph_GAB_HuskBeehiveRanged, K2Node_CreateDelegate_OutputDelegate) == 0x000068, "Member 'GAB_HuskBeehiveRanged_C_ExecuteUbergraph_GAB_HuskBeehiveRanged::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GAB_HuskBeehiveRanged_C_ExecuteUbergraph_GAB_HuskBeehiveRanged, K2Node_CustomEvent_TargetData3) == 0x000078, "Member 'GAB_HuskBeehiveRanged_C_ExecuteUbergraph_GAB_HuskBeehiveRanged::K2Node_CustomEvent_TargetData3' has a wrong offset!");
static_assert(offsetof(GAB_HuskBeehiveRanged_C_ExecuteUbergraph_GAB_HuskBeehiveRanged, K2Node_CustomEvent_ApplicationTag3) == 0x00008C, "Member 'GAB_HuskBeehiveRanged_C_ExecuteUbergraph_GAB_HuskBeehiveRanged::K2Node_CustomEvent_ApplicationTag3' has a wrong offset!");
static_assert(offsetof(GAB_HuskBeehiveRanged_C_ExecuteUbergraph_GAB_HuskBeehiveRanged, K2Node_CustomEvent_TargetData2) == 0x000094, "Member 'GAB_HuskBeehiveRanged_C_ExecuteUbergraph_GAB_HuskBeehiveRanged::K2Node_CustomEvent_TargetData2' has a wrong offset!");
static_assert(offsetof(GAB_HuskBeehiveRanged_C_ExecuteUbergraph_GAB_HuskBeehiveRanged, K2Node_CustomEvent_ApplicationTag2) == 0x0000A8, "Member 'GAB_HuskBeehiveRanged_C_ExecuteUbergraph_GAB_HuskBeehiveRanged::K2Node_CustomEvent_ApplicationTag2' has a wrong offset!");
static_assert(offsetof(GAB_HuskBeehiveRanged_C_ExecuteUbergraph_GAB_HuskBeehiveRanged, K2Node_CreateDelegate_OutputDelegate2) == 0x0000B0, "Member 'GAB_HuskBeehiveRanged_C_ExecuteUbergraph_GAB_HuskBeehiveRanged::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GAB_HuskBeehiveRanged_C_ExecuteUbergraph_GAB_HuskBeehiveRanged, K2Node_CustomEvent_TargetData) == 0x0000C0, "Member 'GAB_HuskBeehiveRanged_C_ExecuteUbergraph_GAB_HuskBeehiveRanged::K2Node_CustomEvent_TargetData' has a wrong offset!");
static_assert(offsetof(GAB_HuskBeehiveRanged_C_ExecuteUbergraph_GAB_HuskBeehiveRanged, K2Node_CustomEvent_ApplicationTag) == 0x0000D4, "Member 'GAB_HuskBeehiveRanged_C_ExecuteUbergraph_GAB_HuskBeehiveRanged::K2Node_CustomEvent_ApplicationTag' has a wrong offset!");
static_assert(offsetof(GAB_HuskBeehiveRanged_C_ExecuteUbergraph_GAB_HuskBeehiveRanged, K2Node_CreateDelegate_OutputDelegate3) == 0x0000DC, "Member 'GAB_HuskBeehiveRanged_C_ExecuteUbergraph_GAB_HuskBeehiveRanged::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(GAB_HuskBeehiveRanged_C_ExecuteUbergraph_GAB_HuskBeehiveRanged, Temp_struct_Variable) == 0x0000EC, "Member 'GAB_HuskBeehiveRanged_C_ExecuteUbergraph_GAB_HuskBeehiveRanged::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GAB_HuskBeehiveRanged_C_ExecuteUbergraph_GAB_HuskBeehiveRanged, Temp_struct_Variable2) == 0x0000F4, "Member 'GAB_HuskBeehiveRanged_C_ExecuteUbergraph_GAB_HuskBeehiveRanged::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(GAB_HuskBeehiveRanged_C_ExecuteUbergraph_GAB_HuskBeehiveRanged, CallFunc_ApplyGameplayEffectContainer_ReturnValue) == 0x000108, "Member 'GAB_HuskBeehiveRanged_C_ExecuteUbergraph_GAB_HuskBeehiveRanged::CallFunc_ApplyGameplayEffectContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_HuskBeehiveRanged_C_ExecuteUbergraph_GAB_HuskBeehiveRanged, CallFunc_K2_CommitAbility_ReturnValue) == 0x000114, "Member 'GAB_HuskBeehiveRanged_C_ExecuteUbergraph_GAB_HuskBeehiveRanged::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_HuskBeehiveRanged_C_ExecuteUbergraph_GAB_HuskBeehiveRanged, K2Node_Event_ApplicationTag) == 0x000118, "Member 'GAB_HuskBeehiveRanged_C_ExecuteUbergraph_GAB_HuskBeehiveRanged::K2Node_Event_ApplicationTag' has a wrong offset!");
static_assert(offsetof(GAB_HuskBeehiveRanged_C_ExecuteUbergraph_GAB_HuskBeehiveRanged, CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue) == 0x000120, "Member 'GAB_HuskBeehiveRanged_C_ExecuteUbergraph_GAB_HuskBeehiveRanged::CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_HuskBeehiveRanged_C_ExecuteUbergraph_GAB_HuskBeehiveRanged, CallFunc_GetActivatingPawn_ReturnValue) == 0x000124, "Member 'GAB_HuskBeehiveRanged_C_ExecuteUbergraph_GAB_HuskBeehiveRanged::CallFunc_GetActivatingPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_HuskBeehiveRanged_C_ExecuteUbergraph_GAB_HuskBeehiveRanged, CallFunc_IsValid_ReturnValue) == 0x000128, "Member 'GAB_HuskBeehiveRanged_C_ExecuteUbergraph_GAB_HuskBeehiveRanged::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_HuskBeehiveRanged_C_ExecuteUbergraph_GAB_HuskBeehiveRanged, CallFunc_GetFireLocation_ReturnValue) == 0x00012C, "Member 'GAB_HuskBeehiveRanged_C_ExecuteUbergraph_GAB_HuskBeehiveRanged::CallFunc_GetFireLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_HuskBeehiveRanged_C_ExecuteUbergraph_GAB_HuskBeehiveRanged, CallFunc_GetProjectileInitialValues_outProjectileSpeed) == 0x000138, "Member 'GAB_HuskBeehiveRanged_C_ExecuteUbergraph_GAB_HuskBeehiveRanged::CallFunc_GetProjectileInitialValues_outProjectileSpeed' has a wrong offset!");
static_assert(offsetof(GAB_HuskBeehiveRanged_C_ExecuteUbergraph_GAB_HuskBeehiveRanged, CallFunc_GetProjectileInitialValues_outSpawnDirection) == 0x00013C, "Member 'GAB_HuskBeehiveRanged_C_ExecuteUbergraph_GAB_HuskBeehiveRanged::CallFunc_GetProjectileInitialValues_outSpawnDirection' has a wrong offset!");
static_assert(offsetof(GAB_HuskBeehiveRanged_C_ExecuteUbergraph_GAB_HuskBeehiveRanged, CallFunc_GetProjectileInitialValues_outProjectileGravity) == 0x000148, "Member 'GAB_HuskBeehiveRanged_C_ExecuteUbergraph_GAB_HuskBeehiveRanged::CallFunc_GetProjectileInitialValues_outProjectileGravity' has a wrong offset!");
static_assert(offsetof(GAB_HuskBeehiveRanged_C_ExecuteUbergraph_GAB_HuskBeehiveRanged, CallFunc_GetProjectileInitialValues_HomingTarget) == 0x00014C, "Member 'GAB_HuskBeehiveRanged_C_ExecuteUbergraph_GAB_HuskBeehiveRanged::CallFunc_GetProjectileInitialValues_HomingTarget' has a wrong offset!");
static_assert(offsetof(GAB_HuskBeehiveRanged_C_ExecuteUbergraph_GAB_HuskBeehiveRanged, CallFunc_SpawnProjectile_ReturnValue) == 0x000150, "Member 'GAB_HuskBeehiveRanged_C_ExecuteUbergraph_GAB_HuskBeehiveRanged::CallFunc_SpawnProjectile_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_HuskBeehiveRanged_C_ExecuteUbergraph_GAB_HuskBeehiveRanged, CallFunc_Add_IntInt_ReturnValue) == 0x000154, "Member 'GAB_HuskBeehiveRanged_C_ExecuteUbergraph_GAB_HuskBeehiveRanged::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function GAB_HuskBeehiveRanged.GAB_HuskBeehiveRanged_C.K2_TriggerFromAnimation
// 0x0008 (0x0008 - 0x0000)
struct GAB_HuskBeehiveRanged_C_K2_TriggerFromAnimation final
{
public:
	struct FGameplayTag                           ApplicationTag;                                    // 0x0000(0x0008)(Parm)
};
static_assert(alignof(GAB_HuskBeehiveRanged_C_K2_TriggerFromAnimation) == 0x000004, "Wrong alignment on GAB_HuskBeehiveRanged_C_K2_TriggerFromAnimation");
static_assert(sizeof(GAB_HuskBeehiveRanged_C_K2_TriggerFromAnimation) == 0x000008, "Wrong size on GAB_HuskBeehiveRanged_C_K2_TriggerFromAnimation");
static_assert(offsetof(GAB_HuskBeehiveRanged_C_K2_TriggerFromAnimation, ApplicationTag) == 0x000000, "Member 'GAB_HuskBeehiveRanged_C_K2_TriggerFromAnimation::ApplicationTag' has a wrong offset!");

// Function GAB_HuskBeehiveRanged.GAB_HuskBeehiveRanged_C.Triggered_649D4C464F3D6EAB2763FEA90893B790
// 0x001C (0x001C - 0x0000)
struct GAB_HuskBeehiveRanged_C_Triggered_649D4C464F3D6EAB2763FEA90893B790 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0014)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0014(0x0008)(Parm)
};
static_assert(alignof(GAB_HuskBeehiveRanged_C_Triggered_649D4C464F3D6EAB2763FEA90893B790) == 0x000004, "Wrong alignment on GAB_HuskBeehiveRanged_C_Triggered_649D4C464F3D6EAB2763FEA90893B790");
static_assert(sizeof(GAB_HuskBeehiveRanged_C_Triggered_649D4C464F3D6EAB2763FEA90893B790) == 0x00001C, "Wrong size on GAB_HuskBeehiveRanged_C_Triggered_649D4C464F3D6EAB2763FEA90893B790");
static_assert(offsetof(GAB_HuskBeehiveRanged_C_Triggered_649D4C464F3D6EAB2763FEA90893B790, TargetData) == 0x000000, "Member 'GAB_HuskBeehiveRanged_C_Triggered_649D4C464F3D6EAB2763FEA90893B790::TargetData' has a wrong offset!");
static_assert(offsetof(GAB_HuskBeehiveRanged_C_Triggered_649D4C464F3D6EAB2763FEA90893B790, ApplicationTag) == 0x000014, "Member 'GAB_HuskBeehiveRanged_C_Triggered_649D4C464F3D6EAB2763FEA90893B790::ApplicationTag' has a wrong offset!");

// Function GAB_HuskBeehiveRanged.GAB_HuskBeehiveRanged_C.Cancelled_649D4C464F3D6EAB2763FEA90893B790
// 0x001C (0x001C - 0x0000)
struct GAB_HuskBeehiveRanged_C_Cancelled_649D4C464F3D6EAB2763FEA90893B790 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0014)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0014(0x0008)(Parm)
};
static_assert(alignof(GAB_HuskBeehiveRanged_C_Cancelled_649D4C464F3D6EAB2763FEA90893B790) == 0x000004, "Wrong alignment on GAB_HuskBeehiveRanged_C_Cancelled_649D4C464F3D6EAB2763FEA90893B790");
static_assert(sizeof(GAB_HuskBeehiveRanged_C_Cancelled_649D4C464F3D6EAB2763FEA90893B790) == 0x00001C, "Wrong size on GAB_HuskBeehiveRanged_C_Cancelled_649D4C464F3D6EAB2763FEA90893B790");
static_assert(offsetof(GAB_HuskBeehiveRanged_C_Cancelled_649D4C464F3D6EAB2763FEA90893B790, TargetData) == 0x000000, "Member 'GAB_HuskBeehiveRanged_C_Cancelled_649D4C464F3D6EAB2763FEA90893B790::TargetData' has a wrong offset!");
static_assert(offsetof(GAB_HuskBeehiveRanged_C_Cancelled_649D4C464F3D6EAB2763FEA90893B790, ApplicationTag) == 0x000014, "Member 'GAB_HuskBeehiveRanged_C_Cancelled_649D4C464F3D6EAB2763FEA90893B790::ApplicationTag' has a wrong offset!");

// Function GAB_HuskBeehiveRanged.GAB_HuskBeehiveRanged_C.Completed_649D4C464F3D6EAB2763FEA90893B790
// 0x001C (0x001C - 0x0000)
struct GAB_HuskBeehiveRanged_C_Completed_649D4C464F3D6EAB2763FEA90893B790 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0014)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0014(0x0008)(Parm)
};
static_assert(alignof(GAB_HuskBeehiveRanged_C_Completed_649D4C464F3D6EAB2763FEA90893B790) == 0x000004, "Wrong alignment on GAB_HuskBeehiveRanged_C_Completed_649D4C464F3D6EAB2763FEA90893B790");
static_assert(sizeof(GAB_HuskBeehiveRanged_C_Completed_649D4C464F3D6EAB2763FEA90893B790) == 0x00001C, "Wrong size on GAB_HuskBeehiveRanged_C_Completed_649D4C464F3D6EAB2763FEA90893B790");
static_assert(offsetof(GAB_HuskBeehiveRanged_C_Completed_649D4C464F3D6EAB2763FEA90893B790, TargetData) == 0x000000, "Member 'GAB_HuskBeehiveRanged_C_Completed_649D4C464F3D6EAB2763FEA90893B790::TargetData' has a wrong offset!");
static_assert(offsetof(GAB_HuskBeehiveRanged_C_Completed_649D4C464F3D6EAB2763FEA90893B790, ApplicationTag) == 0x000014, "Member 'GAB_HuskBeehiveRanged_C_Completed_649D4C464F3D6EAB2763FEA90893B790::ApplicationTag' has a wrong offset!");

// Function GAB_HuskBeehiveRanged.GAB_HuskBeehiveRanged_C.K2_CanActivateAbility
// 0x0060 (0x0060 - 0x0000)
struct GAB_HuskBeehiveRanged_C_K2_CanActivateAbility final
{
public:
	struct FGameplayAbilityActorInfo              ActorInfo;                                         // 0x0000(0x0034)(Parm, ContainsInstancedReference)
	struct FGameplayTagContainer                  RelevantTags;                                      // 0x0034(0x0018)(Parm, OutParm)
	bool                                          ReturnValue;                                       // 0x004C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E[0x2];                                       // 0x004E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAIAbilityTarget_ReturnValue;           // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GAB_HuskBeehiveRanged_C_K2_CanActivateAbility) == 0x000004, "Wrong alignment on GAB_HuskBeehiveRanged_C_K2_CanActivateAbility");
static_assert(sizeof(GAB_HuskBeehiveRanged_C_K2_CanActivateAbility) == 0x000060, "Wrong size on GAB_HuskBeehiveRanged_C_K2_CanActivateAbility");
static_assert(offsetof(GAB_HuskBeehiveRanged_C_K2_CanActivateAbility, ActorInfo) == 0x000000, "Member 'GAB_HuskBeehiveRanged_C_K2_CanActivateAbility::ActorInfo' has a wrong offset!");
static_assert(offsetof(GAB_HuskBeehiveRanged_C_K2_CanActivateAbility, RelevantTags) == 0x000034, "Member 'GAB_HuskBeehiveRanged_C_K2_CanActivateAbility::RelevantTags' has a wrong offset!");
static_assert(offsetof(GAB_HuskBeehiveRanged_C_K2_CanActivateAbility, ReturnValue) == 0x00004C, "Member 'GAB_HuskBeehiveRanged_C_K2_CanActivateAbility::ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_HuskBeehiveRanged_C_K2_CanActivateAbility, Temp_bool_Variable) == 0x00004D, "Member 'GAB_HuskBeehiveRanged_C_K2_CanActivateAbility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GAB_HuskBeehiveRanged_C_K2_CanActivateAbility, CallFunc_GetAIAbilityTarget_ReturnValue) == 0x000050, "Member 'GAB_HuskBeehiveRanged_C_K2_CanActivateAbility::CallFunc_GetAIAbilityTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_HuskBeehiveRanged_C_K2_CanActivateAbility, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000054, "Member 'GAB_HuskBeehiveRanged_C_K2_CanActivateAbility::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_HuskBeehiveRanged_C_K2_CanActivateAbility, K2Node_DynamicCast_AsFort_Pawn) == 0x000058, "Member 'GAB_HuskBeehiveRanged_C_K2_CanActivateAbility::K2Node_DynamicCast_AsFort_Pawn' has a wrong offset!");
static_assert(offsetof(GAB_HuskBeehiveRanged_C_K2_CanActivateAbility, K2Node_DynamicCast_bSuccess) == 0x00005C, "Member 'GAB_HuskBeehiveRanged_C_K2_CanActivateAbility::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GAB_HuskBeehiveRanged_C_K2_CanActivateAbility, CallFunc_BooleanOR_ReturnValue) == 0x00005D, "Member 'GAB_HuskBeehiveRanged_C_K2_CanActivateAbility::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

}

#pragma pack(pop)
