#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GAB_HuskyHuskApplyKnockback

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function GAB_HuskyHuskApplyKnockback.GAB_HuskyHuskApplyKnockback_C.ExecuteUbergraph_GAB_HuskyHuskApplyKnockback
// 0x0018 (0x0018 - 0x0000)
struct GAB_HuskyHuskApplyKnockback_C_ExecuteUbergraph_GAB_HuskyHuskApplyKnockback final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue;            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsFrontalHit_ReturnValue;                 // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GAB_HuskyHuskApplyKnockback_C_ExecuteUbergraph_GAB_HuskyHuskApplyKnockback) == 0x000004, "Wrong alignment on GAB_HuskyHuskApplyKnockback_C_ExecuteUbergraph_GAB_HuskyHuskApplyKnockback");
static_assert(sizeof(GAB_HuskyHuskApplyKnockback_C_ExecuteUbergraph_GAB_HuskyHuskApplyKnockback) == 0x000018, "Wrong size on GAB_HuskyHuskApplyKnockback_C_ExecuteUbergraph_GAB_HuskyHuskApplyKnockback");
static_assert(offsetof(GAB_HuskyHuskApplyKnockback_C_ExecuteUbergraph_GAB_HuskyHuskApplyKnockback, EntryPoint) == 0x000000, "Member 'GAB_HuskyHuskApplyKnockback_C_ExecuteUbergraph_GAB_HuskyHuskApplyKnockback::EntryPoint' has a wrong offset!");
static_assert(offsetof(GAB_HuskyHuskApplyKnockback_C_ExecuteUbergraph_GAB_HuskyHuskApplyKnockback, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000004, "Member 'GAB_HuskyHuskApplyKnockback_C_ExecuteUbergraph_GAB_HuskyHuskApplyKnockback::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_HuskyHuskApplyKnockback_C_ExecuteUbergraph_GAB_HuskyHuskApplyKnockback, CallFunc_GetActivatingPawn_ReturnValue) == 0x000010, "Member 'GAB_HuskyHuskApplyKnockback_C_ExecuteUbergraph_GAB_HuskyHuskApplyKnockback::CallFunc_GetActivatingPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_HuskyHuskApplyKnockback_C_ExecuteUbergraph_GAB_HuskyHuskApplyKnockback, CallFunc_IsFrontalHit_ReturnValue) == 0x000014, "Member 'GAB_HuskyHuskApplyKnockback_C_ExecuteUbergraph_GAB_HuskyHuskApplyKnockback::CallFunc_IsFrontalHit_ReturnValue' has a wrong offset!");

}

#pragma pack(pop)
