#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GAB_RemoveBeehiveGEs

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function GAB_RemoveBeehiveGEs.GAB_RemoveBeehiveGEs_C.ExecuteUbergraph_GAB_RemoveBeehiveGEs
// 0x000C (0x000C - 0x0000)
struct GAB_RemoveBeehiveGEs_C_ExecuteUbergraph_GAB_RemoveBeehiveGEs final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x0008(0x0004)()
};
static_assert(alignof(GAB_RemoveBeehiveGEs_C_ExecuteUbergraph_GAB_RemoveBeehiveGEs) == 0x000004, "Wrong alignment on GAB_RemoveBeehiveGEs_C_ExecuteUbergraph_GAB_RemoveBeehiveGEs");
static_assert(sizeof(GAB_RemoveBeehiveGEs_C_ExecuteUbergraph_GAB_RemoveBeehiveGEs) == 0x00000C, "Wrong size on GAB_RemoveBeehiveGEs_C_ExecuteUbergraph_GAB_RemoveBeehiveGEs");
static_assert(offsetof(GAB_RemoveBeehiveGEs_C_ExecuteUbergraph_GAB_RemoveBeehiveGEs, EntryPoint) == 0x000000, "Member 'GAB_RemoveBeehiveGEs_C_ExecuteUbergraph_GAB_RemoveBeehiveGEs::EntryPoint' has a wrong offset!");
static_assert(offsetof(GAB_RemoveBeehiveGEs_C_ExecuteUbergraph_GAB_RemoveBeehiveGEs, CallFunc_K2_CommitAbility_ReturnValue) == 0x000004, "Member 'GAB_RemoveBeehiveGEs_C_ExecuteUbergraph_GAB_RemoveBeehiveGEs::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_RemoveBeehiveGEs_C_ExecuteUbergraph_GAB_RemoveBeehiveGEs, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x000008, "Member 'GAB_RemoveBeehiveGEs_C_ExecuteUbergraph_GAB_RemoveBeehiveGEs::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");

}

#pragma pack(pop)
