#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GAB_SmasherRadialMeleeRampageFrustration

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function GAB_SmasherRadialMeleeRampageFrustration.GAB_SmasherRadialMeleeRampageFrustration_C.ExecuteUbergraph_GAB_SmasherRadialMeleeRampageFrustration
// 0x00CC (0x00CC - 0x0000)
struct GAB_SmasherRadialMeleeRampageFrustration_C_ExecuteUbergraph_GAB_SmasherRadialMeleeRampageFrustration final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue;            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ASmasherPawn_BossRampage_C*             K2Node_DynamicCast_AsSmasher_Pawn_Boss_Rampage;    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData3;                    // 0x0020(0x0014)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag3;                // 0x0034(0x0008)()
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData2;                    // 0x003C(0x0014)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag2;                // 0x0050(0x0008)()
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData;                     // 0x0068(0x0014)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag;                 // 0x007C(0x0008)()
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate3;             // 0x0084(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0094(0x0008)()
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable2;                             // 0x009C(0x0014)()
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_ApplyGameplayEffectContainer_ReturnValue; // 0x00B0(0x000C)(ConstParm, ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilityTask_PlayMontageWaitTarget* CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue; // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x00C8(0x0004)()
};
static_assert(alignof(GAB_SmasherRadialMeleeRampageFrustration_C_ExecuteUbergraph_GAB_SmasherRadialMeleeRampageFrustration) == 0x000004, "Wrong alignment on GAB_SmasherRadialMeleeRampageFrustration_C_ExecuteUbergraph_GAB_SmasherRadialMeleeRampageFrustration");
static_assert(sizeof(GAB_SmasherRadialMeleeRampageFrustration_C_ExecuteUbergraph_GAB_SmasherRadialMeleeRampageFrustration) == 0x0000CC, "Wrong size on GAB_SmasherRadialMeleeRampageFrustration_C_ExecuteUbergraph_GAB_SmasherRadialMeleeRampageFrustration");
static_assert(offsetof(GAB_SmasherRadialMeleeRampageFrustration_C_ExecuteUbergraph_GAB_SmasherRadialMeleeRampageFrustration, EntryPoint) == 0x000000, "Member 'GAB_SmasherRadialMeleeRampageFrustration_C_ExecuteUbergraph_GAB_SmasherRadialMeleeRampageFrustration::EntryPoint' has a wrong offset!");
static_assert(offsetof(GAB_SmasherRadialMeleeRampageFrustration_C_ExecuteUbergraph_GAB_SmasherRadialMeleeRampageFrustration, CallFunc_GetActivatingPawn_ReturnValue) == 0x000004, "Member 'GAB_SmasherRadialMeleeRampageFrustration_C_ExecuteUbergraph_GAB_SmasherRadialMeleeRampageFrustration::CallFunc_GetActivatingPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_SmasherRadialMeleeRampageFrustration_C_ExecuteUbergraph_GAB_SmasherRadialMeleeRampageFrustration, K2Node_DynamicCast_AsSmasher_Pawn_Boss_Rampage) == 0x000008, "Member 'GAB_SmasherRadialMeleeRampageFrustration_C_ExecuteUbergraph_GAB_SmasherRadialMeleeRampageFrustration::K2Node_DynamicCast_AsSmasher_Pawn_Boss_Rampage' has a wrong offset!");
static_assert(offsetof(GAB_SmasherRadialMeleeRampageFrustration_C_ExecuteUbergraph_GAB_SmasherRadialMeleeRampageFrustration, K2Node_DynamicCast_bSuccess) == 0x00000C, "Member 'GAB_SmasherRadialMeleeRampageFrustration_C_ExecuteUbergraph_GAB_SmasherRadialMeleeRampageFrustration::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GAB_SmasherRadialMeleeRampageFrustration_C_ExecuteUbergraph_GAB_SmasherRadialMeleeRampageFrustration, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'GAB_SmasherRadialMeleeRampageFrustration_C_ExecuteUbergraph_GAB_SmasherRadialMeleeRampageFrustration::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GAB_SmasherRadialMeleeRampageFrustration_C_ExecuteUbergraph_GAB_SmasherRadialMeleeRampageFrustration, K2Node_CustomEvent_TargetData3) == 0x000020, "Member 'GAB_SmasherRadialMeleeRampageFrustration_C_ExecuteUbergraph_GAB_SmasherRadialMeleeRampageFrustration::K2Node_CustomEvent_TargetData3' has a wrong offset!");
static_assert(offsetof(GAB_SmasherRadialMeleeRampageFrustration_C_ExecuteUbergraph_GAB_SmasherRadialMeleeRampageFrustration, K2Node_CustomEvent_ApplicationTag3) == 0x000034, "Member 'GAB_SmasherRadialMeleeRampageFrustration_C_ExecuteUbergraph_GAB_SmasherRadialMeleeRampageFrustration::K2Node_CustomEvent_ApplicationTag3' has a wrong offset!");
static_assert(offsetof(GAB_SmasherRadialMeleeRampageFrustration_C_ExecuteUbergraph_GAB_SmasherRadialMeleeRampageFrustration, K2Node_CustomEvent_TargetData2) == 0x00003C, "Member 'GAB_SmasherRadialMeleeRampageFrustration_C_ExecuteUbergraph_GAB_SmasherRadialMeleeRampageFrustration::K2Node_CustomEvent_TargetData2' has a wrong offset!");
static_assert(offsetof(GAB_SmasherRadialMeleeRampageFrustration_C_ExecuteUbergraph_GAB_SmasherRadialMeleeRampageFrustration, K2Node_CustomEvent_ApplicationTag2) == 0x000050, "Member 'GAB_SmasherRadialMeleeRampageFrustration_C_ExecuteUbergraph_GAB_SmasherRadialMeleeRampageFrustration::K2Node_CustomEvent_ApplicationTag2' has a wrong offset!");
static_assert(offsetof(GAB_SmasherRadialMeleeRampageFrustration_C_ExecuteUbergraph_GAB_SmasherRadialMeleeRampageFrustration, K2Node_CreateDelegate_OutputDelegate2) == 0x000058, "Member 'GAB_SmasherRadialMeleeRampageFrustration_C_ExecuteUbergraph_GAB_SmasherRadialMeleeRampageFrustration::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GAB_SmasherRadialMeleeRampageFrustration_C_ExecuteUbergraph_GAB_SmasherRadialMeleeRampageFrustration, K2Node_CustomEvent_TargetData) == 0x000068, "Member 'GAB_SmasherRadialMeleeRampageFrustration_C_ExecuteUbergraph_GAB_SmasherRadialMeleeRampageFrustration::K2Node_CustomEvent_TargetData' has a wrong offset!");
static_assert(offsetof(GAB_SmasherRadialMeleeRampageFrustration_C_ExecuteUbergraph_GAB_SmasherRadialMeleeRampageFrustration, K2Node_CustomEvent_ApplicationTag) == 0x00007C, "Member 'GAB_SmasherRadialMeleeRampageFrustration_C_ExecuteUbergraph_GAB_SmasherRadialMeleeRampageFrustration::K2Node_CustomEvent_ApplicationTag' has a wrong offset!");
static_assert(offsetof(GAB_SmasherRadialMeleeRampageFrustration_C_ExecuteUbergraph_GAB_SmasherRadialMeleeRampageFrustration, K2Node_CreateDelegate_OutputDelegate3) == 0x000084, "Member 'GAB_SmasherRadialMeleeRampageFrustration_C_ExecuteUbergraph_GAB_SmasherRadialMeleeRampageFrustration::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(GAB_SmasherRadialMeleeRampageFrustration_C_ExecuteUbergraph_GAB_SmasherRadialMeleeRampageFrustration, Temp_struct_Variable) == 0x000094, "Member 'GAB_SmasherRadialMeleeRampageFrustration_C_ExecuteUbergraph_GAB_SmasherRadialMeleeRampageFrustration::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GAB_SmasherRadialMeleeRampageFrustration_C_ExecuteUbergraph_GAB_SmasherRadialMeleeRampageFrustration, Temp_struct_Variable2) == 0x00009C, "Member 'GAB_SmasherRadialMeleeRampageFrustration_C_ExecuteUbergraph_GAB_SmasherRadialMeleeRampageFrustration::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(GAB_SmasherRadialMeleeRampageFrustration_C_ExecuteUbergraph_GAB_SmasherRadialMeleeRampageFrustration, CallFunc_ApplyGameplayEffectContainer_ReturnValue) == 0x0000B0, "Member 'GAB_SmasherRadialMeleeRampageFrustration_C_ExecuteUbergraph_GAB_SmasherRadialMeleeRampageFrustration::CallFunc_ApplyGameplayEffectContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_SmasherRadialMeleeRampageFrustration_C_ExecuteUbergraph_GAB_SmasherRadialMeleeRampageFrustration, CallFunc_K2_CommitAbility_ReturnValue) == 0x0000BC, "Member 'GAB_SmasherRadialMeleeRampageFrustration_C_ExecuteUbergraph_GAB_SmasherRadialMeleeRampageFrustration::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_SmasherRadialMeleeRampageFrustration_C_ExecuteUbergraph_GAB_SmasherRadialMeleeRampageFrustration, CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue) == 0x0000C0, "Member 'GAB_SmasherRadialMeleeRampageFrustration_C_ExecuteUbergraph_GAB_SmasherRadialMeleeRampageFrustration::CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_SmasherRadialMeleeRampageFrustration_C_ExecuteUbergraph_GAB_SmasherRadialMeleeRampageFrustration, CallFunc_IsValid_ReturnValue) == 0x0000C4, "Member 'GAB_SmasherRadialMeleeRampageFrustration_C_ExecuteUbergraph_GAB_SmasherRadialMeleeRampageFrustration::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_SmasherRadialMeleeRampageFrustration_C_ExecuteUbergraph_GAB_SmasherRadialMeleeRampageFrustration, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x0000C8, "Member 'GAB_SmasherRadialMeleeRampageFrustration_C_ExecuteUbergraph_GAB_SmasherRadialMeleeRampageFrustration::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");

// Function GAB_SmasherRadialMeleeRampageFrustration.GAB_SmasherRadialMeleeRampageFrustration_C.Triggered_3C66F07E4983B72F74CA01BF42F8A770
// 0x001C (0x001C - 0x0000)
struct GAB_SmasherRadialMeleeRampageFrustration_C_Triggered_3C66F07E4983B72F74CA01BF42F8A770 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0014)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0014(0x0008)(Parm)
};
static_assert(alignof(GAB_SmasherRadialMeleeRampageFrustration_C_Triggered_3C66F07E4983B72F74CA01BF42F8A770) == 0x000004, "Wrong alignment on GAB_SmasherRadialMeleeRampageFrustration_C_Triggered_3C66F07E4983B72F74CA01BF42F8A770");
static_assert(sizeof(GAB_SmasherRadialMeleeRampageFrustration_C_Triggered_3C66F07E4983B72F74CA01BF42F8A770) == 0x00001C, "Wrong size on GAB_SmasherRadialMeleeRampageFrustration_C_Triggered_3C66F07E4983B72F74CA01BF42F8A770");
static_assert(offsetof(GAB_SmasherRadialMeleeRampageFrustration_C_Triggered_3C66F07E4983B72F74CA01BF42F8A770, TargetData) == 0x000000, "Member 'GAB_SmasherRadialMeleeRampageFrustration_C_Triggered_3C66F07E4983B72F74CA01BF42F8A770::TargetData' has a wrong offset!");
static_assert(offsetof(GAB_SmasherRadialMeleeRampageFrustration_C_Triggered_3C66F07E4983B72F74CA01BF42F8A770, ApplicationTag) == 0x000014, "Member 'GAB_SmasherRadialMeleeRampageFrustration_C_Triggered_3C66F07E4983B72F74CA01BF42F8A770::ApplicationTag' has a wrong offset!");

// Function GAB_SmasherRadialMeleeRampageFrustration.GAB_SmasherRadialMeleeRampageFrustration_C.Cancelled_3C66F07E4983B72F74CA01BF42F8A770
// 0x001C (0x001C - 0x0000)
struct GAB_SmasherRadialMeleeRampageFrustration_C_Cancelled_3C66F07E4983B72F74CA01BF42F8A770 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0014)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0014(0x0008)(Parm)
};
static_assert(alignof(GAB_SmasherRadialMeleeRampageFrustration_C_Cancelled_3C66F07E4983B72F74CA01BF42F8A770) == 0x000004, "Wrong alignment on GAB_SmasherRadialMeleeRampageFrustration_C_Cancelled_3C66F07E4983B72F74CA01BF42F8A770");
static_assert(sizeof(GAB_SmasherRadialMeleeRampageFrustration_C_Cancelled_3C66F07E4983B72F74CA01BF42F8A770) == 0x00001C, "Wrong size on GAB_SmasherRadialMeleeRampageFrustration_C_Cancelled_3C66F07E4983B72F74CA01BF42F8A770");
static_assert(offsetof(GAB_SmasherRadialMeleeRampageFrustration_C_Cancelled_3C66F07E4983B72F74CA01BF42F8A770, TargetData) == 0x000000, "Member 'GAB_SmasherRadialMeleeRampageFrustration_C_Cancelled_3C66F07E4983B72F74CA01BF42F8A770::TargetData' has a wrong offset!");
static_assert(offsetof(GAB_SmasherRadialMeleeRampageFrustration_C_Cancelled_3C66F07E4983B72F74CA01BF42F8A770, ApplicationTag) == 0x000014, "Member 'GAB_SmasherRadialMeleeRampageFrustration_C_Cancelled_3C66F07E4983B72F74CA01BF42F8A770::ApplicationTag' has a wrong offset!");

// Function GAB_SmasherRadialMeleeRampageFrustration.GAB_SmasherRadialMeleeRampageFrustration_C.Completed_3C66F07E4983B72F74CA01BF42F8A770
// 0x001C (0x001C - 0x0000)
struct GAB_SmasherRadialMeleeRampageFrustration_C_Completed_3C66F07E4983B72F74CA01BF42F8A770 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0014)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0014(0x0008)(Parm)
};
static_assert(alignof(GAB_SmasherRadialMeleeRampageFrustration_C_Completed_3C66F07E4983B72F74CA01BF42F8A770) == 0x000004, "Wrong alignment on GAB_SmasherRadialMeleeRampageFrustration_C_Completed_3C66F07E4983B72F74CA01BF42F8A770");
static_assert(sizeof(GAB_SmasherRadialMeleeRampageFrustration_C_Completed_3C66F07E4983B72F74CA01BF42F8A770) == 0x00001C, "Wrong size on GAB_SmasherRadialMeleeRampageFrustration_C_Completed_3C66F07E4983B72F74CA01BF42F8A770");
static_assert(offsetof(GAB_SmasherRadialMeleeRampageFrustration_C_Completed_3C66F07E4983B72F74CA01BF42F8A770, TargetData) == 0x000000, "Member 'GAB_SmasherRadialMeleeRampageFrustration_C_Completed_3C66F07E4983B72F74CA01BF42F8A770::TargetData' has a wrong offset!");
static_assert(offsetof(GAB_SmasherRadialMeleeRampageFrustration_C_Completed_3C66F07E4983B72F74CA01BF42F8A770, ApplicationTag) == 0x000014, "Member 'GAB_SmasherRadialMeleeRampageFrustration_C_Completed_3C66F07E4983B72F74CA01BF42F8A770::ApplicationTag' has a wrong offset!");

}

#pragma pack(pop)
