#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GAB_SmasherTurnTransition

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function GAB_SmasherTurnTransition.GAB_SmasherTurnTransition_C.ExecuteUbergraph_GAB_SmasherTurnTransition
// 0x0068 (0x0068 - 0x0000)
struct GAB_SmasherTurnTransition_C_ExecuteUbergraph_GAB_SmasherTurnTransition final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x0004(0x0004)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetTurnTransitionMontageSectionNameAndYawRotationRate_MontageSectionName; // 0x003C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetTurnTransitionMontageSectionNameAndYawRotationRate_TurnYawRotationRate; // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue;            // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue; // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPawnMovementComponent*                 CallFunc_GetMovementComponent_ReturnValue;         // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UCharacterMovementComponent*            K2Node_DynamicCast_AsCharacter_Movement_Component; // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A[0x2];                                       // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue2;           // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ASmasherPawn_C*                         K2Node_DynamicCast_AsSmasher_Pawn;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GAB_SmasherTurnTransition_C_ExecuteUbergraph_GAB_SmasherTurnTransition) == 0x000004, "Wrong alignment on GAB_SmasherTurnTransition_C_ExecuteUbergraph_GAB_SmasherTurnTransition");
static_assert(sizeof(GAB_SmasherTurnTransition_C_ExecuteUbergraph_GAB_SmasherTurnTransition) == 0x000068, "Wrong size on GAB_SmasherTurnTransition_C_ExecuteUbergraph_GAB_SmasherTurnTransition");
static_assert(offsetof(GAB_SmasherTurnTransition_C_ExecuteUbergraph_GAB_SmasherTurnTransition, EntryPoint) == 0x000000, "Member 'GAB_SmasherTurnTransition_C_ExecuteUbergraph_GAB_SmasherTurnTransition::EntryPoint' has a wrong offset!");
static_assert(offsetof(GAB_SmasherTurnTransition_C_ExecuteUbergraph_GAB_SmasherTurnTransition, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x000004, "Member 'GAB_SmasherTurnTransition_C_ExecuteUbergraph_GAB_SmasherTurnTransition::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_SmasherTurnTransition_C_ExecuteUbergraph_GAB_SmasherTurnTransition, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'GAB_SmasherTurnTransition_C_ExecuteUbergraph_GAB_SmasherTurnTransition::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GAB_SmasherTurnTransition_C_ExecuteUbergraph_GAB_SmasherTurnTransition, K2Node_CreateDelegate_OutputDelegate2) == 0x000018, "Member 'GAB_SmasherTurnTransition_C_ExecuteUbergraph_GAB_SmasherTurnTransition::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GAB_SmasherTurnTransition_C_ExecuteUbergraph_GAB_SmasherTurnTransition, K2Node_CreateDelegate_OutputDelegate3) == 0x000028, "Member 'GAB_SmasherTurnTransition_C_ExecuteUbergraph_GAB_SmasherTurnTransition::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(GAB_SmasherTurnTransition_C_ExecuteUbergraph_GAB_SmasherTurnTransition, CallFunc_K2_CommitAbility_ReturnValue) == 0x000038, "Member 'GAB_SmasherTurnTransition_C_ExecuteUbergraph_GAB_SmasherTurnTransition::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_SmasherTurnTransition_C_ExecuteUbergraph_GAB_SmasherTurnTransition, CallFunc_GetTurnTransitionMontageSectionNameAndYawRotationRate_MontageSectionName) == 0x00003C, "Member 'GAB_SmasherTurnTransition_C_ExecuteUbergraph_GAB_SmasherTurnTransition::CallFunc_GetTurnTransitionMontageSectionNameAndYawRotationRate_MontageSectionName' has a wrong offset!");
static_assert(offsetof(GAB_SmasherTurnTransition_C_ExecuteUbergraph_GAB_SmasherTurnTransition, CallFunc_GetTurnTransitionMontageSectionNameAndYawRotationRate_TurnYawRotationRate) == 0x000044, "Member 'GAB_SmasherTurnTransition_C_ExecuteUbergraph_GAB_SmasherTurnTransition::CallFunc_GetTurnTransitionMontageSectionNameAndYawRotationRate_TurnYawRotationRate' has a wrong offset!");
static_assert(offsetof(GAB_SmasherTurnTransition_C_ExecuteUbergraph_GAB_SmasherTurnTransition, CallFunc_GetActivatingPawn_ReturnValue) == 0x000048, "Member 'GAB_SmasherTurnTransition_C_ExecuteUbergraph_GAB_SmasherTurnTransition::CallFunc_GetActivatingPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_SmasherTurnTransition_C_ExecuteUbergraph_GAB_SmasherTurnTransition, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue) == 0x00004C, "Member 'GAB_SmasherTurnTransition_C_ExecuteUbergraph_GAB_SmasherTurnTransition::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_SmasherTurnTransition_C_ExecuteUbergraph_GAB_SmasherTurnTransition, CallFunc_GetMovementComponent_ReturnValue) == 0x000050, "Member 'GAB_SmasherTurnTransition_C_ExecuteUbergraph_GAB_SmasherTurnTransition::CallFunc_GetMovementComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_SmasherTurnTransition_C_ExecuteUbergraph_GAB_SmasherTurnTransition, K2Node_DynamicCast_AsCharacter_Movement_Component) == 0x000054, "Member 'GAB_SmasherTurnTransition_C_ExecuteUbergraph_GAB_SmasherTurnTransition::K2Node_DynamicCast_AsCharacter_Movement_Component' has a wrong offset!");
static_assert(offsetof(GAB_SmasherTurnTransition_C_ExecuteUbergraph_GAB_SmasherTurnTransition, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'GAB_SmasherTurnTransition_C_ExecuteUbergraph_GAB_SmasherTurnTransition::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GAB_SmasherTurnTransition_C_ExecuteUbergraph_GAB_SmasherTurnTransition, CallFunc_IsValid_ReturnValue) == 0x000059, "Member 'GAB_SmasherTurnTransition_C_ExecuteUbergraph_GAB_SmasherTurnTransition::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_SmasherTurnTransition_C_ExecuteUbergraph_GAB_SmasherTurnTransition, CallFunc_GetActivatingPawn_ReturnValue2) == 0x00005C, "Member 'GAB_SmasherTurnTransition_C_ExecuteUbergraph_GAB_SmasherTurnTransition::CallFunc_GetActivatingPawn_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GAB_SmasherTurnTransition_C_ExecuteUbergraph_GAB_SmasherTurnTransition, K2Node_DynamicCast_AsSmasher_Pawn) == 0x000060, "Member 'GAB_SmasherTurnTransition_C_ExecuteUbergraph_GAB_SmasherTurnTransition::K2Node_DynamicCast_AsSmasher_Pawn' has a wrong offset!");
static_assert(offsetof(GAB_SmasherTurnTransition_C_ExecuteUbergraph_GAB_SmasherTurnTransition, K2Node_DynamicCast_bSuccess2) == 0x000064, "Member 'GAB_SmasherTurnTransition_C_ExecuteUbergraph_GAB_SmasherTurnTransition::K2Node_DynamicCast_bSuccess2' has a wrong offset!");

}

#pragma pack(pop)
