#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GAB_AIBaseSimpleMontage

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function GAB_AIBaseSimpleMontage.GAB_AIBaseSimpleMontage_C.ExecuteUbergraph_GAB_AIBaseSimpleMontage
// 0x00B0 (0x00B0 - 0x0000)
struct GAB_AIBaseSimpleMontage_C_ExecuteUbergraph_GAB_AIBaseSimpleMontage final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UFortAbilityTask_PlayMontageWaitTarget* CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue; // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData3;                    // 0x001C(0x0014)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag3;                // 0x0030(0x0008)()
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData2;                    // 0x0038(0x0014)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag2;                // 0x004C(0x0008)()
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0054(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate3;             // 0x0064(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData;                     // 0x0074(0x0014)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag;                 // 0x0088(0x0008)()
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0090(0x0008)()
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable2;                             // 0x0098(0x0014)()
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GAB_AIBaseSimpleMontage_C_ExecuteUbergraph_GAB_AIBaseSimpleMontage) == 0x000004, "Wrong alignment on GAB_AIBaseSimpleMontage_C_ExecuteUbergraph_GAB_AIBaseSimpleMontage");
static_assert(sizeof(GAB_AIBaseSimpleMontage_C_ExecuteUbergraph_GAB_AIBaseSimpleMontage) == 0x0000B0, "Wrong size on GAB_AIBaseSimpleMontage_C_ExecuteUbergraph_GAB_AIBaseSimpleMontage");
static_assert(offsetof(GAB_AIBaseSimpleMontage_C_ExecuteUbergraph_GAB_AIBaseSimpleMontage, EntryPoint) == 0x000000, "Member 'GAB_AIBaseSimpleMontage_C_ExecuteUbergraph_GAB_AIBaseSimpleMontage::EntryPoint' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseSimpleMontage_C_ExecuteUbergraph_GAB_AIBaseSimpleMontage, CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue) == 0x000004, "Member 'GAB_AIBaseSimpleMontage_C_ExecuteUbergraph_GAB_AIBaseSimpleMontage::CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseSimpleMontage_C_ExecuteUbergraph_GAB_AIBaseSimpleMontage, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'GAB_AIBaseSimpleMontage_C_ExecuteUbergraph_GAB_AIBaseSimpleMontage::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseSimpleMontage_C_ExecuteUbergraph_GAB_AIBaseSimpleMontage, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'GAB_AIBaseSimpleMontage_C_ExecuteUbergraph_GAB_AIBaseSimpleMontage::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseSimpleMontage_C_ExecuteUbergraph_GAB_AIBaseSimpleMontage, K2Node_CustomEvent_TargetData3) == 0x00001C, "Member 'GAB_AIBaseSimpleMontage_C_ExecuteUbergraph_GAB_AIBaseSimpleMontage::K2Node_CustomEvent_TargetData3' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseSimpleMontage_C_ExecuteUbergraph_GAB_AIBaseSimpleMontage, K2Node_CustomEvent_ApplicationTag3) == 0x000030, "Member 'GAB_AIBaseSimpleMontage_C_ExecuteUbergraph_GAB_AIBaseSimpleMontage::K2Node_CustomEvent_ApplicationTag3' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseSimpleMontage_C_ExecuteUbergraph_GAB_AIBaseSimpleMontage, K2Node_CustomEvent_TargetData2) == 0x000038, "Member 'GAB_AIBaseSimpleMontage_C_ExecuteUbergraph_GAB_AIBaseSimpleMontage::K2Node_CustomEvent_TargetData2' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseSimpleMontage_C_ExecuteUbergraph_GAB_AIBaseSimpleMontage, K2Node_CustomEvent_ApplicationTag2) == 0x00004C, "Member 'GAB_AIBaseSimpleMontage_C_ExecuteUbergraph_GAB_AIBaseSimpleMontage::K2Node_CustomEvent_ApplicationTag2' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseSimpleMontage_C_ExecuteUbergraph_GAB_AIBaseSimpleMontage, K2Node_CreateDelegate_OutputDelegate2) == 0x000054, "Member 'GAB_AIBaseSimpleMontage_C_ExecuteUbergraph_GAB_AIBaseSimpleMontage::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseSimpleMontage_C_ExecuteUbergraph_GAB_AIBaseSimpleMontage, K2Node_CreateDelegate_OutputDelegate3) == 0x000064, "Member 'GAB_AIBaseSimpleMontage_C_ExecuteUbergraph_GAB_AIBaseSimpleMontage::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseSimpleMontage_C_ExecuteUbergraph_GAB_AIBaseSimpleMontage, K2Node_CustomEvent_TargetData) == 0x000074, "Member 'GAB_AIBaseSimpleMontage_C_ExecuteUbergraph_GAB_AIBaseSimpleMontage::K2Node_CustomEvent_TargetData' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseSimpleMontage_C_ExecuteUbergraph_GAB_AIBaseSimpleMontage, K2Node_CustomEvent_ApplicationTag) == 0x000088, "Member 'GAB_AIBaseSimpleMontage_C_ExecuteUbergraph_GAB_AIBaseSimpleMontage::K2Node_CustomEvent_ApplicationTag' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseSimpleMontage_C_ExecuteUbergraph_GAB_AIBaseSimpleMontage, Temp_struct_Variable) == 0x000090, "Member 'GAB_AIBaseSimpleMontage_C_ExecuteUbergraph_GAB_AIBaseSimpleMontage::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseSimpleMontage_C_ExecuteUbergraph_GAB_AIBaseSimpleMontage, Temp_struct_Variable2) == 0x000098, "Member 'GAB_AIBaseSimpleMontage_C_ExecuteUbergraph_GAB_AIBaseSimpleMontage::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseSimpleMontage_C_ExecuteUbergraph_GAB_AIBaseSimpleMontage, CallFunc_K2_CommitAbility_ReturnValue) == 0x0000AC, "Member 'GAB_AIBaseSimpleMontage_C_ExecuteUbergraph_GAB_AIBaseSimpleMontage::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");

// Function GAB_AIBaseSimpleMontage.GAB_AIBaseSimpleMontage_C.Triggered_19E6A1264ED43B37D77327A113073715
// 0x001C (0x001C - 0x0000)
struct GAB_AIBaseSimpleMontage_C_Triggered_19E6A1264ED43B37D77327A113073715 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0014)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0014(0x0008)(Parm)
};
static_assert(alignof(GAB_AIBaseSimpleMontage_C_Triggered_19E6A1264ED43B37D77327A113073715) == 0x000004, "Wrong alignment on GAB_AIBaseSimpleMontage_C_Triggered_19E6A1264ED43B37D77327A113073715");
static_assert(sizeof(GAB_AIBaseSimpleMontage_C_Triggered_19E6A1264ED43B37D77327A113073715) == 0x00001C, "Wrong size on GAB_AIBaseSimpleMontage_C_Triggered_19E6A1264ED43B37D77327A113073715");
static_assert(offsetof(GAB_AIBaseSimpleMontage_C_Triggered_19E6A1264ED43B37D77327A113073715, TargetData) == 0x000000, "Member 'GAB_AIBaseSimpleMontage_C_Triggered_19E6A1264ED43B37D77327A113073715::TargetData' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseSimpleMontage_C_Triggered_19E6A1264ED43B37D77327A113073715, ApplicationTag) == 0x000014, "Member 'GAB_AIBaseSimpleMontage_C_Triggered_19E6A1264ED43B37D77327A113073715::ApplicationTag' has a wrong offset!");

// Function GAB_AIBaseSimpleMontage.GAB_AIBaseSimpleMontage_C.Cancelled_19E6A1264ED43B37D77327A113073715
// 0x001C (0x001C - 0x0000)
struct GAB_AIBaseSimpleMontage_C_Cancelled_19E6A1264ED43B37D77327A113073715 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0014)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0014(0x0008)(Parm)
};
static_assert(alignof(GAB_AIBaseSimpleMontage_C_Cancelled_19E6A1264ED43B37D77327A113073715) == 0x000004, "Wrong alignment on GAB_AIBaseSimpleMontage_C_Cancelled_19E6A1264ED43B37D77327A113073715");
static_assert(sizeof(GAB_AIBaseSimpleMontage_C_Cancelled_19E6A1264ED43B37D77327A113073715) == 0x00001C, "Wrong size on GAB_AIBaseSimpleMontage_C_Cancelled_19E6A1264ED43B37D77327A113073715");
static_assert(offsetof(GAB_AIBaseSimpleMontage_C_Cancelled_19E6A1264ED43B37D77327A113073715, TargetData) == 0x000000, "Member 'GAB_AIBaseSimpleMontage_C_Cancelled_19E6A1264ED43B37D77327A113073715::TargetData' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseSimpleMontage_C_Cancelled_19E6A1264ED43B37D77327A113073715, ApplicationTag) == 0x000014, "Member 'GAB_AIBaseSimpleMontage_C_Cancelled_19E6A1264ED43B37D77327A113073715::ApplicationTag' has a wrong offset!");

// Function GAB_AIBaseSimpleMontage.GAB_AIBaseSimpleMontage_C.Completed_19E6A1264ED43B37D77327A113073715
// 0x001C (0x001C - 0x0000)
struct GAB_AIBaseSimpleMontage_C_Completed_19E6A1264ED43B37D77327A113073715 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0014)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0014(0x0008)(Parm)
};
static_assert(alignof(GAB_AIBaseSimpleMontage_C_Completed_19E6A1264ED43B37D77327A113073715) == 0x000004, "Wrong alignment on GAB_AIBaseSimpleMontage_C_Completed_19E6A1264ED43B37D77327A113073715");
static_assert(sizeof(GAB_AIBaseSimpleMontage_C_Completed_19E6A1264ED43B37D77327A113073715) == 0x00001C, "Wrong size on GAB_AIBaseSimpleMontage_C_Completed_19E6A1264ED43B37D77327A113073715");
static_assert(offsetof(GAB_AIBaseSimpleMontage_C_Completed_19E6A1264ED43B37D77327A113073715, TargetData) == 0x000000, "Member 'GAB_AIBaseSimpleMontage_C_Completed_19E6A1264ED43B37D77327A113073715::TargetData' has a wrong offset!");
static_assert(offsetof(GAB_AIBaseSimpleMontage_C_Completed_19E6A1264ED43B37D77327A113073715, ApplicationTag) == 0x000014, "Member 'GAB_AIBaseSimpleMontage_C_Completed_19E6A1264ED43B37D77327A113073715::ApplicationTag' has a wrong offset!");

}

#pragma pack(pop)
