#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GAB_HuskBeehiveAreaOfEffect

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass GAB_HuskBeehiveAreaOfEffect.GAB_HuskBeehiveAreaOfEffect_C
// 0x0010 (0x06EC - 0x06DC)
class UGAB_HuskBeehiveAreaOfEffect_C final : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06DC(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class UClass*                                 Husk_Bee_AOE_Cloud;                                // 0x06E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FGameplayTag                           TC_NPCBehaviorDisablesAbilityAttackAOEBees;        // 0x06E4(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_GAB_HuskBeehiveAreaOfEffect(int32 EntryPoint);
	void K2_ActivateAbility();
	bool K2_CanActivateAbility(const struct FGameplayAbilityActorInfo& ActorInfo, struct FGameplayTagContainer* RelevantTags);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GAB_HuskBeehiveAreaOfEffect_C">();
	}
	static class UGAB_HuskBeehiveAreaOfEffect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGAB_HuskBeehiveAreaOfEffect_C>();
	}
};
static_assert(alignof(UGAB_HuskBeehiveAreaOfEffect_C) == 0x000004, "Wrong alignment on UGAB_HuskBeehiveAreaOfEffect_C");
static_assert(sizeof(UGAB_HuskBeehiveAreaOfEffect_C) == 0x0006EC, "Wrong size on UGAB_HuskBeehiveAreaOfEffect_C");
static_assert(offsetof(UGAB_HuskBeehiveAreaOfEffect_C, UberGraphFrame) == 0x0006DC, "Member 'UGAB_HuskBeehiveAreaOfEffect_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGAB_HuskBeehiveAreaOfEffect_C, Husk_Bee_AOE_Cloud) == 0x0006E0, "Member 'UGAB_HuskBeehiveAreaOfEffect_C::Husk_Bee_AOE_Cloud' has a wrong offset!");
static_assert(offsetof(UGAB_HuskBeehiveAreaOfEffect_C, TC_NPCBehaviorDisablesAbilityAttackAOEBees) == 0x0006E4, "Member 'UGAB_HuskBeehiveAreaOfEffect_C::TC_NPCBehaviorDisablesAbilityAttackAOEBees' has a wrong offset!");

}

#pragma pack(pop)
