#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GAB_SploderPickUp

#include "Basic.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function GAB_SploderPickUp.GAB_SploderPickUp_C.ExecuteUbergraph_GAB_SploderPickUp
// 0x0064 (0x0064 - 0x0000)
struct GAB_SploderPickUp_C_ExecuteUbergraph_GAB_SploderPickUp final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x001C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x002C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue;            // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue2;           // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DoesImplementInterface_ReturnValue;       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IPawnThatCarries_C>    K2Node_DynamicCast_AsPawn_That_Carries;            // 0x004C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue;                // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue; // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GAB_SploderPickUp_C_ExecuteUbergraph_GAB_SploderPickUp) == 0x000004, "Wrong alignment on GAB_SploderPickUp_C_ExecuteUbergraph_GAB_SploderPickUp");
static_assert(sizeof(GAB_SploderPickUp_C_ExecuteUbergraph_GAB_SploderPickUp) == 0x000064, "Wrong size on GAB_SploderPickUp_C_ExecuteUbergraph_GAB_SploderPickUp");
static_assert(offsetof(GAB_SploderPickUp_C_ExecuteUbergraph_GAB_SploderPickUp, EntryPoint) == 0x000000, "Member 'GAB_SploderPickUp_C_ExecuteUbergraph_GAB_SploderPickUp::EntryPoint' has a wrong offset!");
static_assert(offsetof(GAB_SploderPickUp_C_ExecuteUbergraph_GAB_SploderPickUp, CallFunc_MakeLiteralName_ReturnValue) == 0x000004, "Member 'GAB_SploderPickUp_C_ExecuteUbergraph_GAB_SploderPickUp::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_SploderPickUp_C_ExecuteUbergraph_GAB_SploderPickUp, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'GAB_SploderPickUp_C_ExecuteUbergraph_GAB_SploderPickUp::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GAB_SploderPickUp_C_ExecuteUbergraph_GAB_SploderPickUp, K2Node_CreateDelegate_OutputDelegate2) == 0x00001C, "Member 'GAB_SploderPickUp_C_ExecuteUbergraph_GAB_SploderPickUp::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GAB_SploderPickUp_C_ExecuteUbergraph_GAB_SploderPickUp, K2Node_CreateDelegate_OutputDelegate3) == 0x00002C, "Member 'GAB_SploderPickUp_C_ExecuteUbergraph_GAB_SploderPickUp::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(GAB_SploderPickUp_C_ExecuteUbergraph_GAB_SploderPickUp, CallFunc_K2_CommitAbility_ReturnValue) == 0x00003C, "Member 'GAB_SploderPickUp_C_ExecuteUbergraph_GAB_SploderPickUp::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_SploderPickUp_C_ExecuteUbergraph_GAB_SploderPickUp, CallFunc_GetActivatingPawn_ReturnValue) == 0x000040, "Member 'GAB_SploderPickUp_C_ExecuteUbergraph_GAB_SploderPickUp::CallFunc_GetActivatingPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_SploderPickUp_C_ExecuteUbergraph_GAB_SploderPickUp, CallFunc_GetActivatingPawn_ReturnValue2) == 0x000044, "Member 'GAB_SploderPickUp_C_ExecuteUbergraph_GAB_SploderPickUp::CallFunc_GetActivatingPawn_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GAB_SploderPickUp_C_ExecuteUbergraph_GAB_SploderPickUp, CallFunc_DoesImplementInterface_ReturnValue) == 0x000048, "Member 'GAB_SploderPickUp_C_ExecuteUbergraph_GAB_SploderPickUp::CallFunc_DoesImplementInterface_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_SploderPickUp_C_ExecuteUbergraph_GAB_SploderPickUp, K2Node_DynamicCast_AsPawn_That_Carries) == 0x00004C, "Member 'GAB_SploderPickUp_C_ExecuteUbergraph_GAB_SploderPickUp::K2Node_DynamicCast_AsPawn_That_Carries' has a wrong offset!");
static_assert(offsetof(GAB_SploderPickUp_C_ExecuteUbergraph_GAB_SploderPickUp, K2Node_DynamicCast_bSuccess) == 0x000054, "Member 'GAB_SploderPickUp_C_ExecuteUbergraph_GAB_SploderPickUp::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GAB_SploderPickUp_C_ExecuteUbergraph_GAB_SploderPickUp, CallFunc_GetBlackboard_ReturnValue) == 0x000058, "Member 'GAB_SploderPickUp_C_ExecuteUbergraph_GAB_SploderPickUp::CallFunc_GetBlackboard_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_SploderPickUp_C_ExecuteUbergraph_GAB_SploderPickUp, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue) == 0x00005C, "Member 'GAB_SploderPickUp_C_ExecuteUbergraph_GAB_SploderPickUp::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_SploderPickUp_C_ExecuteUbergraph_GAB_SploderPickUp, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'GAB_SploderPickUp_C_ExecuteUbergraph_GAB_SploderPickUp::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

#pragma pack(pop)
