#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GAB_HuskDwarfHeavyMelee

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function GAB_HuskDwarfHeavyMelee.GAB_HuskDwarfHeavyMelee_C.ExecuteUbergraph_GAB_HuskDwarfHeavyMelee
// 0x00C4 (0x00C4 - 0x0000)
struct GAB_HuskDwarfHeavyMelee_C_ExecuteUbergraph_GAB_HuskDwarfHeavyMelee final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData3;                    // 0x0004(0x0014)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag3;                // 0x0018(0x0008)()
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData2;                    // 0x0030(0x0014)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag2;                // 0x0044(0x0008)()
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate2;             // 0x004C(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData;                     // 0x005C(0x0014)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag;                 // 0x0070(0x0008)()
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate3;             // 0x0078(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0088(0x0008)()
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable2;                             // 0x0090(0x0014)()
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_ApplyGameplayEffectContainer_ReturnValue; // 0x00A4(0x000C)(ConstParm, ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue;            // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UFortAbilityTask_PlayMontageWaitTarget* CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue; // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue2;           // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GAB_HuskDwarfHeavyMelee_C_ExecuteUbergraph_GAB_HuskDwarfHeavyMelee) == 0x000004, "Wrong alignment on GAB_HuskDwarfHeavyMelee_C_ExecuteUbergraph_GAB_HuskDwarfHeavyMelee");
static_assert(sizeof(GAB_HuskDwarfHeavyMelee_C_ExecuteUbergraph_GAB_HuskDwarfHeavyMelee) == 0x0000C4, "Wrong size on GAB_HuskDwarfHeavyMelee_C_ExecuteUbergraph_GAB_HuskDwarfHeavyMelee");
static_assert(offsetof(GAB_HuskDwarfHeavyMelee_C_ExecuteUbergraph_GAB_HuskDwarfHeavyMelee, EntryPoint) == 0x000000, "Member 'GAB_HuskDwarfHeavyMelee_C_ExecuteUbergraph_GAB_HuskDwarfHeavyMelee::EntryPoint' has a wrong offset!");
static_assert(offsetof(GAB_HuskDwarfHeavyMelee_C_ExecuteUbergraph_GAB_HuskDwarfHeavyMelee, K2Node_CustomEvent_TargetData3) == 0x000004, "Member 'GAB_HuskDwarfHeavyMelee_C_ExecuteUbergraph_GAB_HuskDwarfHeavyMelee::K2Node_CustomEvent_TargetData3' has a wrong offset!");
static_assert(offsetof(GAB_HuskDwarfHeavyMelee_C_ExecuteUbergraph_GAB_HuskDwarfHeavyMelee, K2Node_CustomEvent_ApplicationTag3) == 0x000018, "Member 'GAB_HuskDwarfHeavyMelee_C_ExecuteUbergraph_GAB_HuskDwarfHeavyMelee::K2Node_CustomEvent_ApplicationTag3' has a wrong offset!");
static_assert(offsetof(GAB_HuskDwarfHeavyMelee_C_ExecuteUbergraph_GAB_HuskDwarfHeavyMelee, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'GAB_HuskDwarfHeavyMelee_C_ExecuteUbergraph_GAB_HuskDwarfHeavyMelee::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GAB_HuskDwarfHeavyMelee_C_ExecuteUbergraph_GAB_HuskDwarfHeavyMelee, K2Node_CustomEvent_TargetData2) == 0x000030, "Member 'GAB_HuskDwarfHeavyMelee_C_ExecuteUbergraph_GAB_HuskDwarfHeavyMelee::K2Node_CustomEvent_TargetData2' has a wrong offset!");
static_assert(offsetof(GAB_HuskDwarfHeavyMelee_C_ExecuteUbergraph_GAB_HuskDwarfHeavyMelee, K2Node_CustomEvent_ApplicationTag2) == 0x000044, "Member 'GAB_HuskDwarfHeavyMelee_C_ExecuteUbergraph_GAB_HuskDwarfHeavyMelee::K2Node_CustomEvent_ApplicationTag2' has a wrong offset!");
static_assert(offsetof(GAB_HuskDwarfHeavyMelee_C_ExecuteUbergraph_GAB_HuskDwarfHeavyMelee, K2Node_CreateDelegate_OutputDelegate2) == 0x00004C, "Member 'GAB_HuskDwarfHeavyMelee_C_ExecuteUbergraph_GAB_HuskDwarfHeavyMelee::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GAB_HuskDwarfHeavyMelee_C_ExecuteUbergraph_GAB_HuskDwarfHeavyMelee, K2Node_CustomEvent_TargetData) == 0x00005C, "Member 'GAB_HuskDwarfHeavyMelee_C_ExecuteUbergraph_GAB_HuskDwarfHeavyMelee::K2Node_CustomEvent_TargetData' has a wrong offset!");
static_assert(offsetof(GAB_HuskDwarfHeavyMelee_C_ExecuteUbergraph_GAB_HuskDwarfHeavyMelee, K2Node_CustomEvent_ApplicationTag) == 0x000070, "Member 'GAB_HuskDwarfHeavyMelee_C_ExecuteUbergraph_GAB_HuskDwarfHeavyMelee::K2Node_CustomEvent_ApplicationTag' has a wrong offset!");
static_assert(offsetof(GAB_HuskDwarfHeavyMelee_C_ExecuteUbergraph_GAB_HuskDwarfHeavyMelee, K2Node_CreateDelegate_OutputDelegate3) == 0x000078, "Member 'GAB_HuskDwarfHeavyMelee_C_ExecuteUbergraph_GAB_HuskDwarfHeavyMelee::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(GAB_HuskDwarfHeavyMelee_C_ExecuteUbergraph_GAB_HuskDwarfHeavyMelee, Temp_struct_Variable) == 0x000088, "Member 'GAB_HuskDwarfHeavyMelee_C_ExecuteUbergraph_GAB_HuskDwarfHeavyMelee::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GAB_HuskDwarfHeavyMelee_C_ExecuteUbergraph_GAB_HuskDwarfHeavyMelee, Temp_struct_Variable2) == 0x000090, "Member 'GAB_HuskDwarfHeavyMelee_C_ExecuteUbergraph_GAB_HuskDwarfHeavyMelee::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(GAB_HuskDwarfHeavyMelee_C_ExecuteUbergraph_GAB_HuskDwarfHeavyMelee, CallFunc_ApplyGameplayEffectContainer_ReturnValue) == 0x0000A4, "Member 'GAB_HuskDwarfHeavyMelee_C_ExecuteUbergraph_GAB_HuskDwarfHeavyMelee::CallFunc_ApplyGameplayEffectContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_HuskDwarfHeavyMelee_C_ExecuteUbergraph_GAB_HuskDwarfHeavyMelee, CallFunc_K2_CommitAbility_ReturnValue) == 0x0000B0, "Member 'GAB_HuskDwarfHeavyMelee_C_ExecuteUbergraph_GAB_HuskDwarfHeavyMelee::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_HuskDwarfHeavyMelee_C_ExecuteUbergraph_GAB_HuskDwarfHeavyMelee, CallFunc_GetActivatingPawn_ReturnValue) == 0x0000B4, "Member 'GAB_HuskDwarfHeavyMelee_C_ExecuteUbergraph_GAB_HuskDwarfHeavyMelee::CallFunc_GetActivatingPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_HuskDwarfHeavyMelee_C_ExecuteUbergraph_GAB_HuskDwarfHeavyMelee, CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue) == 0x0000B8, "Member 'GAB_HuskDwarfHeavyMelee_C_ExecuteUbergraph_GAB_HuskDwarfHeavyMelee::CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_HuskDwarfHeavyMelee_C_ExecuteUbergraph_GAB_HuskDwarfHeavyMelee, CallFunc_IsValid_ReturnValue) == 0x0000BC, "Member 'GAB_HuskDwarfHeavyMelee_C_ExecuteUbergraph_GAB_HuskDwarfHeavyMelee::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_HuskDwarfHeavyMelee_C_ExecuteUbergraph_GAB_HuskDwarfHeavyMelee, CallFunc_GetActivatingPawn_ReturnValue2) == 0x0000C0, "Member 'GAB_HuskDwarfHeavyMelee_C_ExecuteUbergraph_GAB_HuskDwarfHeavyMelee::CallFunc_GetActivatingPawn_ReturnValue2' has a wrong offset!");

// Function GAB_HuskDwarfHeavyMelee.GAB_HuskDwarfHeavyMelee_C.Triggered_B2C8F1484A19A7577F3A6BA3168D0723
// 0x001C (0x001C - 0x0000)
struct GAB_HuskDwarfHeavyMelee_C_Triggered_B2C8F1484A19A7577F3A6BA3168D0723 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0014)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0014(0x0008)(Parm)
};
static_assert(alignof(GAB_HuskDwarfHeavyMelee_C_Triggered_B2C8F1484A19A7577F3A6BA3168D0723) == 0x000004, "Wrong alignment on GAB_HuskDwarfHeavyMelee_C_Triggered_B2C8F1484A19A7577F3A6BA3168D0723");
static_assert(sizeof(GAB_HuskDwarfHeavyMelee_C_Triggered_B2C8F1484A19A7577F3A6BA3168D0723) == 0x00001C, "Wrong size on GAB_HuskDwarfHeavyMelee_C_Triggered_B2C8F1484A19A7577F3A6BA3168D0723");
static_assert(offsetof(GAB_HuskDwarfHeavyMelee_C_Triggered_B2C8F1484A19A7577F3A6BA3168D0723, TargetData) == 0x000000, "Member 'GAB_HuskDwarfHeavyMelee_C_Triggered_B2C8F1484A19A7577F3A6BA3168D0723::TargetData' has a wrong offset!");
static_assert(offsetof(GAB_HuskDwarfHeavyMelee_C_Triggered_B2C8F1484A19A7577F3A6BA3168D0723, ApplicationTag) == 0x000014, "Member 'GAB_HuskDwarfHeavyMelee_C_Triggered_B2C8F1484A19A7577F3A6BA3168D0723::ApplicationTag' has a wrong offset!");

// Function GAB_HuskDwarfHeavyMelee.GAB_HuskDwarfHeavyMelee_C.Cancelled_B2C8F1484A19A7577F3A6BA3168D0723
// 0x001C (0x001C - 0x0000)
struct GAB_HuskDwarfHeavyMelee_C_Cancelled_B2C8F1484A19A7577F3A6BA3168D0723 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0014)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0014(0x0008)(Parm)
};
static_assert(alignof(GAB_HuskDwarfHeavyMelee_C_Cancelled_B2C8F1484A19A7577F3A6BA3168D0723) == 0x000004, "Wrong alignment on GAB_HuskDwarfHeavyMelee_C_Cancelled_B2C8F1484A19A7577F3A6BA3168D0723");
static_assert(sizeof(GAB_HuskDwarfHeavyMelee_C_Cancelled_B2C8F1484A19A7577F3A6BA3168D0723) == 0x00001C, "Wrong size on GAB_HuskDwarfHeavyMelee_C_Cancelled_B2C8F1484A19A7577F3A6BA3168D0723");
static_assert(offsetof(GAB_HuskDwarfHeavyMelee_C_Cancelled_B2C8F1484A19A7577F3A6BA3168D0723, TargetData) == 0x000000, "Member 'GAB_HuskDwarfHeavyMelee_C_Cancelled_B2C8F1484A19A7577F3A6BA3168D0723::TargetData' has a wrong offset!");
static_assert(offsetof(GAB_HuskDwarfHeavyMelee_C_Cancelled_B2C8F1484A19A7577F3A6BA3168D0723, ApplicationTag) == 0x000014, "Member 'GAB_HuskDwarfHeavyMelee_C_Cancelled_B2C8F1484A19A7577F3A6BA3168D0723::ApplicationTag' has a wrong offset!");

// Function GAB_HuskDwarfHeavyMelee.GAB_HuskDwarfHeavyMelee_C.Completed_B2C8F1484A19A7577F3A6BA3168D0723
// 0x001C (0x001C - 0x0000)
struct GAB_HuskDwarfHeavyMelee_C_Completed_B2C8F1484A19A7577F3A6BA3168D0723 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0014)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0014(0x0008)(Parm)
};
static_assert(alignof(GAB_HuskDwarfHeavyMelee_C_Completed_B2C8F1484A19A7577F3A6BA3168D0723) == 0x000004, "Wrong alignment on GAB_HuskDwarfHeavyMelee_C_Completed_B2C8F1484A19A7577F3A6BA3168D0723");
static_assert(sizeof(GAB_HuskDwarfHeavyMelee_C_Completed_B2C8F1484A19A7577F3A6BA3168D0723) == 0x00001C, "Wrong size on GAB_HuskDwarfHeavyMelee_C_Completed_B2C8F1484A19A7577F3A6BA3168D0723");
static_assert(offsetof(GAB_HuskDwarfHeavyMelee_C_Completed_B2C8F1484A19A7577F3A6BA3168D0723, TargetData) == 0x000000, "Member 'GAB_HuskDwarfHeavyMelee_C_Completed_B2C8F1484A19A7577F3A6BA3168D0723::TargetData' has a wrong offset!");
static_assert(offsetof(GAB_HuskDwarfHeavyMelee_C_Completed_B2C8F1484A19A7577F3A6BA3168D0723, ApplicationTag) == 0x000014, "Member 'GAB_HuskDwarfHeavyMelee_C_Completed_B2C8F1484A19A7577F3A6BA3168D0723::ApplicationTag' has a wrong offset!");

}

#pragma pack(pop)
