#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GAB_HuskyHuskDeath

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function GAB_HuskyHuskDeath.GAB_HuskyHuskDeath_C.ExecuteUbergraph_GAB_HuskyHuskDeath
// 0x0074 (0x0074 - 0x0000)
struct GAB_HuskyHuskDeath_C_ExecuteUbergraph_GAB_HuskyHuskDeath final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue;            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x004C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortDamageZone                               CallFunc_GetDamageZone_ReturnValue;                // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GAB_HuskyHuskDeath_C_ExecuteUbergraph_GAB_HuskyHuskDeath) == 0x000004, "Wrong alignment on GAB_HuskyHuskDeath_C_ExecuteUbergraph_GAB_HuskyHuskDeath");
static_assert(sizeof(GAB_HuskyHuskDeath_C_ExecuteUbergraph_GAB_HuskyHuskDeath) == 0x000074, "Wrong size on GAB_HuskyHuskDeath_C_ExecuteUbergraph_GAB_HuskyHuskDeath");
static_assert(offsetof(GAB_HuskyHuskDeath_C_ExecuteUbergraph_GAB_HuskyHuskDeath, EntryPoint) == 0x000000, "Member 'GAB_HuskyHuskDeath_C_ExecuteUbergraph_GAB_HuskyHuskDeath::EntryPoint' has a wrong offset!");
static_assert(offsetof(GAB_HuskyHuskDeath_C_ExecuteUbergraph_GAB_HuskyHuskDeath, CallFunc_GetActivatingPawn_ReturnValue) == 0x000004, "Member 'GAB_HuskyHuskDeath_C_ExecuteUbergraph_GAB_HuskyHuskDeath::CallFunc_GetActivatingPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_HuskyHuskDeath_C_ExecuteUbergraph_GAB_HuskyHuskDeath, CallFunc_BreakHitResult_bBlockingHit) == 0x000008, "Member 'GAB_HuskyHuskDeath_C_ExecuteUbergraph_GAB_HuskyHuskDeath::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(GAB_HuskyHuskDeath_C_ExecuteUbergraph_GAB_HuskyHuskDeath, CallFunc_BreakHitResult_bInitialOverlap) == 0x000009, "Member 'GAB_HuskyHuskDeath_C_ExecuteUbergraph_GAB_HuskyHuskDeath::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(GAB_HuskyHuskDeath_C_ExecuteUbergraph_GAB_HuskyHuskDeath, CallFunc_BreakHitResult_Time) == 0x00000C, "Member 'GAB_HuskyHuskDeath_C_ExecuteUbergraph_GAB_HuskyHuskDeath::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(GAB_HuskyHuskDeath_C_ExecuteUbergraph_GAB_HuskyHuskDeath, CallFunc_BreakHitResult_Location) == 0x000010, "Member 'GAB_HuskyHuskDeath_C_ExecuteUbergraph_GAB_HuskyHuskDeath::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(GAB_HuskyHuskDeath_C_ExecuteUbergraph_GAB_HuskyHuskDeath, CallFunc_BreakHitResult_ImpactPoint) == 0x00001C, "Member 'GAB_HuskyHuskDeath_C_ExecuteUbergraph_GAB_HuskyHuskDeath::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(GAB_HuskyHuskDeath_C_ExecuteUbergraph_GAB_HuskyHuskDeath, CallFunc_BreakHitResult_Normal) == 0x000028, "Member 'GAB_HuskyHuskDeath_C_ExecuteUbergraph_GAB_HuskyHuskDeath::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(GAB_HuskyHuskDeath_C_ExecuteUbergraph_GAB_HuskyHuskDeath, CallFunc_BreakHitResult_ImpactNormal) == 0x000034, "Member 'GAB_HuskyHuskDeath_C_ExecuteUbergraph_GAB_HuskyHuskDeath::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(GAB_HuskyHuskDeath_C_ExecuteUbergraph_GAB_HuskyHuskDeath, CallFunc_BreakHitResult_PhysMat) == 0x000040, "Member 'GAB_HuskyHuskDeath_C_ExecuteUbergraph_GAB_HuskyHuskDeath::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(GAB_HuskyHuskDeath_C_ExecuteUbergraph_GAB_HuskyHuskDeath, CallFunc_BreakHitResult_HitActor) == 0x000044, "Member 'GAB_HuskyHuskDeath_C_ExecuteUbergraph_GAB_HuskyHuskDeath::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(GAB_HuskyHuskDeath_C_ExecuteUbergraph_GAB_HuskyHuskDeath, CallFunc_BreakHitResult_HitComponent) == 0x000048, "Member 'GAB_HuskyHuskDeath_C_ExecuteUbergraph_GAB_HuskyHuskDeath::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(GAB_HuskyHuskDeath_C_ExecuteUbergraph_GAB_HuskyHuskDeath, CallFunc_BreakHitResult_HitBoneName) == 0x00004C, "Member 'GAB_HuskyHuskDeath_C_ExecuteUbergraph_GAB_HuskyHuskDeath::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(GAB_HuskyHuskDeath_C_ExecuteUbergraph_GAB_HuskyHuskDeath, CallFunc_BreakHitResult_HitItem) == 0x000054, "Member 'GAB_HuskyHuskDeath_C_ExecuteUbergraph_GAB_HuskyHuskDeath::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(GAB_HuskyHuskDeath_C_ExecuteUbergraph_GAB_HuskyHuskDeath, CallFunc_BreakHitResult_TraceStart) == 0x000058, "Member 'GAB_HuskyHuskDeath_C_ExecuteUbergraph_GAB_HuskyHuskDeath::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(GAB_HuskyHuskDeath_C_ExecuteUbergraph_GAB_HuskyHuskDeath, CallFunc_BreakHitResult_TraceEnd) == 0x000064, "Member 'GAB_HuskyHuskDeath_C_ExecuteUbergraph_GAB_HuskyHuskDeath::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(GAB_HuskyHuskDeath_C_ExecuteUbergraph_GAB_HuskyHuskDeath, CallFunc_GetDamageZone_ReturnValue) == 0x000070, "Member 'GAB_HuskyHuskDeath_C_ExecuteUbergraph_GAB_HuskyHuskDeath::CallFunc_GetDamageZone_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_HuskyHuskDeath_C_ExecuteUbergraph_GAB_HuskyHuskDeath, K2Node_SwitchEnum_CmpSuccess) == 0x000071, "Member 'GAB_HuskyHuskDeath_C_ExecuteUbergraph_GAB_HuskyHuskDeath::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

}

#pragma pack(pop)
