#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GAB_SmasherMelee

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function GAB_SmasherMelee.GAB_SmasherMelee_C.ExecuteUbergraph_GAB_SmasherMelee
// 0x0124 (0x0124 - 0x0000)
struct GAB_SmasherMelee_C_ExecuteUbergraph_GAB_SmasherMelee final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData3;                    // 0x0004(0x0014)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag3;                // 0x0018(0x0008)()
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData2;                    // 0x0020(0x0014)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag2;                // 0x0034(0x0008)()
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate;              // 0x003C(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData;                     // 0x004C(0x0014)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag;                 // 0x0060(0x0008)()
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0068(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0078(0x0008)()
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable2;                             // 0x0080(0x0014)()
	bool                                          CallFunc_TargetDataHasActor_ReturnValue;           // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_ApplyGameplayEffectContainer_ReturnValue; // 0x0098(0x000C)(ConstParm, ZeroConstructor, ReferenceParm)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x00A4(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate4;             // 0x00B4(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate5;             // 0x00C4(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilityTask_PlayMontageWaitTarget* CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue; // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x00DC(0x0004)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue2; // 0x00E4(0x0004)()
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate6;             // 0x00E8(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 CallFunc_GetAIAbilityTarget_ReturnValue;           // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UFortAbilityTask_MoveAI*                CallFunc_CreateMoveAITask_ReturnValue;             // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_102[0x2];                                      // 0x0102(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue;            // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue2;           // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ASmasherPawn_C*                         K2Node_DynamicCast_AsSmasher_Pawn;                 // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ASmasherPawn_C*                         K2Node_DynamicCast_AsSmasher_Pawn2;                // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue3; // 0x011C(0x0004)()
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GAB_SmasherMelee_C_ExecuteUbergraph_GAB_SmasherMelee) == 0x000004, "Wrong alignment on GAB_SmasherMelee_C_ExecuteUbergraph_GAB_SmasherMelee");
static_assert(sizeof(GAB_SmasherMelee_C_ExecuteUbergraph_GAB_SmasherMelee) == 0x000124, "Wrong size on GAB_SmasherMelee_C_ExecuteUbergraph_GAB_SmasherMelee");
static_assert(offsetof(GAB_SmasherMelee_C_ExecuteUbergraph_GAB_SmasherMelee, EntryPoint) == 0x000000, "Member 'GAB_SmasherMelee_C_ExecuteUbergraph_GAB_SmasherMelee::EntryPoint' has a wrong offset!");
static_assert(offsetof(GAB_SmasherMelee_C_ExecuteUbergraph_GAB_SmasherMelee, K2Node_CustomEvent_TargetData3) == 0x000004, "Member 'GAB_SmasherMelee_C_ExecuteUbergraph_GAB_SmasherMelee::K2Node_CustomEvent_TargetData3' has a wrong offset!");
static_assert(offsetof(GAB_SmasherMelee_C_ExecuteUbergraph_GAB_SmasherMelee, K2Node_CustomEvent_ApplicationTag3) == 0x000018, "Member 'GAB_SmasherMelee_C_ExecuteUbergraph_GAB_SmasherMelee::K2Node_CustomEvent_ApplicationTag3' has a wrong offset!");
static_assert(offsetof(GAB_SmasherMelee_C_ExecuteUbergraph_GAB_SmasherMelee, K2Node_CustomEvent_TargetData2) == 0x000020, "Member 'GAB_SmasherMelee_C_ExecuteUbergraph_GAB_SmasherMelee::K2Node_CustomEvent_TargetData2' has a wrong offset!");
static_assert(offsetof(GAB_SmasherMelee_C_ExecuteUbergraph_GAB_SmasherMelee, K2Node_CustomEvent_ApplicationTag2) == 0x000034, "Member 'GAB_SmasherMelee_C_ExecuteUbergraph_GAB_SmasherMelee::K2Node_CustomEvent_ApplicationTag2' has a wrong offset!");
static_assert(offsetof(GAB_SmasherMelee_C_ExecuteUbergraph_GAB_SmasherMelee, K2Node_CreateDelegate_OutputDelegate) == 0x00003C, "Member 'GAB_SmasherMelee_C_ExecuteUbergraph_GAB_SmasherMelee::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GAB_SmasherMelee_C_ExecuteUbergraph_GAB_SmasherMelee, K2Node_CustomEvent_TargetData) == 0x00004C, "Member 'GAB_SmasherMelee_C_ExecuteUbergraph_GAB_SmasherMelee::K2Node_CustomEvent_TargetData' has a wrong offset!");
static_assert(offsetof(GAB_SmasherMelee_C_ExecuteUbergraph_GAB_SmasherMelee, K2Node_CustomEvent_ApplicationTag) == 0x000060, "Member 'GAB_SmasherMelee_C_ExecuteUbergraph_GAB_SmasherMelee::K2Node_CustomEvent_ApplicationTag' has a wrong offset!");
static_assert(offsetof(GAB_SmasherMelee_C_ExecuteUbergraph_GAB_SmasherMelee, K2Node_CreateDelegate_OutputDelegate2) == 0x000068, "Member 'GAB_SmasherMelee_C_ExecuteUbergraph_GAB_SmasherMelee::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GAB_SmasherMelee_C_ExecuteUbergraph_GAB_SmasherMelee, Temp_struct_Variable) == 0x000078, "Member 'GAB_SmasherMelee_C_ExecuteUbergraph_GAB_SmasherMelee::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GAB_SmasherMelee_C_ExecuteUbergraph_GAB_SmasherMelee, Temp_struct_Variable2) == 0x000080, "Member 'GAB_SmasherMelee_C_ExecuteUbergraph_GAB_SmasherMelee::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(GAB_SmasherMelee_C_ExecuteUbergraph_GAB_SmasherMelee, CallFunc_TargetDataHasActor_ReturnValue) == 0x000094, "Member 'GAB_SmasherMelee_C_ExecuteUbergraph_GAB_SmasherMelee::CallFunc_TargetDataHasActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_SmasherMelee_C_ExecuteUbergraph_GAB_SmasherMelee, CallFunc_ApplyGameplayEffectContainer_ReturnValue) == 0x000098, "Member 'GAB_SmasherMelee_C_ExecuteUbergraph_GAB_SmasherMelee::CallFunc_ApplyGameplayEffectContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_SmasherMelee_C_ExecuteUbergraph_GAB_SmasherMelee, K2Node_CreateDelegate_OutputDelegate3) == 0x0000A4, "Member 'GAB_SmasherMelee_C_ExecuteUbergraph_GAB_SmasherMelee::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(GAB_SmasherMelee_C_ExecuteUbergraph_GAB_SmasherMelee, K2Node_CreateDelegate_OutputDelegate4) == 0x0000B4, "Member 'GAB_SmasherMelee_C_ExecuteUbergraph_GAB_SmasherMelee::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(GAB_SmasherMelee_C_ExecuteUbergraph_GAB_SmasherMelee, K2Node_CreateDelegate_OutputDelegate5) == 0x0000C4, "Member 'GAB_SmasherMelee_C_ExecuteUbergraph_GAB_SmasherMelee::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(GAB_SmasherMelee_C_ExecuteUbergraph_GAB_SmasherMelee, CallFunc_K2_CommitAbility_ReturnValue) == 0x0000D4, "Member 'GAB_SmasherMelee_C_ExecuteUbergraph_GAB_SmasherMelee::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_SmasherMelee_C_ExecuteUbergraph_GAB_SmasherMelee, CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue) == 0x0000D8, "Member 'GAB_SmasherMelee_C_ExecuteUbergraph_GAB_SmasherMelee::CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_SmasherMelee_C_ExecuteUbergraph_GAB_SmasherMelee, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x0000DC, "Member 'GAB_SmasherMelee_C_ExecuteUbergraph_GAB_SmasherMelee::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_SmasherMelee_C_ExecuteUbergraph_GAB_SmasherMelee, CallFunc_IsValid_ReturnValue) == 0x0000E0, "Member 'GAB_SmasherMelee_C_ExecuteUbergraph_GAB_SmasherMelee::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_SmasherMelee_C_ExecuteUbergraph_GAB_SmasherMelee, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue2) == 0x0000E4, "Member 'GAB_SmasherMelee_C_ExecuteUbergraph_GAB_SmasherMelee::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GAB_SmasherMelee_C_ExecuteUbergraph_GAB_SmasherMelee, K2Node_CreateDelegate_OutputDelegate6) == 0x0000E8, "Member 'GAB_SmasherMelee_C_ExecuteUbergraph_GAB_SmasherMelee::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");
static_assert(offsetof(GAB_SmasherMelee_C_ExecuteUbergraph_GAB_SmasherMelee, CallFunc_GetAIAbilityTarget_ReturnValue) == 0x0000F8, "Member 'GAB_SmasherMelee_C_ExecuteUbergraph_GAB_SmasherMelee::CallFunc_GetAIAbilityTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_SmasherMelee_C_ExecuteUbergraph_GAB_SmasherMelee, CallFunc_CreateMoveAITask_ReturnValue) == 0x0000FC, "Member 'GAB_SmasherMelee_C_ExecuteUbergraph_GAB_SmasherMelee::CallFunc_CreateMoveAITask_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_SmasherMelee_C_ExecuteUbergraph_GAB_SmasherMelee, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000100, "Member 'GAB_SmasherMelee_C_ExecuteUbergraph_GAB_SmasherMelee::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_SmasherMelee_C_ExecuteUbergraph_GAB_SmasherMelee, CallFunc_IsValid_ReturnValue2) == 0x000101, "Member 'GAB_SmasherMelee_C_ExecuteUbergraph_GAB_SmasherMelee::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GAB_SmasherMelee_C_ExecuteUbergraph_GAB_SmasherMelee, CallFunc_GetActivatingPawn_ReturnValue) == 0x000104, "Member 'GAB_SmasherMelee_C_ExecuteUbergraph_GAB_SmasherMelee::CallFunc_GetActivatingPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_SmasherMelee_C_ExecuteUbergraph_GAB_SmasherMelee, CallFunc_GetActivatingPawn_ReturnValue2) == 0x000108, "Member 'GAB_SmasherMelee_C_ExecuteUbergraph_GAB_SmasherMelee::CallFunc_GetActivatingPawn_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GAB_SmasherMelee_C_ExecuteUbergraph_GAB_SmasherMelee, K2Node_DynamicCast_AsSmasher_Pawn) == 0x00010C, "Member 'GAB_SmasherMelee_C_ExecuteUbergraph_GAB_SmasherMelee::K2Node_DynamicCast_AsSmasher_Pawn' has a wrong offset!");
static_assert(offsetof(GAB_SmasherMelee_C_ExecuteUbergraph_GAB_SmasherMelee, K2Node_DynamicCast_bSuccess) == 0x000110, "Member 'GAB_SmasherMelee_C_ExecuteUbergraph_GAB_SmasherMelee::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GAB_SmasherMelee_C_ExecuteUbergraph_GAB_SmasherMelee, K2Node_DynamicCast_AsSmasher_Pawn2) == 0x000114, "Member 'GAB_SmasherMelee_C_ExecuteUbergraph_GAB_SmasherMelee::K2Node_DynamicCast_AsSmasher_Pawn2' has a wrong offset!");
static_assert(offsetof(GAB_SmasherMelee_C_ExecuteUbergraph_GAB_SmasherMelee, K2Node_DynamicCast_bSuccess2) == 0x000118, "Member 'GAB_SmasherMelee_C_ExecuteUbergraph_GAB_SmasherMelee::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(GAB_SmasherMelee_C_ExecuteUbergraph_GAB_SmasherMelee, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue3) == 0x00011C, "Member 'GAB_SmasherMelee_C_ExecuteUbergraph_GAB_SmasherMelee::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GAB_SmasherMelee_C_ExecuteUbergraph_GAB_SmasherMelee, CallFunc_BooleanAND_ReturnValue) == 0x000120, "Member 'GAB_SmasherMelee_C_ExecuteUbergraph_GAB_SmasherMelee::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function GAB_SmasherMelee.GAB_SmasherMelee_C.Triggered_D4EB604A4AFDAD65E3461A86287A3EFE
// 0x001C (0x001C - 0x0000)
struct GAB_SmasherMelee_C_Triggered_D4EB604A4AFDAD65E3461A86287A3EFE final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0014)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0014(0x0008)(Parm)
};
static_assert(alignof(GAB_SmasherMelee_C_Triggered_D4EB604A4AFDAD65E3461A86287A3EFE) == 0x000004, "Wrong alignment on GAB_SmasherMelee_C_Triggered_D4EB604A4AFDAD65E3461A86287A3EFE");
static_assert(sizeof(GAB_SmasherMelee_C_Triggered_D4EB604A4AFDAD65E3461A86287A3EFE) == 0x00001C, "Wrong size on GAB_SmasherMelee_C_Triggered_D4EB604A4AFDAD65E3461A86287A3EFE");
static_assert(offsetof(GAB_SmasherMelee_C_Triggered_D4EB604A4AFDAD65E3461A86287A3EFE, TargetData) == 0x000000, "Member 'GAB_SmasherMelee_C_Triggered_D4EB604A4AFDAD65E3461A86287A3EFE::TargetData' has a wrong offset!");
static_assert(offsetof(GAB_SmasherMelee_C_Triggered_D4EB604A4AFDAD65E3461A86287A3EFE, ApplicationTag) == 0x000014, "Member 'GAB_SmasherMelee_C_Triggered_D4EB604A4AFDAD65E3461A86287A3EFE::ApplicationTag' has a wrong offset!");

// Function GAB_SmasherMelee.GAB_SmasherMelee_C.Cancelled_D4EB604A4AFDAD65E3461A86287A3EFE
// 0x001C (0x001C - 0x0000)
struct GAB_SmasherMelee_C_Cancelled_D4EB604A4AFDAD65E3461A86287A3EFE final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0014)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0014(0x0008)(Parm)
};
static_assert(alignof(GAB_SmasherMelee_C_Cancelled_D4EB604A4AFDAD65E3461A86287A3EFE) == 0x000004, "Wrong alignment on GAB_SmasherMelee_C_Cancelled_D4EB604A4AFDAD65E3461A86287A3EFE");
static_assert(sizeof(GAB_SmasherMelee_C_Cancelled_D4EB604A4AFDAD65E3461A86287A3EFE) == 0x00001C, "Wrong size on GAB_SmasherMelee_C_Cancelled_D4EB604A4AFDAD65E3461A86287A3EFE");
static_assert(offsetof(GAB_SmasherMelee_C_Cancelled_D4EB604A4AFDAD65E3461A86287A3EFE, TargetData) == 0x000000, "Member 'GAB_SmasherMelee_C_Cancelled_D4EB604A4AFDAD65E3461A86287A3EFE::TargetData' has a wrong offset!");
static_assert(offsetof(GAB_SmasherMelee_C_Cancelled_D4EB604A4AFDAD65E3461A86287A3EFE, ApplicationTag) == 0x000014, "Member 'GAB_SmasherMelee_C_Cancelled_D4EB604A4AFDAD65E3461A86287A3EFE::ApplicationTag' has a wrong offset!");

// Function GAB_SmasherMelee.GAB_SmasherMelee_C.Completed_D4EB604A4AFDAD65E3461A86287A3EFE
// 0x001C (0x001C - 0x0000)
struct GAB_SmasherMelee_C_Completed_D4EB604A4AFDAD65E3461A86287A3EFE final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0014)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0014(0x0008)(Parm)
};
static_assert(alignof(GAB_SmasherMelee_C_Completed_D4EB604A4AFDAD65E3461A86287A3EFE) == 0x000004, "Wrong alignment on GAB_SmasherMelee_C_Completed_D4EB604A4AFDAD65E3461A86287A3EFE");
static_assert(sizeof(GAB_SmasherMelee_C_Completed_D4EB604A4AFDAD65E3461A86287A3EFE) == 0x00001C, "Wrong size on GAB_SmasherMelee_C_Completed_D4EB604A4AFDAD65E3461A86287A3EFE");
static_assert(offsetof(GAB_SmasherMelee_C_Completed_D4EB604A4AFDAD65E3461A86287A3EFE, TargetData) == 0x000000, "Member 'GAB_SmasherMelee_C_Completed_D4EB604A4AFDAD65E3461A86287A3EFE::TargetData' has a wrong offset!");
static_assert(offsetof(GAB_SmasherMelee_C_Completed_D4EB604A4AFDAD65E3461A86287A3EFE, ApplicationTag) == 0x000014, "Member 'GAB_SmasherMelee_C_Completed_D4EB604A4AFDAD65E3461A86287A3EFE::ApplicationTag' has a wrong offset!");

}

#pragma pack(pop)
