#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GAB_HuskyHuskLand

#include "Basic.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function GAB_HuskyHuskLand.GAB_HuskyHuskLand_C.ExecuteUbergraph_GAB_HuskyHuskLand
// 0x0048 (0x0048 - 0x0000)
struct GAB_HuskyHuskLand_C_ExecuteUbergraph_GAB_HuskyHuskLand final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x0024(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue; // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AHuskPawn_Sploder_C*                    K2Node_DynamicCast_AsHusk_Pawn_Sploder;            // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GAB_HuskyHuskLand_C_ExecuteUbergraph_GAB_HuskyHuskLand) == 0x000004, "Wrong alignment on GAB_HuskyHuskLand_C_ExecuteUbergraph_GAB_HuskyHuskLand");
static_assert(sizeof(GAB_HuskyHuskLand_C_ExecuteUbergraph_GAB_HuskyHuskLand) == 0x000048, "Wrong size on GAB_HuskyHuskLand_C_ExecuteUbergraph_GAB_HuskyHuskLand");
static_assert(offsetof(GAB_HuskyHuskLand_C_ExecuteUbergraph_GAB_HuskyHuskLand, EntryPoint) == 0x000000, "Member 'GAB_HuskyHuskLand_C_ExecuteUbergraph_GAB_HuskyHuskLand::EntryPoint' has a wrong offset!");
static_assert(offsetof(GAB_HuskyHuskLand_C_ExecuteUbergraph_GAB_HuskyHuskLand, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'GAB_HuskyHuskLand_C_ExecuteUbergraph_GAB_HuskyHuskLand::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GAB_HuskyHuskLand_C_ExecuteUbergraph_GAB_HuskyHuskLand, K2Node_CreateDelegate_OutputDelegate2) == 0x000014, "Member 'GAB_HuskyHuskLand_C_ExecuteUbergraph_GAB_HuskyHuskLand::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GAB_HuskyHuskLand_C_ExecuteUbergraph_GAB_HuskyHuskLand, K2Node_CreateDelegate_OutputDelegate3) == 0x000024, "Member 'GAB_HuskyHuskLand_C_ExecuteUbergraph_GAB_HuskyHuskLand::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(GAB_HuskyHuskLand_C_ExecuteUbergraph_GAB_HuskyHuskLand, CallFunc_K2_CommitAbility_ReturnValue) == 0x000034, "Member 'GAB_HuskyHuskLand_C_ExecuteUbergraph_GAB_HuskyHuskLand::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_HuskyHuskLand_C_ExecuteUbergraph_GAB_HuskyHuskLand, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000038, "Member 'GAB_HuskyHuskLand_C_ExecuteUbergraph_GAB_HuskyHuskLand::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_HuskyHuskLand_C_ExecuteUbergraph_GAB_HuskyHuskLand, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue) == 0x00003C, "Member 'GAB_HuskyHuskLand_C_ExecuteUbergraph_GAB_HuskyHuskLand::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_HuskyHuskLand_C_ExecuteUbergraph_GAB_HuskyHuskLand, K2Node_DynamicCast_AsHusk_Pawn_Sploder) == 0x000040, "Member 'GAB_HuskyHuskLand_C_ExecuteUbergraph_GAB_HuskyHuskLand::K2Node_DynamicCast_AsHusk_Pawn_Sploder' has a wrong offset!");
static_assert(offsetof(GAB_HuskyHuskLand_C_ExecuteUbergraph_GAB_HuskyHuskLand, K2Node_DynamicCast_bSuccess) == 0x000044, "Member 'GAB_HuskyHuskLand_C_ExecuteUbergraph_GAB_HuskyHuskLand::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GAB_HuskyHuskLand_C_ExecuteUbergraph_GAB_HuskyHuskLand, CallFunc_Not_PreBool_ReturnValue) == 0x000045, "Member 'GAB_HuskyHuskLand_C_ExecuteUbergraph_GAB_HuskyHuskLand::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_HuskyHuskLand_C_ExecuteUbergraph_GAB_HuskyHuskLand, CallFunc_IsValid_ReturnValue) == 0x000046, "Member 'GAB_HuskyHuskLand_C_ExecuteUbergraph_GAB_HuskyHuskLand::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

#pragma pack(pop)
