#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GAB_SploderPropaneExplosion

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "GameplayTags_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass GAB_SploderPropaneExplosion.GAB_SploderPropaneExplosion_C
// 0x003C (0x0718 - 0x06DC)
class UGAB_SploderPropaneExplosion_C final : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06DC(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          SploderHoldingTank;                                // 0x06E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	EFortTeamAffiliation                          TeamAffiliationBetweenDamageInstigatorAndTankOwner; // 0x06E1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E2[0x2];                                      // 0x06E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AB_BGA_SploderPropaneTank_C*            ExplodingPropaneTank;                              // 0x06E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class AFortPawn*                              SploderThatOwnedThisPropaneTank;                   // 0x06E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FGameplayTag                           EC_NPCAbilityAttackAOEExplosionInstigatedByOwningTeamHoldingExplosive; // 0x06EC(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           EC_NPCAbilityAttackAOEExplosionInstigatedByOwningTeamNotHoldingExplosive; // 0x06F4(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           EC_NPCAbilityAttackAOEExplosionInstigatedByOtherTeamHoldingExplosive; // 0x06FC(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           EC_NPCAbilityAttackAOEExplosionInstigatedByOtherTeamNotHoldingExplosive; // 0x0704(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           TC_GameplayEffectInstantDeath;                     // 0x070C(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          Debug;                                             // 0x0714(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_GAB_SploderPropaneExplosion(int32 EntryPoint);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);
	void Targeted_2BAA5D1045A4E2DDDF76368133070725(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Cancelled_2BAA5D1045A4E2DDDF76368133070725(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Targeted_EF4E5CFA4A83D9641D718BB56A0B2515(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Cancelled_EF4E5CFA4A83D9641D718BB56A0B2515(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Targeted_710DDB17459304F404C18AB89426DA80(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Cancelled_710DDB17459304F404C18AB89426DA80(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Targeted_7C7A20F144AB26061311C0B8204424ED(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Cancelled_7C7A20F144AB26061311C0B8204424ED(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GAB_SploderPropaneExplosion_C">();
	}
	static class UGAB_SploderPropaneExplosion_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGAB_SploderPropaneExplosion_C>();
	}
};
static_assert(alignof(UGAB_SploderPropaneExplosion_C) == 0x000004, "Wrong alignment on UGAB_SploderPropaneExplosion_C");
static_assert(sizeof(UGAB_SploderPropaneExplosion_C) == 0x000718, "Wrong size on UGAB_SploderPropaneExplosion_C");
static_assert(offsetof(UGAB_SploderPropaneExplosion_C, UberGraphFrame) == 0x0006DC, "Member 'UGAB_SploderPropaneExplosion_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGAB_SploderPropaneExplosion_C, SploderHoldingTank) == 0x0006E0, "Member 'UGAB_SploderPropaneExplosion_C::SploderHoldingTank' has a wrong offset!");
static_assert(offsetof(UGAB_SploderPropaneExplosion_C, TeamAffiliationBetweenDamageInstigatorAndTankOwner) == 0x0006E1, "Member 'UGAB_SploderPropaneExplosion_C::TeamAffiliationBetweenDamageInstigatorAndTankOwner' has a wrong offset!");
static_assert(offsetof(UGAB_SploderPropaneExplosion_C, ExplodingPropaneTank) == 0x0006E4, "Member 'UGAB_SploderPropaneExplosion_C::ExplodingPropaneTank' has a wrong offset!");
static_assert(offsetof(UGAB_SploderPropaneExplosion_C, SploderThatOwnedThisPropaneTank) == 0x0006E8, "Member 'UGAB_SploderPropaneExplosion_C::SploderThatOwnedThisPropaneTank' has a wrong offset!");
static_assert(offsetof(UGAB_SploderPropaneExplosion_C, EC_NPCAbilityAttackAOEExplosionInstigatedByOwningTeamHoldingExplosive) == 0x0006EC, "Member 'UGAB_SploderPropaneExplosion_C::EC_NPCAbilityAttackAOEExplosionInstigatedByOwningTeamHoldingExplosive' has a wrong offset!");
static_assert(offsetof(UGAB_SploderPropaneExplosion_C, EC_NPCAbilityAttackAOEExplosionInstigatedByOwningTeamNotHoldingExplosive) == 0x0006F4, "Member 'UGAB_SploderPropaneExplosion_C::EC_NPCAbilityAttackAOEExplosionInstigatedByOwningTeamNotHoldingExplosive' has a wrong offset!");
static_assert(offsetof(UGAB_SploderPropaneExplosion_C, EC_NPCAbilityAttackAOEExplosionInstigatedByOtherTeamHoldingExplosive) == 0x0006FC, "Member 'UGAB_SploderPropaneExplosion_C::EC_NPCAbilityAttackAOEExplosionInstigatedByOtherTeamHoldingExplosive' has a wrong offset!");
static_assert(offsetof(UGAB_SploderPropaneExplosion_C, EC_NPCAbilityAttackAOEExplosionInstigatedByOtherTeamNotHoldingExplosive) == 0x000704, "Member 'UGAB_SploderPropaneExplosion_C::EC_NPCAbilityAttackAOEExplosionInstigatedByOtherTeamNotHoldingExplosive' has a wrong offset!");
static_assert(offsetof(UGAB_SploderPropaneExplosion_C, TC_GameplayEffectInstantDeath) == 0x00070C, "Member 'UGAB_SploderPropaneExplosion_C::TC_GameplayEffectInstantDeath' has a wrong offset!");
static_assert(offsetof(UGAB_SploderPropaneExplosion_C, Debug) == 0x000714, "Member 'UGAB_SploderPropaneExplosion_C::Debug' has a wrong offset!");

}

#pragma pack(pop)
