#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameplayTags_0

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "AIModule_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass GameplayTags.GameplayTags_C
// 0x0020 (0x008C - 0x006C)
class UGameplayTags_C final : public UBTDecorator_BlueprintBase
{
public:
	struct FGameplayTagContainer                  TC_BTDecoratorGameplayTags;                        // 0x006C(0x0018)(Edit, BlueprintVisible)
	bool                                          Inverse_Condition;                                 // 0x0084(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 OwnerActor;                                        // 0x0088(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	bool PerformConditionCheckAI(class AAIController* OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GameplayTags_C">();
	}
	static class UGameplayTags_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameplayTags_C>();
	}
};
static_assert(alignof(UGameplayTags_C) == 0x000004, "Wrong alignment on UGameplayTags_C");
static_assert(sizeof(UGameplayTags_C) == 0x00008C, "Wrong size on UGameplayTags_C");
static_assert(offsetof(UGameplayTags_C, TC_BTDecoratorGameplayTags) == 0x00006C, "Member 'UGameplayTags_C::TC_BTDecoratorGameplayTags' has a wrong offset!");
static_assert(offsetof(UGameplayTags_C, Inverse_Condition) == 0x000084, "Member 'UGameplayTags_C::Inverse_Condition' has a wrong offset!");
static_assert(offsetof(UGameplayTags_C, OwnerActor) == 0x000088, "Member 'UGameplayTags_C::OwnerActor' has a wrong offset!");

}

#pragma pack(pop)
