#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HuskBeeAOECloud

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function HuskBeeAOECloud.HuskBeeAOECloud_C.ExecuteUbergraph_HuskBeeAOECloud
// 0x00F8 (0x00F8 - 0x0000)
struct HuskBeeAOECloud_C_ExecuteUbergraph_HuskBeeAOECloud final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0004(0x0004)()
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor3;            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp3;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex3;        // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput;    // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x002C(0x0004)()
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor2;            // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp2;             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex2;        // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0044(0x0080)(ConstParm, ContainsInstancedReference)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue2;   // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue2;                // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue3;   // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self2_CastInput;   // 0x00DC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue2;      // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self3_CastInput;   // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue3;      // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue3;                // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F2[0x2];                                       // 0x00F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue2; // 0x00F4(0x0004)()
};
static_assert(alignof(HuskBeeAOECloud_C_ExecuteUbergraph_HuskBeeAOECloud) == 0x000004, "Wrong alignment on HuskBeeAOECloud_C_ExecuteUbergraph_HuskBeeAOECloud");
static_assert(sizeof(HuskBeeAOECloud_C_ExecuteUbergraph_HuskBeeAOECloud) == 0x0000F8, "Wrong size on HuskBeeAOECloud_C_ExecuteUbergraph_HuskBeeAOECloud");
static_assert(offsetof(HuskBeeAOECloud_C_ExecuteUbergraph_HuskBeeAOECloud, EntryPoint) == 0x000000, "Member 'HuskBeeAOECloud_C_ExecuteUbergraph_HuskBeeAOECloud::EntryPoint' has a wrong offset!");
static_assert(offsetof(HuskBeeAOECloud_C_ExecuteUbergraph_HuskBeeAOECloud, CallFunc_K2_SetTimer_ReturnValue) == 0x000004, "Member 'HuskBeeAOECloud_C_ExecuteUbergraph_HuskBeeAOECloud::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(HuskBeeAOECloud_C_ExecuteUbergraph_HuskBeeAOECloud, CallFunc_Add_FloatFloat_ReturnValue) == 0x000008, "Member 'HuskBeeAOECloud_C_ExecuteUbergraph_HuskBeeAOECloud::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(HuskBeeAOECloud_C_ExecuteUbergraph_HuskBeeAOECloud, CallFunc_HasAuthority_ReturnValue) == 0x00000C, "Member 'HuskBeeAOECloud_C_ExecuteUbergraph_HuskBeeAOECloud::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(HuskBeeAOECloud_C_ExecuteUbergraph_HuskBeeAOECloud, K2Node_ComponentBoundEvent_OtherActor3) == 0x000010, "Member 'HuskBeeAOECloud_C_ExecuteUbergraph_HuskBeeAOECloud::K2Node_ComponentBoundEvent_OtherActor3' has a wrong offset!");
static_assert(offsetof(HuskBeeAOECloud_C_ExecuteUbergraph_HuskBeeAOECloud, K2Node_ComponentBoundEvent_OtherComp3) == 0x000014, "Member 'HuskBeeAOECloud_C_ExecuteUbergraph_HuskBeeAOECloud::K2Node_ComponentBoundEvent_OtherComp3' has a wrong offset!");
static_assert(offsetof(HuskBeeAOECloud_C_ExecuteUbergraph_HuskBeeAOECloud, K2Node_ComponentBoundEvent_OtherBodyIndex3) == 0x000018, "Member 'HuskBeeAOECloud_C_ExecuteUbergraph_HuskBeeAOECloud::K2Node_ComponentBoundEvent_OtherBodyIndex3' has a wrong offset!");
static_assert(offsetof(HuskBeeAOECloud_C_ExecuteUbergraph_HuskBeeAOECloud, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x00001C, "Member 'HuskBeeAOECloud_C_ExecuteUbergraph_HuskBeeAOECloud::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(HuskBeeAOECloud_C_ExecuteUbergraph_HuskBeeAOECloud, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x000020, "Member 'HuskBeeAOECloud_C_ExecuteUbergraph_HuskBeeAOECloud::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(HuskBeeAOECloud_C_ExecuteUbergraph_HuskBeeAOECloud, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000028, "Member 'HuskBeeAOECloud_C_ExecuteUbergraph_HuskBeeAOECloud::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(HuskBeeAOECloud_C_ExecuteUbergraph_HuskBeeAOECloud, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x00002C, "Member 'HuskBeeAOECloud_C_ExecuteUbergraph_HuskBeeAOECloud::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(HuskBeeAOECloud_C_ExecuteUbergraph_HuskBeeAOECloud, CallFunc_Not_PreBool_ReturnValue) == 0x000030, "Member 'HuskBeeAOECloud_C_ExecuteUbergraph_HuskBeeAOECloud::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(HuskBeeAOECloud_C_ExecuteUbergraph_HuskBeeAOECloud, K2Node_ComponentBoundEvent_OtherActor2) == 0x000034, "Member 'HuskBeeAOECloud_C_ExecuteUbergraph_HuskBeeAOECloud::K2Node_ComponentBoundEvent_OtherActor2' has a wrong offset!");
static_assert(offsetof(HuskBeeAOECloud_C_ExecuteUbergraph_HuskBeeAOECloud, K2Node_ComponentBoundEvent_OtherComp2) == 0x000038, "Member 'HuskBeeAOECloud_C_ExecuteUbergraph_HuskBeeAOECloud::K2Node_ComponentBoundEvent_OtherComp2' has a wrong offset!");
static_assert(offsetof(HuskBeeAOECloud_C_ExecuteUbergraph_HuskBeeAOECloud, K2Node_ComponentBoundEvent_OtherBodyIndex2) == 0x00003C, "Member 'HuskBeeAOECloud_C_ExecuteUbergraph_HuskBeeAOECloud::K2Node_ComponentBoundEvent_OtherBodyIndex2' has a wrong offset!");
static_assert(offsetof(HuskBeeAOECloud_C_ExecuteUbergraph_HuskBeeAOECloud, K2Node_ComponentBoundEvent_bFromSweep) == 0x000040, "Member 'HuskBeeAOECloud_C_ExecuteUbergraph_HuskBeeAOECloud::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(HuskBeeAOECloud_C_ExecuteUbergraph_HuskBeeAOECloud, K2Node_ComponentBoundEvent_SweepResult) == 0x000044, "Member 'HuskBeeAOECloud_C_ExecuteUbergraph_HuskBeeAOECloud::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(HuskBeeAOECloud_C_ExecuteUbergraph_HuskBeeAOECloud, CallFunc_GetAbilitySystemComponent_ReturnValue2) == 0x0000C4, "Member 'HuskBeeAOECloud_C_ExecuteUbergraph_HuskBeeAOECloud::CallFunc_GetAbilitySystemComponent_ReturnValue2' has a wrong offset!");
static_assert(offsetof(HuskBeeAOECloud_C_ExecuteUbergraph_HuskBeeAOECloud, K2Node_ComponentBoundEvent_OtherActor) == 0x0000C8, "Member 'HuskBeeAOECloud_C_ExecuteUbergraph_HuskBeeAOECloud::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(HuskBeeAOECloud_C_ExecuteUbergraph_HuskBeeAOECloud, K2Node_ComponentBoundEvent_OtherComp) == 0x0000CC, "Member 'HuskBeeAOECloud_C_ExecuteUbergraph_HuskBeeAOECloud::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(HuskBeeAOECloud_C_ExecuteUbergraph_HuskBeeAOECloud, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x0000D0, "Member 'HuskBeeAOECloud_C_ExecuteUbergraph_HuskBeeAOECloud::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(HuskBeeAOECloud_C_ExecuteUbergraph_HuskBeeAOECloud, CallFunc_HasAuthority_ReturnValue2) == 0x0000D4, "Member 'HuskBeeAOECloud_C_ExecuteUbergraph_HuskBeeAOECloud::CallFunc_HasAuthority_ReturnValue2' has a wrong offset!");
static_assert(offsetof(HuskBeeAOECloud_C_ExecuteUbergraph_HuskBeeAOECloud, CallFunc_GetAbilitySystemComponent_ReturnValue3) == 0x0000D8, "Member 'HuskBeeAOECloud_C_ExecuteUbergraph_HuskBeeAOECloud::CallFunc_GetAbilitySystemComponent_ReturnValue3' has a wrong offset!");
static_assert(offsetof(HuskBeeAOECloud_C_ExecuteUbergraph_HuskBeeAOECloud, CallFunc_HasMatchingGameplayTag_self2_CastInput) == 0x0000DC, "Member 'HuskBeeAOECloud_C_ExecuteUbergraph_HuskBeeAOECloud::CallFunc_HasMatchingGameplayTag_self2_CastInput' has a wrong offset!");
static_assert(offsetof(HuskBeeAOECloud_C_ExecuteUbergraph_HuskBeeAOECloud, CallFunc_HasMatchingGameplayTag_ReturnValue2) == 0x0000E4, "Member 'HuskBeeAOECloud_C_ExecuteUbergraph_HuskBeeAOECloud::CallFunc_HasMatchingGameplayTag_ReturnValue2' has a wrong offset!");
static_assert(offsetof(HuskBeeAOECloud_C_ExecuteUbergraph_HuskBeeAOECloud, CallFunc_HasMatchingGameplayTag_self3_CastInput) == 0x0000E8, "Member 'HuskBeeAOECloud_C_ExecuteUbergraph_HuskBeeAOECloud::CallFunc_HasMatchingGameplayTag_self3_CastInput' has a wrong offset!");
static_assert(offsetof(HuskBeeAOECloud_C_ExecuteUbergraph_HuskBeeAOECloud, CallFunc_HasMatchingGameplayTag_ReturnValue3) == 0x0000F0, "Member 'HuskBeeAOECloud_C_ExecuteUbergraph_HuskBeeAOECloud::CallFunc_HasMatchingGameplayTag_ReturnValue3' has a wrong offset!");
static_assert(offsetof(HuskBeeAOECloud_C_ExecuteUbergraph_HuskBeeAOECloud, CallFunc_HasAuthority_ReturnValue3) == 0x0000F1, "Member 'HuskBeeAOECloud_C_ExecuteUbergraph_HuskBeeAOECloud::CallFunc_HasAuthority_ReturnValue3' has a wrong offset!");
static_assert(offsetof(HuskBeeAOECloud_C_ExecuteUbergraph_HuskBeeAOECloud, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue2) == 0x0000F4, "Member 'HuskBeeAOECloud_C_ExecuteUbergraph_HuskBeeAOECloud::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue2' has a wrong offset!");

// Function HuskBeeAOECloud.HuskBeeAOECloud_C.BndEvt__BeeAntiOverlapArea_K2Node_ComponentBoundEvent_80_ComponentEndOverlapSignature__DelegateSignature
// 0x000C (0x000C - 0x0000)
struct HuskBeeAOECloud_C_BndEvt__BeeAntiOverlapArea_K2Node_ComponentBoundEvent_80_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         OtherBodyIndex;                                    // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HuskBeeAOECloud_C_BndEvt__BeeAntiOverlapArea_K2Node_ComponentBoundEvent_80_ComponentEndOverlapSignature__DelegateSignature) == 0x000004, "Wrong alignment on HuskBeeAOECloud_C_BndEvt__BeeAntiOverlapArea_K2Node_ComponentBoundEvent_80_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(HuskBeeAOECloud_C_BndEvt__BeeAntiOverlapArea_K2Node_ComponentBoundEvent_80_ComponentEndOverlapSignature__DelegateSignature) == 0x00000C, "Wrong size on HuskBeeAOECloud_C_BndEvt__BeeAntiOverlapArea_K2Node_ComponentBoundEvent_80_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(HuskBeeAOECloud_C_BndEvt__BeeAntiOverlapArea_K2Node_ComponentBoundEvent_80_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000000, "Member 'HuskBeeAOECloud_C_BndEvt__BeeAntiOverlapArea_K2Node_ComponentBoundEvent_80_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(HuskBeeAOECloud_C_BndEvt__BeeAntiOverlapArea_K2Node_ComponentBoundEvent_80_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000004, "Member 'HuskBeeAOECloud_C_BndEvt__BeeAntiOverlapArea_K2Node_ComponentBoundEvent_80_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(HuskBeeAOECloud_C_BndEvt__BeeAntiOverlapArea_K2Node_ComponentBoundEvent_80_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000008, "Member 'HuskBeeAOECloud_C_BndEvt__BeeAntiOverlapArea_K2Node_ComponentBoundEvent_80_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function HuskBeeAOECloud.HuskBeeAOECloud_C.BndEvt__BeeAntiOverlapArea_K2Node_ComponentBoundEvent_76_ComponentBeginOverlapSignature__DelegateSignature
// 0x0090 (0x0090 - 0x0000)
struct HuskBeeAOECloud_C_BndEvt__BeeAntiOverlapArea_K2Node_ComponentBoundEvent_76_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         OtherBodyIndex;                                    // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bFromSweep;                                        // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0010(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(HuskBeeAOECloud_C_BndEvt__BeeAntiOverlapArea_K2Node_ComponentBoundEvent_76_ComponentBeginOverlapSignature__DelegateSignature) == 0x000004, "Wrong alignment on HuskBeeAOECloud_C_BndEvt__BeeAntiOverlapArea_K2Node_ComponentBoundEvent_76_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(HuskBeeAOECloud_C_BndEvt__BeeAntiOverlapArea_K2Node_ComponentBoundEvent_76_ComponentBeginOverlapSignature__DelegateSignature) == 0x000090, "Wrong size on HuskBeeAOECloud_C_BndEvt__BeeAntiOverlapArea_K2Node_ComponentBoundEvent_76_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(HuskBeeAOECloud_C_BndEvt__BeeAntiOverlapArea_K2Node_ComponentBoundEvent_76_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000000, "Member 'HuskBeeAOECloud_C_BndEvt__BeeAntiOverlapArea_K2Node_ComponentBoundEvent_76_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(HuskBeeAOECloud_C_BndEvt__BeeAntiOverlapArea_K2Node_ComponentBoundEvent_76_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000004, "Member 'HuskBeeAOECloud_C_BndEvt__BeeAntiOverlapArea_K2Node_ComponentBoundEvent_76_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(HuskBeeAOECloud_C_BndEvt__BeeAntiOverlapArea_K2Node_ComponentBoundEvent_76_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000008, "Member 'HuskBeeAOECloud_C_BndEvt__BeeAntiOverlapArea_K2Node_ComponentBoundEvent_76_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(HuskBeeAOECloud_C_BndEvt__BeeAntiOverlapArea_K2Node_ComponentBoundEvent_76_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00000C, "Member 'HuskBeeAOECloud_C_BndEvt__BeeAntiOverlapArea_K2Node_ComponentBoundEvent_76_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(HuskBeeAOECloud_C_BndEvt__BeeAntiOverlapArea_K2Node_ComponentBoundEvent_76_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000010, "Member 'HuskBeeAOECloud_C_BndEvt__BeeAntiOverlapArea_K2Node_ComponentBoundEvent_76_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function HuskBeeAOECloud.HuskBeeAOECloud_C.BndEvt__BeeArea_K2Node_ComponentBoundEvent_249_ComponentEndOverlapSignature__DelegateSignature
// 0x000C (0x000C - 0x0000)
struct HuskBeeAOECloud_C_BndEvt__BeeArea_K2Node_ComponentBoundEvent_249_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         OtherBodyIndex;                                    // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HuskBeeAOECloud_C_BndEvt__BeeArea_K2Node_ComponentBoundEvent_249_ComponentEndOverlapSignature__DelegateSignature) == 0x000004, "Wrong alignment on HuskBeeAOECloud_C_BndEvt__BeeArea_K2Node_ComponentBoundEvent_249_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(HuskBeeAOECloud_C_BndEvt__BeeArea_K2Node_ComponentBoundEvent_249_ComponentEndOverlapSignature__DelegateSignature) == 0x00000C, "Wrong size on HuskBeeAOECloud_C_BndEvt__BeeArea_K2Node_ComponentBoundEvent_249_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(HuskBeeAOECloud_C_BndEvt__BeeArea_K2Node_ComponentBoundEvent_249_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000000, "Member 'HuskBeeAOECloud_C_BndEvt__BeeArea_K2Node_ComponentBoundEvent_249_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(HuskBeeAOECloud_C_BndEvt__BeeArea_K2Node_ComponentBoundEvent_249_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000004, "Member 'HuskBeeAOECloud_C_BndEvt__BeeArea_K2Node_ComponentBoundEvent_249_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(HuskBeeAOECloud_C_BndEvt__BeeArea_K2Node_ComponentBoundEvent_249_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000008, "Member 'HuskBeeAOECloud_C_BndEvt__BeeArea_K2Node_ComponentBoundEvent_249_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

}

#pragma pack(pop)
