#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HuskBeeAOECloud

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass HuskBeeAOECloud.HuskBeeAOECloud_C
// 0x0038 (0x03C8 - 0x0390)
class AHuskBeeAOECloud_C final : public AFortAreaOfEffectCloud
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0390(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class USphereComponent*                       BeeAntiOverlapArea;                                // 0x0394(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UAudioComponent*                        Audio1;                                            // 0x0398(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UParticleSystemComponent*               BeeCloudFX;                                        // 0x039C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class USphereComponent*                       BeeArea;                                           // 0x03A0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	float                                         AOEFXFadeTime;                                     // 0x03A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FGameplayTag                           TC_NPCCharacterTypeHuskBeehive;                    // 0x03A8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           TC_NPCStatusAOEBees;                               // 0x03B0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UClass*                                 GE_HuskBeehiveAOE2StandingInBees;                  // 0x03B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UClass*                                 GE_HuskBeehiveAOE3DOT;                             // 0x03BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UClass*                                 GE_HuskBeehiveAOE4Remove;                          // 0x03C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UClass*                                 GE_HuskBeehiveDisableTrail;                        // 0x03C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_HuskBeeAOECloud(int32 EntryPoint);
	void BndEvt__BeeAntiOverlapArea_K2Node_ComponentBoundEvent_80_ComponentEndOverlapSignature__DelegateSignature(class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void BndEvt__BeeAntiOverlapArea_K2Node_ComponentBoundEvent_76_ComponentBeginOverlapSignature__DelegateSignature(class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BndEvt__BeeArea_K2Node_ComponentBoundEvent_249_ComponentEndOverlapSignature__DelegateSignature(class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void EndAOE();
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HuskBeeAOECloud_C">();
	}
	static class AHuskBeeAOECloud_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AHuskBeeAOECloud_C>();
	}
};
static_assert(alignof(AHuskBeeAOECloud_C) == 0x000004, "Wrong alignment on AHuskBeeAOECloud_C");
static_assert(sizeof(AHuskBeeAOECloud_C) == 0x0003C8, "Wrong size on AHuskBeeAOECloud_C");
static_assert(offsetof(AHuskBeeAOECloud_C, UberGraphFrame) == 0x000390, "Member 'AHuskBeeAOECloud_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AHuskBeeAOECloud_C, BeeAntiOverlapArea) == 0x000394, "Member 'AHuskBeeAOECloud_C::BeeAntiOverlapArea' has a wrong offset!");
static_assert(offsetof(AHuskBeeAOECloud_C, Audio1) == 0x000398, "Member 'AHuskBeeAOECloud_C::Audio1' has a wrong offset!");
static_assert(offsetof(AHuskBeeAOECloud_C, BeeCloudFX) == 0x00039C, "Member 'AHuskBeeAOECloud_C::BeeCloudFX' has a wrong offset!");
static_assert(offsetof(AHuskBeeAOECloud_C, BeeArea) == 0x0003A0, "Member 'AHuskBeeAOECloud_C::BeeArea' has a wrong offset!");
static_assert(offsetof(AHuskBeeAOECloud_C, AOEFXFadeTime) == 0x0003A4, "Member 'AHuskBeeAOECloud_C::AOEFXFadeTime' has a wrong offset!");
static_assert(offsetof(AHuskBeeAOECloud_C, TC_NPCCharacterTypeHuskBeehive) == 0x0003A8, "Member 'AHuskBeeAOECloud_C::TC_NPCCharacterTypeHuskBeehive' has a wrong offset!");
static_assert(offsetof(AHuskBeeAOECloud_C, TC_NPCStatusAOEBees) == 0x0003B0, "Member 'AHuskBeeAOECloud_C::TC_NPCStatusAOEBees' has a wrong offset!");
static_assert(offsetof(AHuskBeeAOECloud_C, GE_HuskBeehiveAOE2StandingInBees) == 0x0003B8, "Member 'AHuskBeeAOECloud_C::GE_HuskBeehiveAOE2StandingInBees' has a wrong offset!");
static_assert(offsetof(AHuskBeeAOECloud_C, GE_HuskBeehiveAOE3DOT) == 0x0003BC, "Member 'AHuskBeeAOECloud_C::GE_HuskBeehiveAOE3DOT' has a wrong offset!");
static_assert(offsetof(AHuskBeeAOECloud_C, GE_HuskBeehiveAOE4Remove) == 0x0003C0, "Member 'AHuskBeeAOECloud_C::GE_HuskBeehiveAOE4Remove' has a wrong offset!");
static_assert(offsetof(AHuskBeeAOECloud_C, GE_HuskBeehiveDisableTrail) == 0x0003C4, "Member 'AHuskBeeAOECloud_C::GE_HuskBeehiveDisableTrail' has a wrong offset!");

}

#pragma pack(pop)
