#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HuskPawn_Sploder

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function HuskPawn_Sploder.HuskPawn_Sploder_C.ExecuteUbergraph_HuskPawn_Sploder
// 0x0200 (0x0200 - 0x0000)
struct HuskPawn_Sploder_C_ExecuteUbergraph_HuskPawn_Sploder final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue2;                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_Damage2;                              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  K2Node_Event_DamageTags2;                          // 0x000C(0x0018)(ConstParm)
	struct FVector                                K2Node_Event_Momentum2;                            // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             K2Node_Event_HitInfo2;                             // 0x0030(0x0080)(ConstParm, ContainsInstancedReference)
	class AController*                            K2Node_Event_InstigatedBy2;                        // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_Event_DamageCauser2;                        // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext2;                       // 0x00B8(0x000C)()
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Damage;                               // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  K2Node_Event_DamageTags;                           // 0x00CC(0x0018)(ConstParm)
	struct FVector                                K2Node_Event_Momentum;                             // 0x00E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             K2Node_Event_HitInfo;                              // 0x00F0(0x0080)(ConstParm, ContainsInstancedReference)
	class AController*                            K2Node_Event_InstigatedBy;                         // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext;                        // 0x0178(0x000C)()
	float                                         CallFunc_GetHealth_ReturnValue;                    // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsFullBodyHit_ReturnValue;                // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_18A[0x2];                                      // 0x018A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RemoveActiveGameplayEffect_ReturnValue;   // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0xF];                                      // 0x0191(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x01A0(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AB_BGA_SploderPropaneTank_C*            CallFunc_FinishSpawningActor_ReturnValue;          // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTags_ReturnValue;                      // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x01DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue3;                  // 0x01DB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue4;                  // 0x01DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1DD[0x3];                                      // 0x01DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_HitDirection;                         // 0x01E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue5;                  // 0x01EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1ED[0x3];                                      // 0x01ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_SetFNameBasedOnHitDirection_NameResult;   // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_PlayAnimMontage_ReturnValue;              // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x01FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HuskPawn_Sploder_C_ExecuteUbergraph_HuskPawn_Sploder) == 0x000010, "Wrong alignment on HuskPawn_Sploder_C_ExecuteUbergraph_HuskPawn_Sploder");
static_assert(sizeof(HuskPawn_Sploder_C_ExecuteUbergraph_HuskPawn_Sploder) == 0x000200, "Wrong size on HuskPawn_Sploder_C_ExecuteUbergraph_HuskPawn_Sploder");
static_assert(offsetof(HuskPawn_Sploder_C_ExecuteUbergraph_HuskPawn_Sploder, EntryPoint) == 0x000000, "Member 'HuskPawn_Sploder_C_ExecuteUbergraph_HuskPawn_Sploder::EntryPoint' has a wrong offset!");
static_assert(offsetof(HuskPawn_Sploder_C_ExecuteUbergraph_HuskPawn_Sploder, Temp_bool_IsClosed_Variable) == 0x000004, "Member 'HuskPawn_Sploder_C_ExecuteUbergraph_HuskPawn_Sploder::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(HuskPawn_Sploder_C_ExecuteUbergraph_HuskPawn_Sploder, CallFunc_HasAuthority_ReturnValue) == 0x000005, "Member 'HuskPawn_Sploder_C_ExecuteUbergraph_HuskPawn_Sploder::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(HuskPawn_Sploder_C_ExecuteUbergraph_HuskPawn_Sploder, CallFunc_HasAuthority_ReturnValue2) == 0x000006, "Member 'HuskPawn_Sploder_C_ExecuteUbergraph_HuskPawn_Sploder::CallFunc_HasAuthority_ReturnValue2' has a wrong offset!");
static_assert(offsetof(HuskPawn_Sploder_C_ExecuteUbergraph_HuskPawn_Sploder, Temp_bool_Has_Been_Initd_Variable) == 0x000007, "Member 'HuskPawn_Sploder_C_ExecuteUbergraph_HuskPawn_Sploder::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(HuskPawn_Sploder_C_ExecuteUbergraph_HuskPawn_Sploder, K2Node_Event_Damage2) == 0x000008, "Member 'HuskPawn_Sploder_C_ExecuteUbergraph_HuskPawn_Sploder::K2Node_Event_Damage2' has a wrong offset!");
static_assert(offsetof(HuskPawn_Sploder_C_ExecuteUbergraph_HuskPawn_Sploder, K2Node_Event_DamageTags2) == 0x00000C, "Member 'HuskPawn_Sploder_C_ExecuteUbergraph_HuskPawn_Sploder::K2Node_Event_DamageTags2' has a wrong offset!");
static_assert(offsetof(HuskPawn_Sploder_C_ExecuteUbergraph_HuskPawn_Sploder, K2Node_Event_Momentum2) == 0x000024, "Member 'HuskPawn_Sploder_C_ExecuteUbergraph_HuskPawn_Sploder::K2Node_Event_Momentum2' has a wrong offset!");
static_assert(offsetof(HuskPawn_Sploder_C_ExecuteUbergraph_HuskPawn_Sploder, K2Node_Event_HitInfo2) == 0x000030, "Member 'HuskPawn_Sploder_C_ExecuteUbergraph_HuskPawn_Sploder::K2Node_Event_HitInfo2' has a wrong offset!");
static_assert(offsetof(HuskPawn_Sploder_C_ExecuteUbergraph_HuskPawn_Sploder, K2Node_Event_InstigatedBy2) == 0x0000B0, "Member 'HuskPawn_Sploder_C_ExecuteUbergraph_HuskPawn_Sploder::K2Node_Event_InstigatedBy2' has a wrong offset!");
static_assert(offsetof(HuskPawn_Sploder_C_ExecuteUbergraph_HuskPawn_Sploder, K2Node_Event_DamageCauser2) == 0x0000B4, "Member 'HuskPawn_Sploder_C_ExecuteUbergraph_HuskPawn_Sploder::K2Node_Event_DamageCauser2' has a wrong offset!");
static_assert(offsetof(HuskPawn_Sploder_C_ExecuteUbergraph_HuskPawn_Sploder, K2Node_Event_EffectContext2) == 0x0000B8, "Member 'HuskPawn_Sploder_C_ExecuteUbergraph_HuskPawn_Sploder::K2Node_Event_EffectContext2' has a wrong offset!");
static_assert(offsetof(HuskPawn_Sploder_C_ExecuteUbergraph_HuskPawn_Sploder, CallFunc_Not_PreBool_ReturnValue) == 0x0000C4, "Member 'HuskPawn_Sploder_C_ExecuteUbergraph_HuskPawn_Sploder::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(HuskPawn_Sploder_C_ExecuteUbergraph_HuskPawn_Sploder, K2Node_Event_Damage) == 0x0000C8, "Member 'HuskPawn_Sploder_C_ExecuteUbergraph_HuskPawn_Sploder::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(HuskPawn_Sploder_C_ExecuteUbergraph_HuskPawn_Sploder, K2Node_Event_DamageTags) == 0x0000CC, "Member 'HuskPawn_Sploder_C_ExecuteUbergraph_HuskPawn_Sploder::K2Node_Event_DamageTags' has a wrong offset!");
static_assert(offsetof(HuskPawn_Sploder_C_ExecuteUbergraph_HuskPawn_Sploder, K2Node_Event_Momentum) == 0x0000E4, "Member 'HuskPawn_Sploder_C_ExecuteUbergraph_HuskPawn_Sploder::K2Node_Event_Momentum' has a wrong offset!");
static_assert(offsetof(HuskPawn_Sploder_C_ExecuteUbergraph_HuskPawn_Sploder, K2Node_Event_HitInfo) == 0x0000F0, "Member 'HuskPawn_Sploder_C_ExecuteUbergraph_HuskPawn_Sploder::K2Node_Event_HitInfo' has a wrong offset!");
static_assert(offsetof(HuskPawn_Sploder_C_ExecuteUbergraph_HuskPawn_Sploder, K2Node_Event_InstigatedBy) == 0x000170, "Member 'HuskPawn_Sploder_C_ExecuteUbergraph_HuskPawn_Sploder::K2Node_Event_InstigatedBy' has a wrong offset!");
static_assert(offsetof(HuskPawn_Sploder_C_ExecuteUbergraph_HuskPawn_Sploder, K2Node_Event_DamageCauser) == 0x000174, "Member 'HuskPawn_Sploder_C_ExecuteUbergraph_HuskPawn_Sploder::K2Node_Event_DamageCauser' has a wrong offset!");
static_assert(offsetof(HuskPawn_Sploder_C_ExecuteUbergraph_HuskPawn_Sploder, K2Node_Event_EffectContext) == 0x000178, "Member 'HuskPawn_Sploder_C_ExecuteUbergraph_HuskPawn_Sploder::K2Node_Event_EffectContext' has a wrong offset!");
static_assert(offsetof(HuskPawn_Sploder_C_ExecuteUbergraph_HuskPawn_Sploder, CallFunc_GetHealth_ReturnValue) == 0x000184, "Member 'HuskPawn_Sploder_C_ExecuteUbergraph_HuskPawn_Sploder::CallFunc_GetHealth_ReturnValue' has a wrong offset!");
static_assert(offsetof(HuskPawn_Sploder_C_ExecuteUbergraph_HuskPawn_Sploder, CallFunc_IsFullBodyHit_ReturnValue) == 0x000188, "Member 'HuskPawn_Sploder_C_ExecuteUbergraph_HuskPawn_Sploder::CallFunc_IsFullBodyHit_ReturnValue' has a wrong offset!");
static_assert(offsetof(HuskPawn_Sploder_C_ExecuteUbergraph_HuskPawn_Sploder, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000189, "Member 'HuskPawn_Sploder_C_ExecuteUbergraph_HuskPawn_Sploder::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(HuskPawn_Sploder_C_ExecuteUbergraph_HuskPawn_Sploder, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x00018C, "Member 'HuskPawn_Sploder_C_ExecuteUbergraph_HuskPawn_Sploder::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(HuskPawn_Sploder_C_ExecuteUbergraph_HuskPawn_Sploder, CallFunc_RemoveActiveGameplayEffect_ReturnValue) == 0x000190, "Member 'HuskPawn_Sploder_C_ExecuteUbergraph_HuskPawn_Sploder::CallFunc_RemoveActiveGameplayEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(HuskPawn_Sploder_C_ExecuteUbergraph_HuskPawn_Sploder, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x0001A0, "Member 'HuskPawn_Sploder_C_ExecuteUbergraph_HuskPawn_Sploder::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(HuskPawn_Sploder_C_ExecuteUbergraph_HuskPawn_Sploder, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0001D0, "Member 'HuskPawn_Sploder_C_ExecuteUbergraph_HuskPawn_Sploder::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(HuskPawn_Sploder_C_ExecuteUbergraph_HuskPawn_Sploder, CallFunc_FinishSpawningActor_ReturnValue) == 0x0001D4, "Member 'HuskPawn_Sploder_C_ExecuteUbergraph_HuskPawn_Sploder::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(HuskPawn_Sploder_C_ExecuteUbergraph_HuskPawn_Sploder, CallFunc_HasTags_ReturnValue) == 0x0001D8, "Member 'HuskPawn_Sploder_C_ExecuteUbergraph_HuskPawn_Sploder::CallFunc_HasTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(HuskPawn_Sploder_C_ExecuteUbergraph_HuskPawn_Sploder, CallFunc_BooleanAND_ReturnValue) == 0x0001D9, "Member 'HuskPawn_Sploder_C_ExecuteUbergraph_HuskPawn_Sploder::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(HuskPawn_Sploder_C_ExecuteUbergraph_HuskPawn_Sploder, CallFunc_BooleanAND_ReturnValue2) == 0x0001DA, "Member 'HuskPawn_Sploder_C_ExecuteUbergraph_HuskPawn_Sploder::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");
static_assert(offsetof(HuskPawn_Sploder_C_ExecuteUbergraph_HuskPawn_Sploder, CallFunc_BooleanAND_ReturnValue3) == 0x0001DB, "Member 'HuskPawn_Sploder_C_ExecuteUbergraph_HuskPawn_Sploder::CallFunc_BooleanAND_ReturnValue3' has a wrong offset!");
static_assert(offsetof(HuskPawn_Sploder_C_ExecuteUbergraph_HuskPawn_Sploder, CallFunc_BooleanAND_ReturnValue4) == 0x0001DC, "Member 'HuskPawn_Sploder_C_ExecuteUbergraph_HuskPawn_Sploder::CallFunc_BooleanAND_ReturnValue4' has a wrong offset!");
static_assert(offsetof(HuskPawn_Sploder_C_ExecuteUbergraph_HuskPawn_Sploder, K2Node_Event_HitDirection) == 0x0001E0, "Member 'HuskPawn_Sploder_C_ExecuteUbergraph_HuskPawn_Sploder::K2Node_Event_HitDirection' has a wrong offset!");
static_assert(offsetof(HuskPawn_Sploder_C_ExecuteUbergraph_HuskPawn_Sploder, CallFunc_BooleanAND_ReturnValue5) == 0x0001EC, "Member 'HuskPawn_Sploder_C_ExecuteUbergraph_HuskPawn_Sploder::CallFunc_BooleanAND_ReturnValue5' has a wrong offset!");
static_assert(offsetof(HuskPawn_Sploder_C_ExecuteUbergraph_HuskPawn_Sploder, CallFunc_SetFNameBasedOnHitDirection_NameResult) == 0x0001F0, "Member 'HuskPawn_Sploder_C_ExecuteUbergraph_HuskPawn_Sploder::CallFunc_SetFNameBasedOnHitDirection_NameResult' has a wrong offset!");
static_assert(offsetof(HuskPawn_Sploder_C_ExecuteUbergraph_HuskPawn_Sploder, CallFunc_PlayAnimMontage_ReturnValue) == 0x0001F8, "Member 'HuskPawn_Sploder_C_ExecuteUbergraph_HuskPawn_Sploder::CallFunc_PlayAnimMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(HuskPawn_Sploder_C_ExecuteUbergraph_HuskPawn_Sploder, CallFunc_Array_Contains_ReturnValue) == 0x0001FC, "Member 'HuskPawn_Sploder_C_ExecuteUbergraph_HuskPawn_Sploder::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");

// Function HuskPawn_Sploder.HuskPawn_Sploder_C.PlayAdditiveHitReacts
// 0x000C (0x000C - 0x0000)
struct HuskPawn_Sploder_C_PlayAdditiveHitReacts final
{
public:
	struct FVector                                HitDirection;                                      // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HuskPawn_Sploder_C_PlayAdditiveHitReacts) == 0x000004, "Wrong alignment on HuskPawn_Sploder_C_PlayAdditiveHitReacts");
static_assert(sizeof(HuskPawn_Sploder_C_PlayAdditiveHitReacts) == 0x00000C, "Wrong size on HuskPawn_Sploder_C_PlayAdditiveHitReacts");
static_assert(offsetof(HuskPawn_Sploder_C_PlayAdditiveHitReacts, HitDirection) == 0x000000, "Member 'HuskPawn_Sploder_C_PlayAdditiveHitReacts::HitDirection' has a wrong offset!");

// Function HuskPawn_Sploder.HuskPawn_Sploder_C.OnDamageServer
// 0x00BC (0x00BC - 0x0000)
struct HuskPawn_Sploder_C_OnDamageServer final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  DamageTags;                                        // 0x0004(0x0018)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FVector                                Momentum;                                          // 0x001C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             HitInfo;                                           // 0x0028(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class AController*                            InstigatedBy;                                      // 0x00A8(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 DamageCauser_0;                                    // 0x00AC(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x00B0(0x000C)(Parm)
};
static_assert(alignof(HuskPawn_Sploder_C_OnDamageServer) == 0x000004, "Wrong alignment on HuskPawn_Sploder_C_OnDamageServer");
static_assert(sizeof(HuskPawn_Sploder_C_OnDamageServer) == 0x0000BC, "Wrong size on HuskPawn_Sploder_C_OnDamageServer");
static_assert(offsetof(HuskPawn_Sploder_C_OnDamageServer, Damage) == 0x000000, "Member 'HuskPawn_Sploder_C_OnDamageServer::Damage' has a wrong offset!");
static_assert(offsetof(HuskPawn_Sploder_C_OnDamageServer, DamageTags) == 0x000004, "Member 'HuskPawn_Sploder_C_OnDamageServer::DamageTags' has a wrong offset!");
static_assert(offsetof(HuskPawn_Sploder_C_OnDamageServer, Momentum) == 0x00001C, "Member 'HuskPawn_Sploder_C_OnDamageServer::Momentum' has a wrong offset!");
static_assert(offsetof(HuskPawn_Sploder_C_OnDamageServer, HitInfo) == 0x000028, "Member 'HuskPawn_Sploder_C_OnDamageServer::HitInfo' has a wrong offset!");
static_assert(offsetof(HuskPawn_Sploder_C_OnDamageServer, InstigatedBy) == 0x0000A8, "Member 'HuskPawn_Sploder_C_OnDamageServer::InstigatedBy' has a wrong offset!");
static_assert(offsetof(HuskPawn_Sploder_C_OnDamageServer, DamageCauser_0) == 0x0000AC, "Member 'HuskPawn_Sploder_C_OnDamageServer::DamageCauser_0' has a wrong offset!");
static_assert(offsetof(HuskPawn_Sploder_C_OnDamageServer, EffectContext) == 0x0000B0, "Member 'HuskPawn_Sploder_C_OnDamageServer::EffectContext' has a wrong offset!");

// Function HuskPawn_Sploder.HuskPawn_Sploder_C.OnDeathServer
// 0x00BC (0x00BC - 0x0000)
struct HuskPawn_Sploder_C_OnDeathServer final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  DamageTags;                                        // 0x0004(0x0018)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FVector                                Momentum;                                          // 0x001C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             HitInfo;                                           // 0x0028(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class AController*                            InstigatedBy;                                      // 0x00A8(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 DamageCauser_0;                                    // 0x00AC(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x00B0(0x000C)(Parm)
};
static_assert(alignof(HuskPawn_Sploder_C_OnDeathServer) == 0x000004, "Wrong alignment on HuskPawn_Sploder_C_OnDeathServer");
static_assert(sizeof(HuskPawn_Sploder_C_OnDeathServer) == 0x0000BC, "Wrong size on HuskPawn_Sploder_C_OnDeathServer");
static_assert(offsetof(HuskPawn_Sploder_C_OnDeathServer, Damage) == 0x000000, "Member 'HuskPawn_Sploder_C_OnDeathServer::Damage' has a wrong offset!");
static_assert(offsetof(HuskPawn_Sploder_C_OnDeathServer, DamageTags) == 0x000004, "Member 'HuskPawn_Sploder_C_OnDeathServer::DamageTags' has a wrong offset!");
static_assert(offsetof(HuskPawn_Sploder_C_OnDeathServer, Momentum) == 0x00001C, "Member 'HuskPawn_Sploder_C_OnDeathServer::Momentum' has a wrong offset!");
static_assert(offsetof(HuskPawn_Sploder_C_OnDeathServer, HitInfo) == 0x000028, "Member 'HuskPawn_Sploder_C_OnDeathServer::HitInfo' has a wrong offset!");
static_assert(offsetof(HuskPawn_Sploder_C_OnDeathServer, InstigatedBy) == 0x0000A8, "Member 'HuskPawn_Sploder_C_OnDeathServer::InstigatedBy' has a wrong offset!");
static_assert(offsetof(HuskPawn_Sploder_C_OnDeathServer, DamageCauser_0) == 0x0000AC, "Member 'HuskPawn_Sploder_C_OnDeathServer::DamageCauser_0' has a wrong offset!");
static_assert(offsetof(HuskPawn_Sploder_C_OnDeathServer, EffectContext) == 0x0000B0, "Member 'HuskPawn_Sploder_C_OnDeathServer::EffectContext' has a wrong offset!");

// Function HuskPawn_Sploder.HuskPawn_Sploder_C.OnRep_TankDropped
// 0x0001 (0x0001 - 0x0000)
struct HuskPawn_Sploder_C_OnRep_TankDropped final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HuskPawn_Sploder_C_OnRep_TankDropped) == 0x000001, "Wrong alignment on HuskPawn_Sploder_C_OnRep_TankDropped");
static_assert(sizeof(HuskPawn_Sploder_C_OnRep_TankDropped) == 0x000001, "Wrong size on HuskPawn_Sploder_C_OnRep_TankDropped");
static_assert(offsetof(HuskPawn_Sploder_C_OnRep_TankDropped, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'HuskPawn_Sploder_C_OnRep_TankDropped::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function HuskPawn_Sploder.HuskPawn_Sploder_C.OnRep_HoldingTank
// 0x0128 (0x0128 - 0x0000)
struct HuskPawn_Sploder_C_OnRep_HoldingTank final
{
public:
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEffectContextHandle           CallFunc_MakeEffectContext_ReturnValue;            // 0x0004(0x000C)()
	struct FHitResult                             CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult; // 0x0010(0x0080)(ContainsInstancedReference)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x0090(0x0004)()
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0098(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetActorRelativeLocation_SweepHitResult; // 0x00A4(0x0080)(ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0125(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0126(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HuskPawn_Sploder_C_OnRep_HoldingTank) == 0x000004, "Wrong alignment on HuskPawn_Sploder_C_OnRep_HoldingTank");
static_assert(sizeof(HuskPawn_Sploder_C_OnRep_HoldingTank) == 0x000128, "Wrong size on HuskPawn_Sploder_C_OnRep_HoldingTank");
static_assert(offsetof(HuskPawn_Sploder_C_OnRep_HoldingTank, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000000, "Member 'HuskPawn_Sploder_C_OnRep_HoldingTank::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(HuskPawn_Sploder_C_OnRep_HoldingTank, CallFunc_MakeEffectContext_ReturnValue) == 0x000004, "Member 'HuskPawn_Sploder_C_OnRep_HoldingTank::CallFunc_MakeEffectContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(HuskPawn_Sploder_C_OnRep_HoldingTank, CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult) == 0x000010, "Member 'HuskPawn_Sploder_C_OnRep_HoldingTank::CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(HuskPawn_Sploder_C_OnRep_HoldingTank, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x000090, "Member 'HuskPawn_Sploder_C_OnRep_HoldingTank::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(HuskPawn_Sploder_C_OnRep_HoldingTank, CallFunc_HasAuthority_ReturnValue) == 0x000094, "Member 'HuskPawn_Sploder_C_OnRep_HoldingTank::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(HuskPawn_Sploder_C_OnRep_HoldingTank, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000098, "Member 'HuskPawn_Sploder_C_OnRep_HoldingTank::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(HuskPawn_Sploder_C_OnRep_HoldingTank, CallFunc_K2_SetActorRelativeLocation_SweepHitResult) == 0x0000A4, "Member 'HuskPawn_Sploder_C_OnRep_HoldingTank::CallFunc_K2_SetActorRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(HuskPawn_Sploder_C_OnRep_HoldingTank, CallFunc_IsValid_ReturnValue) == 0x000124, "Member 'HuskPawn_Sploder_C_OnRep_HoldingTank::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(HuskPawn_Sploder_C_OnRep_HoldingTank, CallFunc_Not_PreBool_ReturnValue) == 0x000125, "Member 'HuskPawn_Sploder_C_OnRep_HoldingTank::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(HuskPawn_Sploder_C_OnRep_HoldingTank, CallFunc_BooleanAND_ReturnValue) == 0x000126, "Member 'HuskPawn_Sploder_C_OnRep_HoldingTank::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

#pragma pack(pop)
