#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HuskPawn_Beehive

#include "Basic.hpp"

#include "HuskPawn_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass HuskPawn_Beehive.HuskPawn_Beehive_C
// 0x0070 (0x10F0 - 0x1080)
class AHuskPawn_Beehive_C final : public AHuskPawn_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_HuskPawn_Beehive_C;                 // 0x107C(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               HuskHeadBees;                                      // 0x1080(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UAudioComponent*                        BeeSound;                                          // 0x1084(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UCapsuleComponent*                      HiveCollision;                                     // 0x1088(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   Hive;                                              // 0x108C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	float                                         HiveHealth;                                        // 0x1090(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          HiveBroken;                                        // 0x1094(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	uint8                                         Pad_1095[0x3];                                     // 0x1095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  TC_NPCAbilityAOEBeehive;                           // 0x1098(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  TC_AISkillHuskBeehiveHiveOnHead;                   // 0x10B0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  TagContainerNPCWearingBeehive;                     // 0x10C8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           GameplayTagNPCWearingBeehive;                      // 0x10E0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_HuskPawn_Beehive(int32 EntryPoint);
	void GameplayCue_Abilities_Activation_NPC_Generic_RangedCooldownFX(EGameplayCueEvent EventType, const struct FGameplayCueParameters& Parameters);
	void OnDamageServer(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AController* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void OnDeathServer(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AController* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void BeeTrail();
	void ReceiveBeginPlay();
	void ManageBurpEffect(bool Enabled);
	void BeeCloudDespawned(class AFortProjectileBase* Cloud);
	void FSMBeginPropaneTankMelee();
	void FSMFailedToSpawnTank();
	void FSMRemovePropaneTank();
	void IgnitePropaneTank(class AFortPawn* Pawn, float RemainingFuseTime, bool JustDrop);
	void UserConstructionScript();
	void OnRep_HiveBroken();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HuskPawn_Beehive_C">();
	}
	static class AHuskPawn_Beehive_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AHuskPawn_Beehive_C>();
	}
};
static_assert(alignof(AHuskPawn_Beehive_C) == 0x000010, "Wrong alignment on AHuskPawn_Beehive_C");
static_assert(sizeof(AHuskPawn_Beehive_C) == 0x0010F0, "Wrong size on AHuskPawn_Beehive_C");
static_assert(offsetof(AHuskPawn_Beehive_C, UberGraphFrame_HuskPawn_Beehive_C) == 0x00107C, "Member 'AHuskPawn_Beehive_C::UberGraphFrame_HuskPawn_Beehive_C' has a wrong offset!");
static_assert(offsetof(AHuskPawn_Beehive_C, HuskHeadBees) == 0x001080, "Member 'AHuskPawn_Beehive_C::HuskHeadBees' has a wrong offset!");
static_assert(offsetof(AHuskPawn_Beehive_C, BeeSound) == 0x001084, "Member 'AHuskPawn_Beehive_C::BeeSound' has a wrong offset!");
static_assert(offsetof(AHuskPawn_Beehive_C, HiveCollision) == 0x001088, "Member 'AHuskPawn_Beehive_C::HiveCollision' has a wrong offset!");
static_assert(offsetof(AHuskPawn_Beehive_C, Hive) == 0x00108C, "Member 'AHuskPawn_Beehive_C::Hive' has a wrong offset!");
static_assert(offsetof(AHuskPawn_Beehive_C, HiveHealth) == 0x001090, "Member 'AHuskPawn_Beehive_C::HiveHealth' has a wrong offset!");
static_assert(offsetof(AHuskPawn_Beehive_C, HiveBroken) == 0x001094, "Member 'AHuskPawn_Beehive_C::HiveBroken' has a wrong offset!");
static_assert(offsetof(AHuskPawn_Beehive_C, TC_NPCAbilityAOEBeehive) == 0x001098, "Member 'AHuskPawn_Beehive_C::TC_NPCAbilityAOEBeehive' has a wrong offset!");
static_assert(offsetof(AHuskPawn_Beehive_C, TC_AISkillHuskBeehiveHiveOnHead) == 0x0010B0, "Member 'AHuskPawn_Beehive_C::TC_AISkillHuskBeehiveHiveOnHead' has a wrong offset!");
static_assert(offsetof(AHuskPawn_Beehive_C, TagContainerNPCWearingBeehive) == 0x0010C8, "Member 'AHuskPawn_Beehive_C::TagContainerNPCWearingBeehive' has a wrong offset!");
static_assert(offsetof(AHuskPawn_Beehive_C, GameplayTagNPCWearingBeehive) == 0x0010E0, "Member 'AHuskPawn_Beehive_C::GameplayTagNPCWearingBeehive' has a wrong offset!");

}

#pragma pack(pop)
