#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HuskPawn_Husky

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HuskPawn_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass HuskPawn_Husky.HuskPawn_Husky_C
// 0x0010 (0x1090 - 0x1080)
class AHuskPawn_Husky_C : public AHuskPawn_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_HuskPawn_Husky_C;                   // 0x107C(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               HeadFXTrailComponent;                              // 0x1080(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UParticleSystemComponent*               HeadFXBubblesComponent;                            // 0x1084(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	bool                                          HeadEffectStatus;                                  // 0x1088(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)

public:
	void ExecuteUbergraph_HuskPawn_Husky(int32 EntryPoint);
	void PlayAdditiveHitReacts(const struct FVector& HitDirection);
	void DisableHeadEffect();
	void OnDeathServer(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AController* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void ReceiveBeginPlay();
	void ManageBurpEffect(bool Enabled);
	void BeeCloudDespawned(class AFortProjectileBase* Cloud);
	void FSMBeginPropaneTankMelee();
	void FSMFailedToSpawnTank();
	void FSMRemovePropaneTank();
	void IgnitePropaneTank(class AFortPawn* Pawn, float RemainingFuseTime, bool JustDrop);
	void UserConstructionScript();
	void OnRep_HeadEffectStatus();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HuskPawn_Husky_C">();
	}
	static class AHuskPawn_Husky_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AHuskPawn_Husky_C>();
	}
};
static_assert(alignof(AHuskPawn_Husky_C) == 0x000010, "Wrong alignment on AHuskPawn_Husky_C");
static_assert(sizeof(AHuskPawn_Husky_C) == 0x001090, "Wrong size on AHuskPawn_Husky_C");
static_assert(offsetof(AHuskPawn_Husky_C, UberGraphFrame_HuskPawn_Husky_C) == 0x00107C, "Member 'AHuskPawn_Husky_C::UberGraphFrame_HuskPawn_Husky_C' has a wrong offset!");
static_assert(offsetof(AHuskPawn_Husky_C, HeadFXTrailComponent) == 0x001080, "Member 'AHuskPawn_Husky_C::HeadFXTrailComponent' has a wrong offset!");
static_assert(offsetof(AHuskPawn_Husky_C, HeadFXBubblesComponent) == 0x001084, "Member 'AHuskPawn_Husky_C::HeadFXBubblesComponent' has a wrong offset!");
static_assert(offsetof(AHuskPawn_Husky_C, HeadEffectStatus) == 0x001088, "Member 'AHuskPawn_Husky_C::HeadEffectStatus' has a wrong offset!");

}

#pragma pack(pop)
