#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HuskyHusk_AnimBlueprint

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// AnimBlueprintGeneratedClass HuskyHusk_AnimBlueprint.HuskyHusk_AnimBlueprint_C
// 0x10F0 (0x1530 - 0x0440)
class UHuskyHusk_AnimBlueprint_C final : public UFortAnimInstance
{
public:
	uint8                                         Pad_438[0x8];                                      // 0x0438(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0440(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_E0738F9C4B961F76418ADBB0BD0BD3E2; // 0x0444(0x002C)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_85FC94794CDBD7D5EC263B8A1FDB2CF1; // 0x0470(0x0044)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_35600CF0463F32C2D63C2990276C3A13; // 0x04B4(0x0044)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_5C45D822456C4600C448B691A8AC035F; // 0x04F8(0x0044)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_E94AF4ED4D3DD700085A118EF3986015; // 0x053C(0x006C)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6AB287614D9FF63719ED89B7469955EA; // 0x05A8(0x002C)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4CC244374DC69718662F6FAEBC923553; // 0x05D4(0x002C)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_BC31999F40EFB9CA3D394EAB922FE71E; // 0x0600(0x002C)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_B2C98E0B467A316ECB3C8EA0E6E240AF; // 0x062C(0x002C)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_DF703EF640238D419B071DABC42563A5; // 0x0658(0x002C)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_94788343401C88F30C5D4EB945C0CA4F; // 0x0684(0x002C)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_0BAFB06848AAF153C2F785B7A824B201; // 0x06B0(0x002C)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_DD85389D4F735CFF4DAB0D8B03A80E8D; // 0x06DC(0x002C)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_299693DB477CBC05AE4889A83B54D61E; // 0x0708(0x002C)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7020CDB54BEC6F11B5019AB2C2B7B010; // 0x0734(0x002C)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1CC31CBF454EC03468D635A6384834F1; // 0x0760(0x002C)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_54765A9742ED7235342FF897744F2361; // 0x078C(0x002C)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_E8F8CFEB4FCE62B2CE9F77882B4B8FE8; // 0x07B8(0x002C)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_06BA09FA493F5B575509C5B6F9324AE3; // 0x07E4(0x0058)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_F84C82F94BCB04D1320FDD87434DF8B2; // 0x083C(0x008C)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_420934D244258DD8DB74EB90634635D4; // 0x08C8(0x0058)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_0FBE5AD74F7CB4D7011597BF83008D17; // 0x0920(0x002C)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_40396A314A3562EF5497DB878099A763; // 0x094C(0x0054)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_6AE906D64F04C622EE1C0E8790E5820F; // 0x09A0(0x008C)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_E817A549485D713F0779A7B095F60EA7; // 0x0A2C(0x0054)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_235423DC45E2A8F7B1EDD9B58BE7FA8D; // 0x0A80(0x002C)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5E72D8C44B6F14A076B0BA88B9303265; // 0x0AAC(0x0058)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_E866DDAF436D71A18E9825A0E6991EB9; // 0x0B04(0x008C)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_EE9F9E1C4B706965EC2487A498277BA7; // 0x0B90(0x0058)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_694685CE4B23245ACC3968A465AAFE73; // 0x0BE8(0x002C)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_B09B8BE341474938140809BD2FEFF5F1; // 0x0C14(0x0058)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_729FA74544DA9B73F497B6B7FB8450C6; // 0x0C6C(0x002C)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_28B051824CC8AE9006A87E8C84082F7A; // 0x0C98(0x0058)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_7EF0DF25466C758F3C8D798206EAA932; // 0x0CF0(0x002C)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_3D7160D64CF82FA62E007C8E287941CB; // 0x0D1C(0x008C)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_73EFF77B4FC9B6C1312943A99F2A0A01; // 0x0DA8(0x0058)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_087282D147B52D06B86CF49E6F60BFB4; // 0x0E00(0x0058)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_74A83F1D434CBFACC4B7619944C094B1; // 0x0E58(0x002C)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4E84997E49CF98928115FEA5CF6294FB; // 0x0E84(0x0058)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_67B68D4D435030B98C4848A97B5913D2; // 0x0EDC(0x0058)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_A24A52D742E515D37ABCEBBA06AD40BF; // 0x0F34(0x008C)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_263528634D2860A90F7BF4B36BF1D98F; // 0x0FC0(0x002C)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_80A784A14F311E231803D5937B2B55CE; // 0x0FEC(0x00DC)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_0F839A7846C7117C22E469B09EFE47A5; // 0x10C8(0x00DC)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_E97773C946CDB83E511FB296809C2F36; // 0x11A4(0x008C)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_C43803324AA67186A368DC9FB74AF150; // 0x1230(0x002C)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1C1A2DC0486CA114B6F23481D5BA422B; // 0x125C(0x0058)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_B834A4CA4C469983FFD920B381F62542; // 0x12B4(0x008C)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_352F15074687391989BCD0B657BBE018; // 0x1340(0x0058)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_5A2265FB4DEF3BBC5AF707AF4785CB27; // 0x1398(0x002C)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_6AA7FBFC4E9EBF9CBF47F4B215B194CC; // 0x13C4(0x0094)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_540E18B04666F7140B1EF0B186E4CD72; // 0x1458(0x005C)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5316A0A64BDE7943726FF79EA3DACB4D; // 0x14B4(0x002C)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2B98290F46FB2516CFDB46A82DFB4CEA; // 0x14E0(0x002C)()
	bool                                          bIsSleeping;                                       // 0x150C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bIsStunned;                                        // 0x150D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bIsPlayingRootMotion;                              // 0x150E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bIsCarryingTank;                                   // 0x150F(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsSploder;                                         // 0x1510(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1511[0x3];                                     // 0x1511(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LowerBodyTargetWeight;                             // 0x1514(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         LowerBodyCurrentWeight;                            // 0x1518(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bShouldUseMovementLocomotion;                      // 0x151C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_151D[0x3];                                     // 0x151D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortAIPawn*                            FortAIPawnOwner;                                   // 0x1520(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_HuskyHusk_AnimBlueprint(int32 EntryPoint);
	void BlueprintInitializeAnimation();
	void AnimNotify_StunnedFullyBlendedState();
	void AnimNotify_StunnedLeftState();
	void AnimNotify_SleepingFullyBlended();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_HuskyHusk_AnimBlueprint_AnimGraphNode_TransitionResult_E8F8CFEB4FCE62B2CE9F77882B4B8FE8();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_HuskyHusk_AnimBlueprint_AnimGraphNode_TransitionResult_54765A9742ED7235342FF897744F2361();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_HuskyHusk_AnimBlueprint_AnimGraphNode_TransitionResult_1CC31CBF454EC03468D635A6384834F1();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_HuskyHusk_AnimBlueprint_AnimGraphNode_TransitionResult_0BAFB06848AAF153C2F785B7A824B201();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_HuskyHusk_AnimBlueprint_AnimGraphNode_TransitionResult_94788343401C88F30C5D4EB945C0CA4F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_HuskyHusk_AnimBlueprint_AnimGraphNode_TransitionResult_DF703EF640238D419B071DABC42563A5();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_HuskyHusk_AnimBlueprint_AnimGraphNode_TransitionResult_B2C98E0B467A316ECB3C8EA0E6E240AF();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_HuskyHusk_AnimBlueprint_AnimGraphNode_TransitionResult_BC31999F40EFB9CA3D394EAB922FE71E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_HuskyHusk_AnimBlueprint_AnimGraphNode_TransitionResult_4CC244374DC69718662F6FAEBC923553();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_HuskyHusk_AnimBlueprint_AnimGraphNode_TransitionResult_6AB287614D9FF63719ED89B7469955EA();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HuskyHusk_AnimBlueprint_C">();
	}
	static class UHuskyHusk_AnimBlueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHuskyHusk_AnimBlueprint_C>();
	}
};
static_assert(alignof(UHuskyHusk_AnimBlueprint_C) == 0x000010, "Wrong alignment on UHuskyHusk_AnimBlueprint_C");
static_assert(sizeof(UHuskyHusk_AnimBlueprint_C) == 0x001530, "Wrong size on UHuskyHusk_AnimBlueprint_C");
static_assert(offsetof(UHuskyHusk_AnimBlueprint_C, UberGraphFrame) == 0x000440, "Member 'UHuskyHusk_AnimBlueprint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UHuskyHusk_AnimBlueprint_C, AnimGraphNode_Root_E0738F9C4B961F76418ADBB0BD0BD3E2) == 0x000444, "Member 'UHuskyHusk_AnimBlueprint_C::AnimGraphNode_Root_E0738F9C4B961F76418ADBB0BD0BD3E2' has a wrong offset!");
static_assert(offsetof(UHuskyHusk_AnimBlueprint_C, AnimGraphNode_Slot_85FC94794CDBD7D5EC263B8A1FDB2CF1) == 0x000470, "Member 'UHuskyHusk_AnimBlueprint_C::AnimGraphNode_Slot_85FC94794CDBD7D5EC263B8A1FDB2CF1' has a wrong offset!");
static_assert(offsetof(UHuskyHusk_AnimBlueprint_C, AnimGraphNode_Slot_35600CF0463F32C2D63C2990276C3A13) == 0x0004B4, "Member 'UHuskyHusk_AnimBlueprint_C::AnimGraphNode_Slot_35600CF0463F32C2D63C2990276C3A13' has a wrong offset!");
static_assert(offsetof(UHuskyHusk_AnimBlueprint_C, AnimGraphNode_Slot_5C45D822456C4600C448B691A8AC035F) == 0x0004F8, "Member 'UHuskyHusk_AnimBlueprint_C::AnimGraphNode_Slot_5C45D822456C4600C448B691A8AC035F' has a wrong offset!");
static_assert(offsetof(UHuskyHusk_AnimBlueprint_C, AnimGraphNode_LayeredBoneBlend_E94AF4ED4D3DD700085A118EF3986015) == 0x00053C, "Member 'UHuskyHusk_AnimBlueprint_C::AnimGraphNode_LayeredBoneBlend_E94AF4ED4D3DD700085A118EF3986015' has a wrong offset!");
static_assert(offsetof(UHuskyHusk_AnimBlueprint_C, AnimGraphNode_TransitionResult_6AB287614D9FF63719ED89B7469955EA) == 0x0005A8, "Member 'UHuskyHusk_AnimBlueprint_C::AnimGraphNode_TransitionResult_6AB287614D9FF63719ED89B7469955EA' has a wrong offset!");
static_assert(offsetof(UHuskyHusk_AnimBlueprint_C, AnimGraphNode_TransitionResult_4CC244374DC69718662F6FAEBC923553) == 0x0005D4, "Member 'UHuskyHusk_AnimBlueprint_C::AnimGraphNode_TransitionResult_4CC244374DC69718662F6FAEBC923553' has a wrong offset!");
static_assert(offsetof(UHuskyHusk_AnimBlueprint_C, AnimGraphNode_TransitionResult_BC31999F40EFB9CA3D394EAB922FE71E) == 0x000600, "Member 'UHuskyHusk_AnimBlueprint_C::AnimGraphNode_TransitionResult_BC31999F40EFB9CA3D394EAB922FE71E' has a wrong offset!");
static_assert(offsetof(UHuskyHusk_AnimBlueprint_C, AnimGraphNode_TransitionResult_B2C98E0B467A316ECB3C8EA0E6E240AF) == 0x00062C, "Member 'UHuskyHusk_AnimBlueprint_C::AnimGraphNode_TransitionResult_B2C98E0B467A316ECB3C8EA0E6E240AF' has a wrong offset!");
static_assert(offsetof(UHuskyHusk_AnimBlueprint_C, AnimGraphNode_TransitionResult_DF703EF640238D419B071DABC42563A5) == 0x000658, "Member 'UHuskyHusk_AnimBlueprint_C::AnimGraphNode_TransitionResult_DF703EF640238D419B071DABC42563A5' has a wrong offset!");
static_assert(offsetof(UHuskyHusk_AnimBlueprint_C, AnimGraphNode_TransitionResult_94788343401C88F30C5D4EB945C0CA4F) == 0x000684, "Member 'UHuskyHusk_AnimBlueprint_C::AnimGraphNode_TransitionResult_94788343401C88F30C5D4EB945C0CA4F' has a wrong offset!");
static_assert(offsetof(UHuskyHusk_AnimBlueprint_C, AnimGraphNode_TransitionResult_0BAFB06848AAF153C2F785B7A824B201) == 0x0006B0, "Member 'UHuskyHusk_AnimBlueprint_C::AnimGraphNode_TransitionResult_0BAFB06848AAF153C2F785B7A824B201' has a wrong offset!");
static_assert(offsetof(UHuskyHusk_AnimBlueprint_C, AnimGraphNode_TransitionResult_DD85389D4F735CFF4DAB0D8B03A80E8D) == 0x0006DC, "Member 'UHuskyHusk_AnimBlueprint_C::AnimGraphNode_TransitionResult_DD85389D4F735CFF4DAB0D8B03A80E8D' has a wrong offset!");
static_assert(offsetof(UHuskyHusk_AnimBlueprint_C, AnimGraphNode_TransitionResult_299693DB477CBC05AE4889A83B54D61E) == 0x000708, "Member 'UHuskyHusk_AnimBlueprint_C::AnimGraphNode_TransitionResult_299693DB477CBC05AE4889A83B54D61E' has a wrong offset!");
static_assert(offsetof(UHuskyHusk_AnimBlueprint_C, AnimGraphNode_TransitionResult_7020CDB54BEC6F11B5019AB2C2B7B010) == 0x000734, "Member 'UHuskyHusk_AnimBlueprint_C::AnimGraphNode_TransitionResult_7020CDB54BEC6F11B5019AB2C2B7B010' has a wrong offset!");
static_assert(offsetof(UHuskyHusk_AnimBlueprint_C, AnimGraphNode_TransitionResult_1CC31CBF454EC03468D635A6384834F1) == 0x000760, "Member 'UHuskyHusk_AnimBlueprint_C::AnimGraphNode_TransitionResult_1CC31CBF454EC03468D635A6384834F1' has a wrong offset!");
static_assert(offsetof(UHuskyHusk_AnimBlueprint_C, AnimGraphNode_TransitionResult_54765A9742ED7235342FF897744F2361) == 0x00078C, "Member 'UHuskyHusk_AnimBlueprint_C::AnimGraphNode_TransitionResult_54765A9742ED7235342FF897744F2361' has a wrong offset!");
static_assert(offsetof(UHuskyHusk_AnimBlueprint_C, AnimGraphNode_TransitionResult_E8F8CFEB4FCE62B2CE9F77882B4B8FE8) == 0x0007B8, "Member 'UHuskyHusk_AnimBlueprint_C::AnimGraphNode_TransitionResult_E8F8CFEB4FCE62B2CE9F77882B4B8FE8' has a wrong offset!");
static_assert(offsetof(UHuskyHusk_AnimBlueprint_C, AnimGraphNode_SequencePlayer_06BA09FA493F5B575509C5B6F9324AE3) == 0x0007E4, "Member 'UHuskyHusk_AnimBlueprint_C::AnimGraphNode_SequencePlayer_06BA09FA493F5B575509C5B6F9324AE3' has a wrong offset!");
static_assert(offsetof(UHuskyHusk_AnimBlueprint_C, AnimGraphNode_BlendListByBool_F84C82F94BCB04D1320FDD87434DF8B2) == 0x00083C, "Member 'UHuskyHusk_AnimBlueprint_C::AnimGraphNode_BlendListByBool_F84C82F94BCB04D1320FDD87434DF8B2' has a wrong offset!");
static_assert(offsetof(UHuskyHusk_AnimBlueprint_C, AnimGraphNode_SequencePlayer_420934D244258DD8DB74EB90634635D4) == 0x0008C8, "Member 'UHuskyHusk_AnimBlueprint_C::AnimGraphNode_SequencePlayer_420934D244258DD8DB74EB90634635D4' has a wrong offset!");
static_assert(offsetof(UHuskyHusk_AnimBlueprint_C, AnimGraphNode_StateResult_0FBE5AD74F7CB4D7011597BF83008D17) == 0x000920, "Member 'UHuskyHusk_AnimBlueprint_C::AnimGraphNode_StateResult_0FBE5AD74F7CB4D7011597BF83008D17' has a wrong offset!");
static_assert(offsetof(UHuskyHusk_AnimBlueprint_C, AnimGraphNode_SequenceEvaluator_40396A314A3562EF5497DB878099A763) == 0x00094C, "Member 'UHuskyHusk_AnimBlueprint_C::AnimGraphNode_SequenceEvaluator_40396A314A3562EF5497DB878099A763' has a wrong offset!");
static_assert(offsetof(UHuskyHusk_AnimBlueprint_C, AnimGraphNode_BlendListByBool_6AE906D64F04C622EE1C0E8790E5820F) == 0x0009A0, "Member 'UHuskyHusk_AnimBlueprint_C::AnimGraphNode_BlendListByBool_6AE906D64F04C622EE1C0E8790E5820F' has a wrong offset!");
static_assert(offsetof(UHuskyHusk_AnimBlueprint_C, AnimGraphNode_SequenceEvaluator_E817A549485D713F0779A7B095F60EA7) == 0x000A2C, "Member 'UHuskyHusk_AnimBlueprint_C::AnimGraphNode_SequenceEvaluator_E817A549485D713F0779A7B095F60EA7' has a wrong offset!");
static_assert(offsetof(UHuskyHusk_AnimBlueprint_C, AnimGraphNode_StateResult_235423DC45E2A8F7B1EDD9B58BE7FA8D) == 0x000A80, "Member 'UHuskyHusk_AnimBlueprint_C::AnimGraphNode_StateResult_235423DC45E2A8F7B1EDD9B58BE7FA8D' has a wrong offset!");
static_assert(offsetof(UHuskyHusk_AnimBlueprint_C, AnimGraphNode_SequencePlayer_5E72D8C44B6F14A076B0BA88B9303265) == 0x000AAC, "Member 'UHuskyHusk_AnimBlueprint_C::AnimGraphNode_SequencePlayer_5E72D8C44B6F14A076B0BA88B9303265' has a wrong offset!");
static_assert(offsetof(UHuskyHusk_AnimBlueprint_C, AnimGraphNode_BlendListByBool_E866DDAF436D71A18E9825A0E6991EB9) == 0x000B04, "Member 'UHuskyHusk_AnimBlueprint_C::AnimGraphNode_BlendListByBool_E866DDAF436D71A18E9825A0E6991EB9' has a wrong offset!");
static_assert(offsetof(UHuskyHusk_AnimBlueprint_C, AnimGraphNode_SequencePlayer_EE9F9E1C4B706965EC2487A498277BA7) == 0x000B90, "Member 'UHuskyHusk_AnimBlueprint_C::AnimGraphNode_SequencePlayer_EE9F9E1C4B706965EC2487A498277BA7' has a wrong offset!");
static_assert(offsetof(UHuskyHusk_AnimBlueprint_C, AnimGraphNode_StateResult_694685CE4B23245ACC3968A465AAFE73) == 0x000BE8, "Member 'UHuskyHusk_AnimBlueprint_C::AnimGraphNode_StateResult_694685CE4B23245ACC3968A465AAFE73' has a wrong offset!");
static_assert(offsetof(UHuskyHusk_AnimBlueprint_C, AnimGraphNode_SequencePlayer_B09B8BE341474938140809BD2FEFF5F1) == 0x000C14, "Member 'UHuskyHusk_AnimBlueprint_C::AnimGraphNode_SequencePlayer_B09B8BE341474938140809BD2FEFF5F1' has a wrong offset!");
static_assert(offsetof(UHuskyHusk_AnimBlueprint_C, AnimGraphNode_StateResult_729FA74544DA9B73F497B6B7FB8450C6) == 0x000C6C, "Member 'UHuskyHusk_AnimBlueprint_C::AnimGraphNode_StateResult_729FA74544DA9B73F497B6B7FB8450C6' has a wrong offset!");
static_assert(offsetof(UHuskyHusk_AnimBlueprint_C, AnimGraphNode_SequencePlayer_28B051824CC8AE9006A87E8C84082F7A) == 0x000C98, "Member 'UHuskyHusk_AnimBlueprint_C::AnimGraphNode_SequencePlayer_28B051824CC8AE9006A87E8C84082F7A' has a wrong offset!");
static_assert(offsetof(UHuskyHusk_AnimBlueprint_C, AnimGraphNode_StateResult_7EF0DF25466C758F3C8D798206EAA932) == 0x000CF0, "Member 'UHuskyHusk_AnimBlueprint_C::AnimGraphNode_StateResult_7EF0DF25466C758F3C8D798206EAA932' has a wrong offset!");
static_assert(offsetof(UHuskyHusk_AnimBlueprint_C, AnimGraphNode_BlendListByBool_3D7160D64CF82FA62E007C8E287941CB) == 0x000D1C, "Member 'UHuskyHusk_AnimBlueprint_C::AnimGraphNode_BlendListByBool_3D7160D64CF82FA62E007C8E287941CB' has a wrong offset!");
static_assert(offsetof(UHuskyHusk_AnimBlueprint_C, AnimGraphNode_SequencePlayer_73EFF77B4FC9B6C1312943A99F2A0A01) == 0x000DA8, "Member 'UHuskyHusk_AnimBlueprint_C::AnimGraphNode_SequencePlayer_73EFF77B4FC9B6C1312943A99F2A0A01' has a wrong offset!");
static_assert(offsetof(UHuskyHusk_AnimBlueprint_C, AnimGraphNode_SequencePlayer_087282D147B52D06B86CF49E6F60BFB4) == 0x000E00, "Member 'UHuskyHusk_AnimBlueprint_C::AnimGraphNode_SequencePlayer_087282D147B52D06B86CF49E6F60BFB4' has a wrong offset!");
static_assert(offsetof(UHuskyHusk_AnimBlueprint_C, AnimGraphNode_StateResult_74A83F1D434CBFACC4B7619944C094B1) == 0x000E58, "Member 'UHuskyHusk_AnimBlueprint_C::AnimGraphNode_StateResult_74A83F1D434CBFACC4B7619944C094B1' has a wrong offset!");
static_assert(offsetof(UHuskyHusk_AnimBlueprint_C, AnimGraphNode_SequencePlayer_4E84997E49CF98928115FEA5CF6294FB) == 0x000E84, "Member 'UHuskyHusk_AnimBlueprint_C::AnimGraphNode_SequencePlayer_4E84997E49CF98928115FEA5CF6294FB' has a wrong offset!");
static_assert(offsetof(UHuskyHusk_AnimBlueprint_C, AnimGraphNode_SequencePlayer_67B68D4D435030B98C4848A97B5913D2) == 0x000EDC, "Member 'UHuskyHusk_AnimBlueprint_C::AnimGraphNode_SequencePlayer_67B68D4D435030B98C4848A97B5913D2' has a wrong offset!");
static_assert(offsetof(UHuskyHusk_AnimBlueprint_C, AnimGraphNode_BlendListByBool_A24A52D742E515D37ABCEBBA06AD40BF) == 0x000F34, "Member 'UHuskyHusk_AnimBlueprint_C::AnimGraphNode_BlendListByBool_A24A52D742E515D37ABCEBBA06AD40BF' has a wrong offset!");
static_assert(offsetof(UHuskyHusk_AnimBlueprint_C, AnimGraphNode_StateResult_263528634D2860A90F7BF4B36BF1D98F) == 0x000FC0, "Member 'UHuskyHusk_AnimBlueprint_C::AnimGraphNode_StateResult_263528634D2860A90F7BF4B36BF1D98F' has a wrong offset!");
static_assert(offsetof(UHuskyHusk_AnimBlueprint_C, AnimGraphNode_BlendSpacePlayer_80A784A14F311E231803D5937B2B55CE) == 0x000FEC, "Member 'UHuskyHusk_AnimBlueprint_C::AnimGraphNode_BlendSpacePlayer_80A784A14F311E231803D5937B2B55CE' has a wrong offset!");
static_assert(offsetof(UHuskyHusk_AnimBlueprint_C, AnimGraphNode_BlendSpacePlayer_0F839A7846C7117C22E469B09EFE47A5) == 0x0010C8, "Member 'UHuskyHusk_AnimBlueprint_C::AnimGraphNode_BlendSpacePlayer_0F839A7846C7117C22E469B09EFE47A5' has a wrong offset!");
static_assert(offsetof(UHuskyHusk_AnimBlueprint_C, AnimGraphNode_BlendListByBool_E97773C946CDB83E511FB296809C2F36) == 0x0011A4, "Member 'UHuskyHusk_AnimBlueprint_C::AnimGraphNode_BlendListByBool_E97773C946CDB83E511FB296809C2F36' has a wrong offset!");
static_assert(offsetof(UHuskyHusk_AnimBlueprint_C, AnimGraphNode_StateResult_C43803324AA67186A368DC9FB74AF150) == 0x001230, "Member 'UHuskyHusk_AnimBlueprint_C::AnimGraphNode_StateResult_C43803324AA67186A368DC9FB74AF150' has a wrong offset!");
static_assert(offsetof(UHuskyHusk_AnimBlueprint_C, AnimGraphNode_SequencePlayer_1C1A2DC0486CA114B6F23481D5BA422B) == 0x00125C, "Member 'UHuskyHusk_AnimBlueprint_C::AnimGraphNode_SequencePlayer_1C1A2DC0486CA114B6F23481D5BA422B' has a wrong offset!");
static_assert(offsetof(UHuskyHusk_AnimBlueprint_C, AnimGraphNode_BlendListByBool_B834A4CA4C469983FFD920B381F62542) == 0x0012B4, "Member 'UHuskyHusk_AnimBlueprint_C::AnimGraphNode_BlendListByBool_B834A4CA4C469983FFD920B381F62542' has a wrong offset!");
static_assert(offsetof(UHuskyHusk_AnimBlueprint_C, AnimGraphNode_SequencePlayer_352F15074687391989BCD0B657BBE018) == 0x001340, "Member 'UHuskyHusk_AnimBlueprint_C::AnimGraphNode_SequencePlayer_352F15074687391989BCD0B657BBE018' has a wrong offset!");
static_assert(offsetof(UHuskyHusk_AnimBlueprint_C, AnimGraphNode_StateResult_5A2265FB4DEF3BBC5AF707AF4785CB27) == 0x001398, "Member 'UHuskyHusk_AnimBlueprint_C::AnimGraphNode_StateResult_5A2265FB4DEF3BBC5AF707AF4785CB27' has a wrong offset!");
static_assert(offsetof(UHuskyHusk_AnimBlueprint_C, AnimGraphNode_StateMachine_6AA7FBFC4E9EBF9CBF47F4B215B194CC) == 0x0013C4, "Member 'UHuskyHusk_AnimBlueprint_C::AnimGraphNode_StateMachine_6AA7FBFC4E9EBF9CBF47F4B215B194CC' has a wrong offset!");
static_assert(offsetof(UHuskyHusk_AnimBlueprint_C, AnimGraphNode_SaveCachedPose_540E18B04666F7140B1EF0B186E4CD72) == 0x001458, "Member 'UHuskyHusk_AnimBlueprint_C::AnimGraphNode_SaveCachedPose_540E18B04666F7140B1EF0B186E4CD72' has a wrong offset!");
static_assert(offsetof(UHuskyHusk_AnimBlueprint_C, AnimGraphNode_UseCachedPose_5316A0A64BDE7943726FF79EA3DACB4D) == 0x0014B4, "Member 'UHuskyHusk_AnimBlueprint_C::AnimGraphNode_UseCachedPose_5316A0A64BDE7943726FF79EA3DACB4D' has a wrong offset!");
static_assert(offsetof(UHuskyHusk_AnimBlueprint_C, AnimGraphNode_UseCachedPose_2B98290F46FB2516CFDB46A82DFB4CEA) == 0x0014E0, "Member 'UHuskyHusk_AnimBlueprint_C::AnimGraphNode_UseCachedPose_2B98290F46FB2516CFDB46A82DFB4CEA' has a wrong offset!");
static_assert(offsetof(UHuskyHusk_AnimBlueprint_C, bIsSleeping) == 0x00150C, "Member 'UHuskyHusk_AnimBlueprint_C::bIsSleeping' has a wrong offset!");
static_assert(offsetof(UHuskyHusk_AnimBlueprint_C, bIsStunned) == 0x00150D, "Member 'UHuskyHusk_AnimBlueprint_C::bIsStunned' has a wrong offset!");
static_assert(offsetof(UHuskyHusk_AnimBlueprint_C, bIsPlayingRootMotion) == 0x00150E, "Member 'UHuskyHusk_AnimBlueprint_C::bIsPlayingRootMotion' has a wrong offset!");
static_assert(offsetof(UHuskyHusk_AnimBlueprint_C, bIsCarryingTank) == 0x00150F, "Member 'UHuskyHusk_AnimBlueprint_C::bIsCarryingTank' has a wrong offset!");
static_assert(offsetof(UHuskyHusk_AnimBlueprint_C, IsSploder) == 0x001510, "Member 'UHuskyHusk_AnimBlueprint_C::IsSploder' has a wrong offset!");
static_assert(offsetof(UHuskyHusk_AnimBlueprint_C, LowerBodyTargetWeight) == 0x001514, "Member 'UHuskyHusk_AnimBlueprint_C::LowerBodyTargetWeight' has a wrong offset!");
static_assert(offsetof(UHuskyHusk_AnimBlueprint_C, LowerBodyCurrentWeight) == 0x001518, "Member 'UHuskyHusk_AnimBlueprint_C::LowerBodyCurrentWeight' has a wrong offset!");
static_assert(offsetof(UHuskyHusk_AnimBlueprint_C, bShouldUseMovementLocomotion) == 0x00151C, "Member 'UHuskyHusk_AnimBlueprint_C::bShouldUseMovementLocomotion' has a wrong offset!");
static_assert(offsetof(UHuskyHusk_AnimBlueprint_C, FortAIPawnOwner) == 0x001520, "Member 'UHuskyHusk_AnimBlueprint_C::FortAIPawnOwner' has a wrong offset!");

}

#pragma pack(pop)
