#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InGame_Gamemode

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass InGame_Gamemode.InGame_Gamemode_C
// 0x000C (0x03E4 - 0x03D8)
class AInGame_Gamemode_C final : public AFortGameModeEmptyDedicated
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D8(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x03DC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UClass*                                 InGame;                                            // 0x03E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_InGame_Gamemode(int32 EntryPoint);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"InGame_Gamemode_C">();
	}
	static class AInGame_Gamemode_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AInGame_Gamemode_C>();
	}
};
static_assert(alignof(AInGame_Gamemode_C) == 0x000004, "Wrong alignment on AInGame_Gamemode_C");
static_assert(sizeof(AInGame_Gamemode_C) == 0x0003E4, "Wrong size on AInGame_Gamemode_C");
static_assert(offsetof(AInGame_Gamemode_C, UberGraphFrame) == 0x0003D8, "Member 'AInGame_Gamemode_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AInGame_Gamemode_C, DefaultSceneRoot) == 0x0003DC, "Member 'AInGame_Gamemode_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AInGame_Gamemode_C, InGame) == 0x0003E0, "Member 'AInGame_Gamemode_C::InGame' has a wrong offset!");

}

#pragma pack(pop)
