#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InGame_Actor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass InGame_Actor.InGame_Actor_C
// 0x0180 (0x03C0 - 0x0240)
class AInGame_Actor_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0240(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0244(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UClass*                                 GE_AllAbilities;                                   // 0x0248(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UFortItemDefinition*                    HomebaseGadget0;                                   // 0x024C(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FGuid                                  PickaxeGuid;                                       // 0x0250(0x0010)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FGuid                                  WallGuid;                                          // 0x0260(0x0010)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FGuid                                  FloorGuid;                                         // 0x0270(0x0010)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FGuid                                  StairGuid;                                         // 0x0280(0x0010)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FGuid                                  RoofGuid;                                          // 0x0290(0x0010)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FGuid                                  WoodItemGuid;                                      // 0x02A0(0x0010)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FGuid                                  StoneItemGuid;                                     // 0x02B0(0x0010)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FGuid                                  MetalItemGuid;                                     // 0x02C0(0x0010)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UFortItemDefinition*                    HomebaseGadget1;                                   // 0x02D0(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FGuid                                  RangedWeaponGuid;                                  // 0x02D4(0x0010)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FGuid                                  RangedWeapon3Guid;                                 // 0x02E4(0x0010)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FGuid                                  RangedWeapon2Guid;                                 // 0x02F4(0x0010)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class ABuildingPlayerPrimitivePreview*        StairPreviewActor;                                 // 0x0304(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class ABuildingPlayerPrimitivePreview*        WallPreviewActor;                                  // 0x0308(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	TArray<class UClass*>                         Pawns;                                             // 0x030C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class UClass*>                         Actors;                                            // 0x0318(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class FString                                 CurrentLevelName;                                  // 0x0324(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	bool                                          PermaniteMode;                                     // 0x0330(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_331[0x3];                                      // 0x0331(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  TrapGuid;                                          // 0x0334(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FGuid                                  Trap_2_Guid;                                       // 0x0344(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FGuid                                  Trap_3_Guid;                                       // 0x0354(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FGuid                                  Gadget1Guid;                                       // 0x0364(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UObject*                                FuncionalTestActor;                                // 0x0374(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UFortLocalPlayer*                       LocalPlayer;                                       // 0x0378(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	TArray<class UFortItemDefinition*>            TrapItems;                                         // 0x037C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class UFortItemDefinition*>            IngredientsAndConsumableItems;                     // 0x0388(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class UFortItemDefinition*>            AmmoItems;                                         // 0x0394(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class UFortWeaponItemDefinition*>      WeaponItems;                                       // 0x03A0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class UFortInventoryContext*                  InventoryContext;                                  // 0x03AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FGuid                                  Gadget2Guid;                                       // 0x03B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_InGame_Actor(int32 EntryPoint);
	void EquipBuildingWall();
	void EquipBuildingRoof();
	void EquipBuildingFloor();
	void Inventory();
	void SpawnBuildingPreviews();
	void ReceiveBeginPlay();
	void EquipBuildingStair();
	void ReceiveTick(float DeltaSeconds);
	void Spawn_Pickup();
	void UpdateInventory();
	void QuickBars();
	void Add_GameplayEffects();
	void SpawnPlayer();
	void InpActEvt_HotbarKey9_UniqueObjectNameForCooking_93(const struct FKey& Key);
	void InpActEvt_SwitchQuickbar_UniqueObjectNameForCooking_94(const struct FKey& Key);
	void InpActEvt_HotbarKey8_UniqueObjectNameForCooking_95(const struct FKey& Key);
	void InpActEvt_HotbarKeyF7_UniqueObjectNameForCooking_96(const struct FKey& Key);
	void InpActEvt_HotbarKeyF6_UniqueObjectNameForCooking_97(const struct FKey& Key);
	void InpActEvt_HotbarKeyF5_UniqueObjectNameForCooking_98(const struct FKey& Key);
	void InpActEvt_HotbarKeyF4_UniqueObjectNameForCooking_99(const struct FKey& Key);
	void InpActEvt_HotbarKeyF3_UniqueObjectNameForCooking_100(const struct FKey& Key);
	void InpActEvt_HotbarKeyF2_UniqueObjectNameForCooking_101(const struct FKey& Key);
	void InpActEvt_HotbarKeyF1_UniqueObjectNameForCooking_102(const struct FKey& Key);
	void InpActEvt_HotbarKey4_UniqueObjectNameForCooking_130(const struct FKey& Key);
	void InpActEvt_HotbarKey3_UniqueObjectNameForCooking_131(const struct FKey& Key);
	void InpActEvt_HotbarKey2_UniqueObjectNameForCooking_132(const struct FKey& Key);
	void InpActEvt_HotbarKey1_UniqueObjectNameForCooking_133(const struct FKey& Key);
	void UserConstructionScript();
	void AddItemToInventory(class UFortItemDefinition* ItemToAdd, class UFortWorldItem** Item);
	void AddMainItemToInventory(class UFortItemDefinition* ItemToAdd, int32 Count, const struct FGuid& Guid, class UFortWorldItem** Item);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"InGame_Actor_C">();
	}
	static class AInGame_Actor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AInGame_Actor_C>();
	}
};
static_assert(alignof(AInGame_Actor_C) == 0x000004, "Wrong alignment on AInGame_Actor_C");
static_assert(sizeof(AInGame_Actor_C) == 0x0003C0, "Wrong size on AInGame_Actor_C");
static_assert(offsetof(AInGame_Actor_C, UberGraphFrame) == 0x000240, "Member 'AInGame_Actor_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AInGame_Actor_C, DefaultSceneRoot) == 0x000244, "Member 'AInGame_Actor_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AInGame_Actor_C, GE_AllAbilities) == 0x000248, "Member 'AInGame_Actor_C::GE_AllAbilities' has a wrong offset!");
static_assert(offsetof(AInGame_Actor_C, HomebaseGadget0) == 0x00024C, "Member 'AInGame_Actor_C::HomebaseGadget0' has a wrong offset!");
static_assert(offsetof(AInGame_Actor_C, PickaxeGuid) == 0x000250, "Member 'AInGame_Actor_C::PickaxeGuid' has a wrong offset!");
static_assert(offsetof(AInGame_Actor_C, WallGuid) == 0x000260, "Member 'AInGame_Actor_C::WallGuid' has a wrong offset!");
static_assert(offsetof(AInGame_Actor_C, FloorGuid) == 0x000270, "Member 'AInGame_Actor_C::FloorGuid' has a wrong offset!");
static_assert(offsetof(AInGame_Actor_C, StairGuid) == 0x000280, "Member 'AInGame_Actor_C::StairGuid' has a wrong offset!");
static_assert(offsetof(AInGame_Actor_C, RoofGuid) == 0x000290, "Member 'AInGame_Actor_C::RoofGuid' has a wrong offset!");
static_assert(offsetof(AInGame_Actor_C, WoodItemGuid) == 0x0002A0, "Member 'AInGame_Actor_C::WoodItemGuid' has a wrong offset!");
static_assert(offsetof(AInGame_Actor_C, StoneItemGuid) == 0x0002B0, "Member 'AInGame_Actor_C::StoneItemGuid' has a wrong offset!");
static_assert(offsetof(AInGame_Actor_C, MetalItemGuid) == 0x0002C0, "Member 'AInGame_Actor_C::MetalItemGuid' has a wrong offset!");
static_assert(offsetof(AInGame_Actor_C, HomebaseGadget1) == 0x0002D0, "Member 'AInGame_Actor_C::HomebaseGadget1' has a wrong offset!");
static_assert(offsetof(AInGame_Actor_C, RangedWeaponGuid) == 0x0002D4, "Member 'AInGame_Actor_C::RangedWeaponGuid' has a wrong offset!");
static_assert(offsetof(AInGame_Actor_C, RangedWeapon3Guid) == 0x0002E4, "Member 'AInGame_Actor_C::RangedWeapon3Guid' has a wrong offset!");
static_assert(offsetof(AInGame_Actor_C, RangedWeapon2Guid) == 0x0002F4, "Member 'AInGame_Actor_C::RangedWeapon2Guid' has a wrong offset!");
static_assert(offsetof(AInGame_Actor_C, StairPreviewActor) == 0x000304, "Member 'AInGame_Actor_C::StairPreviewActor' has a wrong offset!");
static_assert(offsetof(AInGame_Actor_C, WallPreviewActor) == 0x000308, "Member 'AInGame_Actor_C::WallPreviewActor' has a wrong offset!");
static_assert(offsetof(AInGame_Actor_C, Pawns) == 0x00030C, "Member 'AInGame_Actor_C::Pawns' has a wrong offset!");
static_assert(offsetof(AInGame_Actor_C, Actors) == 0x000318, "Member 'AInGame_Actor_C::Actors' has a wrong offset!");
static_assert(offsetof(AInGame_Actor_C, CurrentLevelName) == 0x000324, "Member 'AInGame_Actor_C::CurrentLevelName' has a wrong offset!");
static_assert(offsetof(AInGame_Actor_C, PermaniteMode) == 0x000330, "Member 'AInGame_Actor_C::PermaniteMode' has a wrong offset!");
static_assert(offsetof(AInGame_Actor_C, TrapGuid) == 0x000334, "Member 'AInGame_Actor_C::TrapGuid' has a wrong offset!");
static_assert(offsetof(AInGame_Actor_C, Trap_2_Guid) == 0x000344, "Member 'AInGame_Actor_C::Trap_2_Guid' has a wrong offset!");
static_assert(offsetof(AInGame_Actor_C, Trap_3_Guid) == 0x000354, "Member 'AInGame_Actor_C::Trap_3_Guid' has a wrong offset!");
static_assert(offsetof(AInGame_Actor_C, Gadget1Guid) == 0x000364, "Member 'AInGame_Actor_C::Gadget1Guid' has a wrong offset!");
static_assert(offsetof(AInGame_Actor_C, FuncionalTestActor) == 0x000374, "Member 'AInGame_Actor_C::FuncionalTestActor' has a wrong offset!");
static_assert(offsetof(AInGame_Actor_C, LocalPlayer) == 0x000378, "Member 'AInGame_Actor_C::LocalPlayer' has a wrong offset!");
static_assert(offsetof(AInGame_Actor_C, TrapItems) == 0x00037C, "Member 'AInGame_Actor_C::TrapItems' has a wrong offset!");
static_assert(offsetof(AInGame_Actor_C, IngredientsAndConsumableItems) == 0x000388, "Member 'AInGame_Actor_C::IngredientsAndConsumableItems' has a wrong offset!");
static_assert(offsetof(AInGame_Actor_C, AmmoItems) == 0x000394, "Member 'AInGame_Actor_C::AmmoItems' has a wrong offset!");
static_assert(offsetof(AInGame_Actor_C, WeaponItems) == 0x0003A0, "Member 'AInGame_Actor_C::WeaponItems' has a wrong offset!");
static_assert(offsetof(AInGame_Actor_C, InventoryContext) == 0x0003AC, "Member 'AInGame_Actor_C::InventoryContext' has a wrong offset!");
static_assert(offsetof(AInGame_Actor_C, Gadget2Guid) == 0x0003B0, "Member 'AInGame_Actor_C::Gadget2Guid' has a wrong offset!");

}

#pragma pack(pop)
