#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LightningLSystem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass LightningLSystem.LightningLsystem_C
// 0x0170 (0x03B0 - 0x0240)
class ALightningLsystem_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0240(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class UBillboardComponent*                    Base;                                              // 0x0244(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	float                                         Animate_death_and_flash_Dissolve_524F475941E97676DC00B1B517E8B863; // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         Animate_death_and_flash_hotPointIntensity_524F475941E97676DC00B1B517E8B863; // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         Animate_death_and_flash_UnfurlAnimation_524F475941E97676DC00B1B517E8B863; // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         Animate_death_and_flash_HotPointAnimation_524F475941E97676DC00B1B517E8B863; // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         Animate_death_and_flash_Lightning_flash_524F475941E97676DC00B1B517E8B863; // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ETimelineDirection                            Animate_death_and_flash__Direction_524F475941E97676DC00B1B517E8B863; // 0x025C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25D[0x3];                                      // 0x025D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Animate_death_and_flash;                           // 0x0260(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<struct FVector>                        ArrayOfPointsToHit;                                // 0x0264(0x000C)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn)
	TArray<class UMaterialInstanceDynamic*>       Parent_Bolts_MID_Array;                            // 0x0270(0x000C)(Edit, BlueprintVisible, ZeroConstructor)
	TArray<class UStaticMeshComponent*>           MainLightningBoltMeshArray;                        // 0x027C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<float>                                 ArrayOfVectorLengthsIndividualSections_MeshLength; // 0x0288(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class UPointLightComponent*>           LightArray;                                        // 0x0294(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FVector>                        DirectionVectorOfPointToNextPoint_LastVector_0;    // 0x02A0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<float>                                 PercentageAlongPathAsSampledAtTheEndOfTheMesh_MeshLength; // 0x02AC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	float                                         PercentageChanceOfLightningBranch;                 // 0x02B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	TArray<struct FVector>                        ArrayOfSplinePoints;                               // 0x02BC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	struct FVector                                MacroVectorTowardGoal;                             // 0x02C8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                MacroChildDirection;                               // 0x02D4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	int32                                         MaxNumberOfChildBolts;                             // 0x02E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	float                                         MaxChildLengthSizeAsPercentageOfRemainingParentBolt; // 0x02E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	float                                         MinChildLengthSizeAsPercentageOfRemainingParentBolt; // 0x02E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	struct FVector                                ChildTargetDestination;                            // 0x02EC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                ChildStartingPoint;                                // 0x02F8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         MaxChildBoltLength;                                // 0x0304(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         MinChildBoltLength;                                // 0x0308(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	TArray<struct FVector>                        ArrayOfChildLightningBoltPositions;                // 0x030C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	float                                         LinearMacroDistanceAccum;                          // 0x0318(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	TArray<float>                                 ArrayOfVectorLengthsUpToThisPointSampledAtTheStart_MeshLength; // 0x031C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	float                                         PerBoltRandomOffset;                               // 0x0328(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	int32                                         TempRecursiveCounter;                              // 0x032C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          IsChildBolt;                                       // 0x0330(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_331[0x3];                                      // 0x0331(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ParentPathSpawnPointPercentage_MeshLength;         // 0x0334(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	class UMaterialInstanceDynamic*               EnemyMID;                                          // 0x0338(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	int32                                         Number_of_child_branches;                          // 0x033C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UStaticMesh*                            Lightning_Bolt_Staticmesh;                         // 0x0340(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         Child_Percentage_Chance_Of_Lightning_branch;       // 0x0344(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	TArray<float>                                 ArrayOfVectorLengthsUpToThisPointSampledAtTheEnd_MeshLength; // 0x0348(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<float>                                 PercentageAlongPathAsSampledAtTheStartOfTheMesh_MeshLength; // 0x0354(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	float                                         ChildVectorNormalVectorAmountRand_Low;             // 0x0360(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         ChildVectorNormalVectorAmountRand_High;            // 0x0364(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         ChildVectorRandomContribution_low;                 // 0x0368(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         ChildVectorRandomContribution_High;                // 0x036C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FLinearColor                           Color_0;                                           // 0x0370(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	float                                         ChildLightningEndPointDivergencePercentage;        // 0x0380(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         TimelinePlayRate;                                  // 0x0384(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	float                                         LightningFlashAnimation;                           // 0x0388(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         MaximumLightningBoltWidth;                         // 0x038C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	float                                         ImpactParticleScale;                               // 0x0390(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	float                                         ChildPathRandomVectorContribution;                 // 0x0394(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	class UMaterialInterface*                     Material;                                          // 0x0398(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          SpawnLights;                                       // 0x039C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          Animate;                                           // 0x039D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          Spawn_Impact_Particle_System;                      // 0x039E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_39F[0x1];                                      // 0x039F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        Lightning_Impact_Particle_system;                  // 0x03A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	class AActor*                                 Actor_to_Notify_of_Completion;                     // 0x03A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	float                                         Lightning_bolt_distortion_Multiplier;              // 0x03A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          Only_return_tier_1_meshes;                         // 0x03AC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          TwodRTT_;                                          // 0x03AD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          NewVar;                                            // 0x03AE(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_LightningLsystem(int32 EntryPoint);
	void ReceiveBeginPlay();
	void Animate_death_and_flash__Fire_off_impact_effect__EventFunc();
	void Animate_death_and_flash__UpdateFunc();
	void Animate_death_and_flash__FinishedFunc();
	void UserConstructionScript();
	void MultiplyParametersByFloat(class UMaterialInstanceDynamic* Mid, class FName param_name);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LightningLsystem_C">();
	}
	static class ALightningLsystem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALightningLsystem_C>();
	}
};
static_assert(alignof(ALightningLsystem_C) == 0x000004, "Wrong alignment on ALightningLsystem_C");
static_assert(sizeof(ALightningLsystem_C) == 0x0003B0, "Wrong size on ALightningLsystem_C");
static_assert(offsetof(ALightningLsystem_C, UberGraphFrame) == 0x000240, "Member 'ALightningLsystem_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ALightningLsystem_C, Base) == 0x000244, "Member 'ALightningLsystem_C::Base' has a wrong offset!");
static_assert(offsetof(ALightningLsystem_C, Animate_death_and_flash_Dissolve_524F475941E97676DC00B1B517E8B863) == 0x000248, "Member 'ALightningLsystem_C::Animate_death_and_flash_Dissolve_524F475941E97676DC00B1B517E8B863' has a wrong offset!");
static_assert(offsetof(ALightningLsystem_C, Animate_death_and_flash_hotPointIntensity_524F475941E97676DC00B1B517E8B863) == 0x00024C, "Member 'ALightningLsystem_C::Animate_death_and_flash_hotPointIntensity_524F475941E97676DC00B1B517E8B863' has a wrong offset!");
static_assert(offsetof(ALightningLsystem_C, Animate_death_and_flash_UnfurlAnimation_524F475941E97676DC00B1B517E8B863) == 0x000250, "Member 'ALightningLsystem_C::Animate_death_and_flash_UnfurlAnimation_524F475941E97676DC00B1B517E8B863' has a wrong offset!");
static_assert(offsetof(ALightningLsystem_C, Animate_death_and_flash_HotPointAnimation_524F475941E97676DC00B1B517E8B863) == 0x000254, "Member 'ALightningLsystem_C::Animate_death_and_flash_HotPointAnimation_524F475941E97676DC00B1B517E8B863' has a wrong offset!");
static_assert(offsetof(ALightningLsystem_C, Animate_death_and_flash_Lightning_flash_524F475941E97676DC00B1B517E8B863) == 0x000258, "Member 'ALightningLsystem_C::Animate_death_and_flash_Lightning_flash_524F475941E97676DC00B1B517E8B863' has a wrong offset!");
static_assert(offsetof(ALightningLsystem_C, Animate_death_and_flash__Direction_524F475941E97676DC00B1B517E8B863) == 0x00025C, "Member 'ALightningLsystem_C::Animate_death_and_flash__Direction_524F475941E97676DC00B1B517E8B863' has a wrong offset!");
static_assert(offsetof(ALightningLsystem_C, Animate_death_and_flash) == 0x000260, "Member 'ALightningLsystem_C::Animate_death_and_flash' has a wrong offset!");
static_assert(offsetof(ALightningLsystem_C, ArrayOfPointsToHit) == 0x000264, "Member 'ALightningLsystem_C::ArrayOfPointsToHit' has a wrong offset!");
static_assert(offsetof(ALightningLsystem_C, Parent_Bolts_MID_Array) == 0x000270, "Member 'ALightningLsystem_C::Parent_Bolts_MID_Array' has a wrong offset!");
static_assert(offsetof(ALightningLsystem_C, MainLightningBoltMeshArray) == 0x00027C, "Member 'ALightningLsystem_C::MainLightningBoltMeshArray' has a wrong offset!");
static_assert(offsetof(ALightningLsystem_C, ArrayOfVectorLengthsIndividualSections_MeshLength) == 0x000288, "Member 'ALightningLsystem_C::ArrayOfVectorLengthsIndividualSections_MeshLength' has a wrong offset!");
static_assert(offsetof(ALightningLsystem_C, LightArray) == 0x000294, "Member 'ALightningLsystem_C::LightArray' has a wrong offset!");
static_assert(offsetof(ALightningLsystem_C, DirectionVectorOfPointToNextPoint_LastVector_0) == 0x0002A0, "Member 'ALightningLsystem_C::DirectionVectorOfPointToNextPoint_LastVector_0' has a wrong offset!");
static_assert(offsetof(ALightningLsystem_C, PercentageAlongPathAsSampledAtTheEndOfTheMesh_MeshLength) == 0x0002AC, "Member 'ALightningLsystem_C::PercentageAlongPathAsSampledAtTheEndOfTheMesh_MeshLength' has a wrong offset!");
static_assert(offsetof(ALightningLsystem_C, PercentageChanceOfLightningBranch) == 0x0002B8, "Member 'ALightningLsystem_C::PercentageChanceOfLightningBranch' has a wrong offset!");
static_assert(offsetof(ALightningLsystem_C, ArrayOfSplinePoints) == 0x0002BC, "Member 'ALightningLsystem_C::ArrayOfSplinePoints' has a wrong offset!");
static_assert(offsetof(ALightningLsystem_C, MacroVectorTowardGoal) == 0x0002C8, "Member 'ALightningLsystem_C::MacroVectorTowardGoal' has a wrong offset!");
static_assert(offsetof(ALightningLsystem_C, MacroChildDirection) == 0x0002D4, "Member 'ALightningLsystem_C::MacroChildDirection' has a wrong offset!");
static_assert(offsetof(ALightningLsystem_C, MaxNumberOfChildBolts) == 0x0002E0, "Member 'ALightningLsystem_C::MaxNumberOfChildBolts' has a wrong offset!");
static_assert(offsetof(ALightningLsystem_C, MaxChildLengthSizeAsPercentageOfRemainingParentBolt) == 0x0002E4, "Member 'ALightningLsystem_C::MaxChildLengthSizeAsPercentageOfRemainingParentBolt' has a wrong offset!");
static_assert(offsetof(ALightningLsystem_C, MinChildLengthSizeAsPercentageOfRemainingParentBolt) == 0x0002E8, "Member 'ALightningLsystem_C::MinChildLengthSizeAsPercentageOfRemainingParentBolt' has a wrong offset!");
static_assert(offsetof(ALightningLsystem_C, ChildTargetDestination) == 0x0002EC, "Member 'ALightningLsystem_C::ChildTargetDestination' has a wrong offset!");
static_assert(offsetof(ALightningLsystem_C, ChildStartingPoint) == 0x0002F8, "Member 'ALightningLsystem_C::ChildStartingPoint' has a wrong offset!");
static_assert(offsetof(ALightningLsystem_C, MaxChildBoltLength) == 0x000304, "Member 'ALightningLsystem_C::MaxChildBoltLength' has a wrong offset!");
static_assert(offsetof(ALightningLsystem_C, MinChildBoltLength) == 0x000308, "Member 'ALightningLsystem_C::MinChildBoltLength' has a wrong offset!");
static_assert(offsetof(ALightningLsystem_C, ArrayOfChildLightningBoltPositions) == 0x00030C, "Member 'ALightningLsystem_C::ArrayOfChildLightningBoltPositions' has a wrong offset!");
static_assert(offsetof(ALightningLsystem_C, LinearMacroDistanceAccum) == 0x000318, "Member 'ALightningLsystem_C::LinearMacroDistanceAccum' has a wrong offset!");
static_assert(offsetof(ALightningLsystem_C, ArrayOfVectorLengthsUpToThisPointSampledAtTheStart_MeshLength) == 0x00031C, "Member 'ALightningLsystem_C::ArrayOfVectorLengthsUpToThisPointSampledAtTheStart_MeshLength' has a wrong offset!");
static_assert(offsetof(ALightningLsystem_C, PerBoltRandomOffset) == 0x000328, "Member 'ALightningLsystem_C::PerBoltRandomOffset' has a wrong offset!");
static_assert(offsetof(ALightningLsystem_C, TempRecursiveCounter) == 0x00032C, "Member 'ALightningLsystem_C::TempRecursiveCounter' has a wrong offset!");
static_assert(offsetof(ALightningLsystem_C, IsChildBolt) == 0x000330, "Member 'ALightningLsystem_C::IsChildBolt' has a wrong offset!");
static_assert(offsetof(ALightningLsystem_C, ParentPathSpawnPointPercentage_MeshLength) == 0x000334, "Member 'ALightningLsystem_C::ParentPathSpawnPointPercentage_MeshLength' has a wrong offset!");
static_assert(offsetof(ALightningLsystem_C, EnemyMID) == 0x000338, "Member 'ALightningLsystem_C::EnemyMID' has a wrong offset!");
static_assert(offsetof(ALightningLsystem_C, Number_of_child_branches) == 0x00033C, "Member 'ALightningLsystem_C::Number_of_child_branches' has a wrong offset!");
static_assert(offsetof(ALightningLsystem_C, Lightning_Bolt_Staticmesh) == 0x000340, "Member 'ALightningLsystem_C::Lightning_Bolt_Staticmesh' has a wrong offset!");
static_assert(offsetof(ALightningLsystem_C, Child_Percentage_Chance_Of_Lightning_branch) == 0x000344, "Member 'ALightningLsystem_C::Child_Percentage_Chance_Of_Lightning_branch' has a wrong offset!");
static_assert(offsetof(ALightningLsystem_C, ArrayOfVectorLengthsUpToThisPointSampledAtTheEnd_MeshLength) == 0x000348, "Member 'ALightningLsystem_C::ArrayOfVectorLengthsUpToThisPointSampledAtTheEnd_MeshLength' has a wrong offset!");
static_assert(offsetof(ALightningLsystem_C, PercentageAlongPathAsSampledAtTheStartOfTheMesh_MeshLength) == 0x000354, "Member 'ALightningLsystem_C::PercentageAlongPathAsSampledAtTheStartOfTheMesh_MeshLength' has a wrong offset!");
static_assert(offsetof(ALightningLsystem_C, ChildVectorNormalVectorAmountRand_Low) == 0x000360, "Member 'ALightningLsystem_C::ChildVectorNormalVectorAmountRand_Low' has a wrong offset!");
static_assert(offsetof(ALightningLsystem_C, ChildVectorNormalVectorAmountRand_High) == 0x000364, "Member 'ALightningLsystem_C::ChildVectorNormalVectorAmountRand_High' has a wrong offset!");
static_assert(offsetof(ALightningLsystem_C, ChildVectorRandomContribution_low) == 0x000368, "Member 'ALightningLsystem_C::ChildVectorRandomContribution_low' has a wrong offset!");
static_assert(offsetof(ALightningLsystem_C, ChildVectorRandomContribution_High) == 0x00036C, "Member 'ALightningLsystem_C::ChildVectorRandomContribution_High' has a wrong offset!");
static_assert(offsetof(ALightningLsystem_C, Color_0) == 0x000370, "Member 'ALightningLsystem_C::Color_0' has a wrong offset!");
static_assert(offsetof(ALightningLsystem_C, ChildLightningEndPointDivergencePercentage) == 0x000380, "Member 'ALightningLsystem_C::ChildLightningEndPointDivergencePercentage' has a wrong offset!");
static_assert(offsetof(ALightningLsystem_C, TimelinePlayRate) == 0x000384, "Member 'ALightningLsystem_C::TimelinePlayRate' has a wrong offset!");
static_assert(offsetof(ALightningLsystem_C, LightningFlashAnimation) == 0x000388, "Member 'ALightningLsystem_C::LightningFlashAnimation' has a wrong offset!");
static_assert(offsetof(ALightningLsystem_C, MaximumLightningBoltWidth) == 0x00038C, "Member 'ALightningLsystem_C::MaximumLightningBoltWidth' has a wrong offset!");
static_assert(offsetof(ALightningLsystem_C, ImpactParticleScale) == 0x000390, "Member 'ALightningLsystem_C::ImpactParticleScale' has a wrong offset!");
static_assert(offsetof(ALightningLsystem_C, ChildPathRandomVectorContribution) == 0x000394, "Member 'ALightningLsystem_C::ChildPathRandomVectorContribution' has a wrong offset!");
static_assert(offsetof(ALightningLsystem_C, Material) == 0x000398, "Member 'ALightningLsystem_C::Material' has a wrong offset!");
static_assert(offsetof(ALightningLsystem_C, SpawnLights) == 0x00039C, "Member 'ALightningLsystem_C::SpawnLights' has a wrong offset!");
static_assert(offsetof(ALightningLsystem_C, Animate) == 0x00039D, "Member 'ALightningLsystem_C::Animate' has a wrong offset!");
static_assert(offsetof(ALightningLsystem_C, Spawn_Impact_Particle_System) == 0x00039E, "Member 'ALightningLsystem_C::Spawn_Impact_Particle_System' has a wrong offset!");
static_assert(offsetof(ALightningLsystem_C, Lightning_Impact_Particle_system) == 0x0003A0, "Member 'ALightningLsystem_C::Lightning_Impact_Particle_system' has a wrong offset!");
static_assert(offsetof(ALightningLsystem_C, Actor_to_Notify_of_Completion) == 0x0003A4, "Member 'ALightningLsystem_C::Actor_to_Notify_of_Completion' has a wrong offset!");
static_assert(offsetof(ALightningLsystem_C, Lightning_bolt_distortion_Multiplier) == 0x0003A8, "Member 'ALightningLsystem_C::Lightning_bolt_distortion_Multiplier' has a wrong offset!");
static_assert(offsetof(ALightningLsystem_C, Only_return_tier_1_meshes) == 0x0003AC, "Member 'ALightningLsystem_C::Only_return_tier_1_meshes' has a wrong offset!");
static_assert(offsetof(ALightningLsystem_C, TwodRTT_) == 0x0003AD, "Member 'ALightningLsystem_C::TwodRTT_' has a wrong offset!");
static_assert(offsetof(ALightningLsystem_C, NewVar) == 0x0003AE, "Member 'ALightningLsystem_C::NewVar' has a wrong offset!");

}

#pragma pack(pop)
