#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Mailbox_03b

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function Mailbox_03b.Mailbox_03b_C.ExecuteUbergraph_Mailbox_03b
// 0x0188 (0x0188 - 0x0000)
struct Mailbox_03b_C_ExecuteUbergraph_Mailbox_03b final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_Damage;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  K2Node_Event_DamageTags;                           // 0x0008(0x0018)(ConstParm)
	struct FVector                                K2Node_Event_Momentum;                             // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             K2Node_Event_HitInfo;                              // 0x002C(0x0080)(ConstParm, ContainsInstancedReference)
	class AFortPawn*                              K2Node_Event_InstigatedBy;                         // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext;                        // 0x00B4(0x000C)()
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_Damage2;                              // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  K2Node_Event_DamageTags2;                          // 0x00D0(0x0018)(ConstParm)
	struct FVector                                K2Node_Event_Momentum2;                            // 0x00E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             K2Node_Event_HitInfo2;                             // 0x00F4(0x0080)(ConstParm, ContainsInstancedReference)
	class AFortPawn*                              K2Node_Event_InstigatedBy2;                        // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_Event_DamageCauser2;                        // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext2;                       // 0x017C(0x000C)()
};
static_assert(alignof(Mailbox_03b_C_ExecuteUbergraph_Mailbox_03b) == 0x000004, "Wrong alignment on Mailbox_03b_C_ExecuteUbergraph_Mailbox_03b");
static_assert(sizeof(Mailbox_03b_C_ExecuteUbergraph_Mailbox_03b) == 0x000188, "Wrong size on Mailbox_03b_C_ExecuteUbergraph_Mailbox_03b");
static_assert(offsetof(Mailbox_03b_C_ExecuteUbergraph_Mailbox_03b, EntryPoint) == 0x000000, "Member 'Mailbox_03b_C_ExecuteUbergraph_Mailbox_03b::EntryPoint' has a wrong offset!");
static_assert(offsetof(Mailbox_03b_C_ExecuteUbergraph_Mailbox_03b, K2Node_Event_Damage) == 0x000004, "Member 'Mailbox_03b_C_ExecuteUbergraph_Mailbox_03b::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(Mailbox_03b_C_ExecuteUbergraph_Mailbox_03b, K2Node_Event_DamageTags) == 0x000008, "Member 'Mailbox_03b_C_ExecuteUbergraph_Mailbox_03b::K2Node_Event_DamageTags' has a wrong offset!");
static_assert(offsetof(Mailbox_03b_C_ExecuteUbergraph_Mailbox_03b, K2Node_Event_Momentum) == 0x000020, "Member 'Mailbox_03b_C_ExecuteUbergraph_Mailbox_03b::K2Node_Event_Momentum' has a wrong offset!");
static_assert(offsetof(Mailbox_03b_C_ExecuteUbergraph_Mailbox_03b, K2Node_Event_HitInfo) == 0x00002C, "Member 'Mailbox_03b_C_ExecuteUbergraph_Mailbox_03b::K2Node_Event_HitInfo' has a wrong offset!");
static_assert(offsetof(Mailbox_03b_C_ExecuteUbergraph_Mailbox_03b, K2Node_Event_InstigatedBy) == 0x0000AC, "Member 'Mailbox_03b_C_ExecuteUbergraph_Mailbox_03b::K2Node_Event_InstigatedBy' has a wrong offset!");
static_assert(offsetof(Mailbox_03b_C_ExecuteUbergraph_Mailbox_03b, K2Node_Event_DamageCauser) == 0x0000B0, "Member 'Mailbox_03b_C_ExecuteUbergraph_Mailbox_03b::K2Node_Event_DamageCauser' has a wrong offset!");
static_assert(offsetof(Mailbox_03b_C_ExecuteUbergraph_Mailbox_03b, K2Node_Event_EffectContext) == 0x0000B4, "Member 'Mailbox_03b_C_ExecuteUbergraph_Mailbox_03b::K2Node_Event_EffectContext' has a wrong offset!");
static_assert(offsetof(Mailbox_03b_C_ExecuteUbergraph_Mailbox_03b, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000C0, "Member 'Mailbox_03b_C_ExecuteUbergraph_Mailbox_03b::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mailbox_03b_C_ExecuteUbergraph_Mailbox_03b, K2Node_Event_Damage2) == 0x0000CC, "Member 'Mailbox_03b_C_ExecuteUbergraph_Mailbox_03b::K2Node_Event_Damage2' has a wrong offset!");
static_assert(offsetof(Mailbox_03b_C_ExecuteUbergraph_Mailbox_03b, K2Node_Event_DamageTags2) == 0x0000D0, "Member 'Mailbox_03b_C_ExecuteUbergraph_Mailbox_03b::K2Node_Event_DamageTags2' has a wrong offset!");
static_assert(offsetof(Mailbox_03b_C_ExecuteUbergraph_Mailbox_03b, K2Node_Event_Momentum2) == 0x0000E8, "Member 'Mailbox_03b_C_ExecuteUbergraph_Mailbox_03b::K2Node_Event_Momentum2' has a wrong offset!");
static_assert(offsetof(Mailbox_03b_C_ExecuteUbergraph_Mailbox_03b, K2Node_Event_HitInfo2) == 0x0000F4, "Member 'Mailbox_03b_C_ExecuteUbergraph_Mailbox_03b::K2Node_Event_HitInfo2' has a wrong offset!");
static_assert(offsetof(Mailbox_03b_C_ExecuteUbergraph_Mailbox_03b, K2Node_Event_InstigatedBy2) == 0x000174, "Member 'Mailbox_03b_C_ExecuteUbergraph_Mailbox_03b::K2Node_Event_InstigatedBy2' has a wrong offset!");
static_assert(offsetof(Mailbox_03b_C_ExecuteUbergraph_Mailbox_03b, K2Node_Event_DamageCauser2) == 0x000178, "Member 'Mailbox_03b_C_ExecuteUbergraph_Mailbox_03b::K2Node_Event_DamageCauser2' has a wrong offset!");
static_assert(offsetof(Mailbox_03b_C_ExecuteUbergraph_Mailbox_03b, K2Node_Event_EffectContext2) == 0x00017C, "Member 'Mailbox_03b_C_ExecuteUbergraph_Mailbox_03b::K2Node_Event_EffectContext2' has a wrong offset!");

// Function Mailbox_03b.Mailbox_03b_C.OnDeathPlayEffects
// 0x00BC (0x00BC - 0x0000)
struct Mailbox_03b_C_OnDeathPlayEffects final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  DamageTags;                                        // 0x0004(0x0018)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FVector                                Momentum;                                          // 0x001C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             HitInfo;                                           // 0x0028(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class AFortPawn*                              InstigatedBy;                                      // 0x00A8(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 DamageCauser;                                      // 0x00AC(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x00B0(0x000C)(Parm)
};
static_assert(alignof(Mailbox_03b_C_OnDeathPlayEffects) == 0x000004, "Wrong alignment on Mailbox_03b_C_OnDeathPlayEffects");
static_assert(sizeof(Mailbox_03b_C_OnDeathPlayEffects) == 0x0000BC, "Wrong size on Mailbox_03b_C_OnDeathPlayEffects");
static_assert(offsetof(Mailbox_03b_C_OnDeathPlayEffects, Damage) == 0x000000, "Member 'Mailbox_03b_C_OnDeathPlayEffects::Damage' has a wrong offset!");
static_assert(offsetof(Mailbox_03b_C_OnDeathPlayEffects, DamageTags) == 0x000004, "Member 'Mailbox_03b_C_OnDeathPlayEffects::DamageTags' has a wrong offset!");
static_assert(offsetof(Mailbox_03b_C_OnDeathPlayEffects, Momentum) == 0x00001C, "Member 'Mailbox_03b_C_OnDeathPlayEffects::Momentum' has a wrong offset!");
static_assert(offsetof(Mailbox_03b_C_OnDeathPlayEffects, HitInfo) == 0x000028, "Member 'Mailbox_03b_C_OnDeathPlayEffects::HitInfo' has a wrong offset!");
static_assert(offsetof(Mailbox_03b_C_OnDeathPlayEffects, InstigatedBy) == 0x0000A8, "Member 'Mailbox_03b_C_OnDeathPlayEffects::InstigatedBy' has a wrong offset!");
static_assert(offsetof(Mailbox_03b_C_OnDeathPlayEffects, DamageCauser) == 0x0000AC, "Member 'Mailbox_03b_C_OnDeathPlayEffects::DamageCauser' has a wrong offset!");
static_assert(offsetof(Mailbox_03b_C_OnDeathPlayEffects, EffectContext) == 0x0000B0, "Member 'Mailbox_03b_C_OnDeathPlayEffects::EffectContext' has a wrong offset!");

// Function Mailbox_03b.Mailbox_03b_C.OnDamagePlayEffects
// 0x00BC (0x00BC - 0x0000)
struct Mailbox_03b_C_OnDamagePlayEffects final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  DamageTags;                                        // 0x0004(0x0018)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FVector                                Momentum;                                          // 0x001C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             HitInfo;                                           // 0x0028(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class AFortPawn*                              InstigatedBy;                                      // 0x00A8(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 DamageCauser;                                      // 0x00AC(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x00B0(0x000C)(Parm)
};
static_assert(alignof(Mailbox_03b_C_OnDamagePlayEffects) == 0x000004, "Wrong alignment on Mailbox_03b_C_OnDamagePlayEffects");
static_assert(sizeof(Mailbox_03b_C_OnDamagePlayEffects) == 0x0000BC, "Wrong size on Mailbox_03b_C_OnDamagePlayEffects");
static_assert(offsetof(Mailbox_03b_C_OnDamagePlayEffects, Damage) == 0x000000, "Member 'Mailbox_03b_C_OnDamagePlayEffects::Damage' has a wrong offset!");
static_assert(offsetof(Mailbox_03b_C_OnDamagePlayEffects, DamageTags) == 0x000004, "Member 'Mailbox_03b_C_OnDamagePlayEffects::DamageTags' has a wrong offset!");
static_assert(offsetof(Mailbox_03b_C_OnDamagePlayEffects, Momentum) == 0x00001C, "Member 'Mailbox_03b_C_OnDamagePlayEffects::Momentum' has a wrong offset!");
static_assert(offsetof(Mailbox_03b_C_OnDamagePlayEffects, HitInfo) == 0x000028, "Member 'Mailbox_03b_C_OnDamagePlayEffects::HitInfo' has a wrong offset!");
static_assert(offsetof(Mailbox_03b_C_OnDamagePlayEffects, InstigatedBy) == 0x0000A8, "Member 'Mailbox_03b_C_OnDamagePlayEffects::InstigatedBy' has a wrong offset!");
static_assert(offsetof(Mailbox_03b_C_OnDamagePlayEffects, DamageCauser) == 0x0000AC, "Member 'Mailbox_03b_C_OnDamagePlayEffects::DamageCauser' has a wrong offset!");
static_assert(offsetof(Mailbox_03b_C_OnDamagePlayEffects, EffectContext) == 0x0000B0, "Member 'Mailbox_03b_C_OnDamagePlayEffects::EffectContext' has a wrong offset!");

}

#pragma pack(pop)
