#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Mission_HuskHarvester

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function Mission_HuskHarvester.Mission_HuskHarvester_C.ExecuteUbergraph_Mission_HuskHarvester
// 0x0630 (0x0630 - 0x0000)
struct Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<struct FGameplayTag>                   K2Node_MakeArray_Array;                            // 0x0004(0x000C)(ZeroConstructor, ReferenceParm)
	struct FGameplayTagContainer                  K2Node_MakeStruct_GameplayTagContainer;            // 0x0010(0x0018)()
	TArray<struct FGameplayTagContainer>          K2Node_MakeArray_Array2;                           // 0x0028(0x000C)(ConstParm, ZeroConstructor, ReferenceParm)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_36[0x2];                                       // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0048(0x0004)()
	bool                                          Temp_bool_IsClosed_Variable2;                      // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x004E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable2;                // 0x004F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(class UFortAIEncounterInfo* Encounter)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0050(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x0068(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_SpawnAtPlacementActorsAsArray_bSucceeded; // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_SpawnAtPlacementActorsAsArray_ReturnValue; // 0x007C(0x000C)(ZeroConstructor, ReferenceParm)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue2;         // 0x0088(0x0004)()
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGuid                                  K2Node_HandleMissionEvent_MissionGuid4;            // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  K2Node_HandleMissionEvent_ObjectiveHandle4;        // 0x00A0(0x0018)()
	class UFortMissionEventParams*                K2Node_HandleMissionEvent_Params4;                 // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_HandleMissionEvent_DO_NOT_USE_THIS_OR_VARIABLES_BELOW4; // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_HandleMissionEvent_EventFocus4;             // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	const class UDataAsset*                       K2Node_HandleMissionEvent_EventContent4;           // 0x00C4(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_HandleMissionEvent_EventInstigator4;        // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         K2Node_HandleMissionEvent_GenericInt4;             // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_HandleMissionEvent_GenericFloat4;           // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FText                                   K2Node_HandleMissionEvent_GenericText4;            // 0x00D4(0x000C)(ConstParm)
	struct FGameplayTagContainer                  K2Node_HandleMissionEvent_GameplayTags4;           // 0x00E0(0x0018)()
	struct FFortMissionEvent                      K2Node_HandleMissionEvent_MissionEvent4;           // 0x00F8(0x006C)(ConstParm)
	class AProp_HuskHarvester_C*                  K2Node_DynamicCast_AsProp_Husk_Harvester;          // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x3];                                      // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_MakeArray_Array3;                           // 0x016C(0x000C)(ConstParm, ZeroConstructor, ReferenceParm)
	class UFortAIEncounterInfo*                   CallFunc_StartMissionAIEncounterFromGeneratedProfile_ReturnValue; // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<class AFortPlayerController*>          CallFunc_GetAllFortPlayerControllers_ReturnValue;  // 0x017C(0x000C)(ZeroConstructor, ReferenceParm)
	class AFortPlayerController*                  CallFunc_Array_Get_Item2;                          // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetPawnDamageLootTier_ReturnValue;        // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<struct FGameplayTag>                   K2Node_MakeArray_Array4;                           // 0x0194(0x000C)(ZeroConstructor, ReferenceParm)
	struct FGuid                                  K2Node_HandleMissionEvent_MissionGuid3;            // 0x01A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  K2Node_HandleMissionEvent_ObjectiveHandle3;        // 0x01B0(0x0018)()
	class UFortMissionEventParams*                K2Node_HandleMissionEvent_Params3;                 // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_HandleMissionEvent_DO_NOT_USE_THIS_OR_VARIABLES_BELOW3; // 0x01CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1CD[0x3];                                      // 0x01CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_HandleMissionEvent_EventFocus3;             // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	const class UDataAsset*                       K2Node_HandleMissionEvent_EventContent3;           // 0x01D4(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_HandleMissionEvent_EventInstigator3;        // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         K2Node_HandleMissionEvent_GenericInt3;             // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_HandleMissionEvent_GenericFloat3;           // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FText                                   K2Node_HandleMissionEvent_GenericText3;            // 0x01E4(0x000C)(ConstParm)
	struct FGameplayTagContainer                  K2Node_HandleMissionEvent_GameplayTags3;           // 0x01F0(0x0018)()
	struct FFortMissionEvent                      K2Node_HandleMissionEvent_MissionEvent3;           // 0x0208(0x006C)(ConstParm)
	struct FGameplayTagContainer                  K2Node_MakeStruct_GameplayTagContainer2;           // 0x0274(0x0018)()
	TArray<struct FGameplayTagContainer>          K2Node_MakeArray_Array5;                           // 0x028C(0x000C)(ConstParm, ZeroConstructor, ReferenceParm)
	struct FGuid                                  CallFunc_GetMissionGuid_ReturnValue;               // 0x0298(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_Contains_ReturnValue2;              // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A9[0x3];                                      // 0x02A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortBluGloManager*                     CallFunc_GetBluGloManager_ReturnValue;             // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ABluGloManager_C*                       K2Node_DynamicCast_AsBlu_Glo_Manager;              // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x02B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B5[0x3];                                      // 0x02B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  CallFunc_GetMissionGuid_ReturnValue2;              // 0x02B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UFortAIEncounterInfo*                   K2Node_CustomEvent_Encounter;                      // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<struct FGameplayTag>                   K2Node_MakeArray_Array6;                           // 0x02CC(0x000C)(ZeroConstructor, ReferenceParm)
	struct FGameplayTagContainer                  K2Node_MakeStruct_GameplayTagContainer3;           // 0x02D8(0x0018)()
	struct FFortMissionEvent                      K2Node_Event_MissionEvent;                         // 0x02F0(0x006C)(ConstParm)
	TArray<struct FGameplayTagContainer>          K2Node_MakeArray_Array7;                           // 0x035C(0x000C)(ConstParm, ZeroConstructor, ReferenceParm)
	struct FGuid                                  K2Node_HandleMissionEvent_MissionGuid2;            // 0x0368(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  K2Node_HandleMissionEvent_ObjectiveHandle2;        // 0x0378(0x0018)()
	class UFortMissionEventParams*                K2Node_HandleMissionEvent_Params2;                 // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_HandleMissionEvent_DO_NOT_USE_THIS_OR_VARIABLES_BELOW2; // 0x0394(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_395[0x3];                                      // 0x0395(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_HandleMissionEvent_EventFocus2;             // 0x0398(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	const class UDataAsset*                       K2Node_HandleMissionEvent_EventContent2;           // 0x039C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_HandleMissionEvent_EventInstigator2;        // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         K2Node_HandleMissionEvent_GenericInt2;             // 0x03A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_HandleMissionEvent_GenericFloat2;           // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FText                                   K2Node_HandleMissionEvent_GenericText2;            // 0x03AC(0x000C)(ConstParm)
	struct FGameplayTagContainer                  K2Node_HandleMissionEvent_GameplayTags2;           // 0x03B8(0x0018)()
	struct FFortMissionEvent                      K2Node_HandleMissionEvent_MissionEvent2;           // 0x03D0(0x006C)(ConstParm)
	bool                                          CallFunc_Array_Contains_ReturnValue3;              // 0x043C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43D[0x3];                                      // 0x043D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0440(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x044C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue2;         // 0x0458(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_464[0xC];                                      // 0x0464(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_Conv_VectorToTransform_ReturnValue;       // 0x0470(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x04A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ABluGloDummy_C*                         CallFunc_FinishSpawningActor_ReturnValue;          // 0x04A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFortMissionWeightedReward             CallFunc_ChooseRandomReward_ReturnValue;           // 0x04A8(0x0080)()
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue3;         // 0x0528(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue2;            // 0x0534(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0540(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGuid                                  CallFunc_GetMissionGuid_ReturnValue3;              // 0x0544(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0554(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_555[0x3];                                      // 0x0555(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0558(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGuid                                  K2Node_HandleMissionEvent_MissionGuid;             // 0x055C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  K2Node_HandleMissionEvent_ObjectiveHandle;         // 0x056C(0x0018)()
	class UFortMissionEventParams*                K2Node_HandleMissionEvent_Params;                  // 0x0584(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_HandleMissionEvent_DO_NOT_USE_THIS_OR_VARIABLES_BELOW; // 0x0588(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_589[0x3];                                      // 0x0589(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_HandleMissionEvent_EventFocus;              // 0x058C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	const class UDataAsset*                       K2Node_HandleMissionEvent_EventContent;            // 0x0590(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_HandleMissionEvent_EventInstigator;         // 0x0594(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         K2Node_HandleMissionEvent_GenericInt;              // 0x0598(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_HandleMissionEvent_GenericFloat;            // 0x059C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FText                                   K2Node_HandleMissionEvent_GenericText;             // 0x05A0(0x000C)(ConstParm)
	struct FGameplayTagContainer                  K2Node_HandleMissionEvent_GameplayTags;            // 0x05AC(0x0018)()
	struct FFortMissionEvent                      K2Node_HandleMissionEvent_MissionEvent;            // 0x05C4(0x006C)(ConstParm)
};
static_assert(alignof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester) == 0x000010, "Wrong alignment on Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester");
static_assert(sizeof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester) == 0x000630, "Wrong size on Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, EntryPoint) == 0x000000, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::EntryPoint' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, K2Node_MakeArray_Array) == 0x000004, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, K2Node_MakeStruct_GameplayTagContainer) == 0x000010, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::K2Node_MakeStruct_GameplayTagContainer' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, K2Node_MakeArray_Array2) == 0x000028, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::K2Node_MakeArray_Array2' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, Temp_bool_Has_Been_Initd_Variable) == 0x000034, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, Temp_bool_IsClosed_Variable) == 0x000035, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000048, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, Temp_bool_IsClosed_Variable2) == 0x00004C, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::Temp_bool_IsClosed_Variable2' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, CallFunc_Array_Contains_ReturnValue) == 0x00004D, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, CallFunc_IsValid_ReturnValue) == 0x00004E, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, Temp_bool_Has_Been_Initd_Variable2) == 0x00004F, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::Temp_bool_Has_Been_Initd_Variable2' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, K2Node_CreateDelegate_OutputDelegate2) == 0x000050, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable) == 0x000060, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, Temp_int_Array_Index_Variable) == 0x000064, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, K2Node_CreateDelegate_OutputDelegate3) == 0x000068, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, CallFunc_SpawnAtPlacementActorsAsArray_bSucceeded) == 0x000078, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::CallFunc_SpawnAtPlacementActorsAsArray_bSucceeded' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, CallFunc_SpawnAtPlacementActorsAsArray_ReturnValue) == 0x00007C, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::CallFunc_SpawnAtPlacementActorsAsArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, CallFunc_K2_SetTimerDelegate_ReturnValue2) == 0x000088, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::CallFunc_K2_SetTimerDelegate_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, CallFunc_Array_Get_Item) == 0x00008C, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, K2Node_HandleMissionEvent_MissionGuid4) == 0x000090, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::K2Node_HandleMissionEvent_MissionGuid4' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, K2Node_HandleMissionEvent_ObjectiveHandle4) == 0x0000A0, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::K2Node_HandleMissionEvent_ObjectiveHandle4' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, K2Node_HandleMissionEvent_Params4) == 0x0000B8, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::K2Node_HandleMissionEvent_Params4' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, K2Node_HandleMissionEvent_DO_NOT_USE_THIS_OR_VARIABLES_BELOW4) == 0x0000BC, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::K2Node_HandleMissionEvent_DO_NOT_USE_THIS_OR_VARIABLES_BELOW4' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, K2Node_HandleMissionEvent_EventFocus4) == 0x0000C0, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::K2Node_HandleMissionEvent_EventFocus4' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, K2Node_HandleMissionEvent_EventContent4) == 0x0000C4, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::K2Node_HandleMissionEvent_EventContent4' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, K2Node_HandleMissionEvent_EventInstigator4) == 0x0000C8, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::K2Node_HandleMissionEvent_EventInstigator4' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, K2Node_HandleMissionEvent_GenericInt4) == 0x0000CC, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::K2Node_HandleMissionEvent_GenericInt4' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, K2Node_HandleMissionEvent_GenericFloat4) == 0x0000D0, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::K2Node_HandleMissionEvent_GenericFloat4' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, K2Node_HandleMissionEvent_GenericText4) == 0x0000D4, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::K2Node_HandleMissionEvent_GenericText4' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, K2Node_HandleMissionEvent_GameplayTags4) == 0x0000E0, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::K2Node_HandleMissionEvent_GameplayTags4' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, K2Node_HandleMissionEvent_MissionEvent4) == 0x0000F8, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::K2Node_HandleMissionEvent_MissionEvent4' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, K2Node_DynamicCast_AsProp_Husk_Harvester) == 0x000164, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::K2Node_DynamicCast_AsProp_Husk_Harvester' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, K2Node_DynamicCast_bSuccess) == 0x000168, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, K2Node_MakeArray_Array3) == 0x00016C, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::K2Node_MakeArray_Array3' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, CallFunc_StartMissionAIEncounterFromGeneratedProfile_ReturnValue) == 0x000178, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::CallFunc_StartMissionAIEncounterFromGeneratedProfile_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, CallFunc_GetAllFortPlayerControllers_ReturnValue) == 0x00017C, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::CallFunc_GetAllFortPlayerControllers_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, CallFunc_Array_Get_Item2) == 0x000188, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, CallFunc_Array_Length_ReturnValue) == 0x00018C, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, CallFunc_GetPawnDamageLootTier_ReturnValue) == 0x000190, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::CallFunc_GetPawnDamageLootTier_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, K2Node_MakeArray_Array4) == 0x000194, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::K2Node_MakeArray_Array4' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, K2Node_HandleMissionEvent_MissionGuid3) == 0x0001A0, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::K2Node_HandleMissionEvent_MissionGuid3' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, K2Node_HandleMissionEvent_ObjectiveHandle3) == 0x0001B0, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::K2Node_HandleMissionEvent_ObjectiveHandle3' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, K2Node_HandleMissionEvent_Params3) == 0x0001C8, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::K2Node_HandleMissionEvent_Params3' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, K2Node_HandleMissionEvent_DO_NOT_USE_THIS_OR_VARIABLES_BELOW3) == 0x0001CC, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::K2Node_HandleMissionEvent_DO_NOT_USE_THIS_OR_VARIABLES_BELOW3' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, K2Node_HandleMissionEvent_EventFocus3) == 0x0001D0, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::K2Node_HandleMissionEvent_EventFocus3' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, K2Node_HandleMissionEvent_EventContent3) == 0x0001D4, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::K2Node_HandleMissionEvent_EventContent3' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, K2Node_HandleMissionEvent_EventInstigator3) == 0x0001D8, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::K2Node_HandleMissionEvent_EventInstigator3' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, K2Node_HandleMissionEvent_GenericInt3) == 0x0001DC, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::K2Node_HandleMissionEvent_GenericInt3' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, K2Node_HandleMissionEvent_GenericFloat3) == 0x0001E0, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::K2Node_HandleMissionEvent_GenericFloat3' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, K2Node_HandleMissionEvent_GenericText3) == 0x0001E4, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::K2Node_HandleMissionEvent_GenericText3' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, K2Node_HandleMissionEvent_GameplayTags3) == 0x0001F0, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::K2Node_HandleMissionEvent_GameplayTags3' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, K2Node_HandleMissionEvent_MissionEvent3) == 0x000208, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::K2Node_HandleMissionEvent_MissionEvent3' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, K2Node_MakeStruct_GameplayTagContainer2) == 0x000274, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::K2Node_MakeStruct_GameplayTagContainer2' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, K2Node_MakeArray_Array5) == 0x00028C, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::K2Node_MakeArray_Array5' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, CallFunc_GetMissionGuid_ReturnValue) == 0x000298, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::CallFunc_GetMissionGuid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, CallFunc_Array_Contains_ReturnValue2) == 0x0002A8, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::CallFunc_Array_Contains_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, CallFunc_GetBluGloManager_ReturnValue) == 0x0002AC, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::CallFunc_GetBluGloManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, K2Node_DynamicCast_AsBlu_Glo_Manager) == 0x0002B0, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::K2Node_DynamicCast_AsBlu_Glo_Manager' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, K2Node_DynamicCast_bSuccess2) == 0x0002B4, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, CallFunc_GetMissionGuid_ReturnValue2) == 0x0002B8, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::CallFunc_GetMissionGuid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, K2Node_CustomEvent_Encounter) == 0x0002C8, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::K2Node_CustomEvent_Encounter' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, K2Node_MakeArray_Array6) == 0x0002CC, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::K2Node_MakeArray_Array6' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, K2Node_MakeStruct_GameplayTagContainer3) == 0x0002D8, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::K2Node_MakeStruct_GameplayTagContainer3' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, K2Node_Event_MissionEvent) == 0x0002F0, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::K2Node_Event_MissionEvent' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, K2Node_MakeArray_Array7) == 0x00035C, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::K2Node_MakeArray_Array7' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, K2Node_HandleMissionEvent_MissionGuid2) == 0x000368, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::K2Node_HandleMissionEvent_MissionGuid2' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, K2Node_HandleMissionEvent_ObjectiveHandle2) == 0x000378, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::K2Node_HandleMissionEvent_ObjectiveHandle2' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, K2Node_HandleMissionEvent_Params2) == 0x000390, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::K2Node_HandleMissionEvent_Params2' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, K2Node_HandleMissionEvent_DO_NOT_USE_THIS_OR_VARIABLES_BELOW2) == 0x000394, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::K2Node_HandleMissionEvent_DO_NOT_USE_THIS_OR_VARIABLES_BELOW2' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, K2Node_HandleMissionEvent_EventFocus2) == 0x000398, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::K2Node_HandleMissionEvent_EventFocus2' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, K2Node_HandleMissionEvent_EventContent2) == 0x00039C, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::K2Node_HandleMissionEvent_EventContent2' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, K2Node_HandleMissionEvent_EventInstigator2) == 0x0003A0, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::K2Node_HandleMissionEvent_EventInstigator2' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, K2Node_HandleMissionEvent_GenericInt2) == 0x0003A4, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::K2Node_HandleMissionEvent_GenericInt2' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, K2Node_HandleMissionEvent_GenericFloat2) == 0x0003A8, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::K2Node_HandleMissionEvent_GenericFloat2' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, K2Node_HandleMissionEvent_GenericText2) == 0x0003AC, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::K2Node_HandleMissionEvent_GenericText2' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, K2Node_HandleMissionEvent_GameplayTags2) == 0x0003B8, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::K2Node_HandleMissionEvent_GameplayTags2' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, K2Node_HandleMissionEvent_MissionEvent2) == 0x0003D0, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::K2Node_HandleMissionEvent_MissionEvent2' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, CallFunc_Array_Contains_ReturnValue3) == 0x00043C, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::CallFunc_Array_Contains_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000440, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, CallFunc_Add_VectorVector_ReturnValue) == 0x00044C, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, CallFunc_K2_GetActorLocation_ReturnValue2) == 0x000458, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::CallFunc_K2_GetActorLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, CallFunc_Conv_VectorToTransform_ReturnValue) == 0x000470, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::CallFunc_Conv_VectorToTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0004A0, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, CallFunc_FinishSpawningActor_ReturnValue) == 0x0004A4, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, CallFunc_ChooseRandomReward_ReturnValue) == 0x0004A8, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::CallFunc_ChooseRandomReward_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, CallFunc_K2_GetActorLocation_ReturnValue3) == 0x000528, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::CallFunc_K2_GetActorLocation_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, CallFunc_Add_VectorVector_ReturnValue2) == 0x000534, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::CallFunc_Add_VectorVector_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, Temp_int_Loop_Counter_Variable) == 0x000540, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, CallFunc_GetMissionGuid_ReturnValue3) == 0x000544, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::CallFunc_GetMissionGuid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, CallFunc_Less_IntInt_ReturnValue) == 0x000554, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, CallFunc_Add_IntInt_ReturnValue) == 0x000558, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, K2Node_HandleMissionEvent_MissionGuid) == 0x00055C, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::K2Node_HandleMissionEvent_MissionGuid' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, K2Node_HandleMissionEvent_ObjectiveHandle) == 0x00056C, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::K2Node_HandleMissionEvent_ObjectiveHandle' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, K2Node_HandleMissionEvent_Params) == 0x000584, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::K2Node_HandleMissionEvent_Params' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, K2Node_HandleMissionEvent_DO_NOT_USE_THIS_OR_VARIABLES_BELOW) == 0x000588, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::K2Node_HandleMissionEvent_DO_NOT_USE_THIS_OR_VARIABLES_BELOW' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, K2Node_HandleMissionEvent_EventFocus) == 0x00058C, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::K2Node_HandleMissionEvent_EventFocus' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, K2Node_HandleMissionEvent_EventContent) == 0x000590, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::K2Node_HandleMissionEvent_EventContent' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, K2Node_HandleMissionEvent_EventInstigator) == 0x000594, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::K2Node_HandleMissionEvent_EventInstigator' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, K2Node_HandleMissionEvent_GenericInt) == 0x000598, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::K2Node_HandleMissionEvent_GenericInt' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, K2Node_HandleMissionEvent_GenericFloat) == 0x00059C, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::K2Node_HandleMissionEvent_GenericFloat' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, K2Node_HandleMissionEvent_GenericText) == 0x0005A0, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::K2Node_HandleMissionEvent_GenericText' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, K2Node_HandleMissionEvent_GameplayTags) == 0x0005AC, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::K2Node_HandleMissionEvent_GameplayTags' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester, K2Node_HandleMissionEvent_MissionEvent) == 0x0005C4, "Member 'Mission_HuskHarvester_C_ExecuteUbergraph_Mission_HuskHarvester::K2Node_HandleMissionEvent_MissionEvent' has a wrong offset!");

// Function Mission_HuskHarvester.Mission_HuskHarvester_C.HandleMissionEvent_PlayersNotNearMachine
// 0x00D4 (0x00D4 - 0x0000)
struct Mission_HuskHarvester_C_HandleMissionEvent_PlayersNotNearMachine final
{
public:
	struct FGuid                                  MissionGuid_0;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  ObjectiveHandle;                                   // 0x0010(0x0018)(Parm)
	class UFortMissionEventParams*                Params_0;                                          // 0x0028(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          DO_NOT_USE_THIS_OR_VARIABLES_BELOW;                // 0x002C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                EventFocus;                                        // 0x0030(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	const class UDataAsset*                       EventContent;                                      // 0x0034(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 EventInstigator;                                   // 0x0038(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         GenericInt;                                        // 0x003C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         GenericFloat;                                      // 0x0040(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class FText                                   GenericText;                                       // 0x0044(0x000C)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FGameplayTagContainer                  GameplayTags;                                      // 0x0050(0x0018)(Parm)
	struct FFortMissionEvent                      MissionEvent;                                      // 0x0068(0x006C)(ConstParm, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(Mission_HuskHarvester_C_HandleMissionEvent_PlayersNotNearMachine) == 0x000004, "Wrong alignment on Mission_HuskHarvester_C_HandleMissionEvent_PlayersNotNearMachine");
static_assert(sizeof(Mission_HuskHarvester_C_HandleMissionEvent_PlayersNotNearMachine) == 0x0000D4, "Wrong size on Mission_HuskHarvester_C_HandleMissionEvent_PlayersNotNearMachine");
static_assert(offsetof(Mission_HuskHarvester_C_HandleMissionEvent_PlayersNotNearMachine, MissionGuid_0) == 0x000000, "Member 'Mission_HuskHarvester_C_HandleMissionEvent_PlayersNotNearMachine::MissionGuid_0' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_HandleMissionEvent_PlayersNotNearMachine, ObjectiveHandle) == 0x000010, "Member 'Mission_HuskHarvester_C_HandleMissionEvent_PlayersNotNearMachine::ObjectiveHandle' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_HandleMissionEvent_PlayersNotNearMachine, Params_0) == 0x000028, "Member 'Mission_HuskHarvester_C_HandleMissionEvent_PlayersNotNearMachine::Params_0' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_HandleMissionEvent_PlayersNotNearMachine, DO_NOT_USE_THIS_OR_VARIABLES_BELOW) == 0x00002C, "Member 'Mission_HuskHarvester_C_HandleMissionEvent_PlayersNotNearMachine::DO_NOT_USE_THIS_OR_VARIABLES_BELOW' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_HandleMissionEvent_PlayersNotNearMachine, EventFocus) == 0x000030, "Member 'Mission_HuskHarvester_C_HandleMissionEvent_PlayersNotNearMachine::EventFocus' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_HandleMissionEvent_PlayersNotNearMachine, EventContent) == 0x000034, "Member 'Mission_HuskHarvester_C_HandleMissionEvent_PlayersNotNearMachine::EventContent' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_HandleMissionEvent_PlayersNotNearMachine, EventInstigator) == 0x000038, "Member 'Mission_HuskHarvester_C_HandleMissionEvent_PlayersNotNearMachine::EventInstigator' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_HandleMissionEvent_PlayersNotNearMachine, GenericInt) == 0x00003C, "Member 'Mission_HuskHarvester_C_HandleMissionEvent_PlayersNotNearMachine::GenericInt' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_HandleMissionEvent_PlayersNotNearMachine, GenericFloat) == 0x000040, "Member 'Mission_HuskHarvester_C_HandleMissionEvent_PlayersNotNearMachine::GenericFloat' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_HandleMissionEvent_PlayersNotNearMachine, GenericText) == 0x000044, "Member 'Mission_HuskHarvester_C_HandleMissionEvent_PlayersNotNearMachine::GenericText' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_HandleMissionEvent_PlayersNotNearMachine, GameplayTags) == 0x000050, "Member 'Mission_HuskHarvester_C_HandleMissionEvent_PlayersNotNearMachine::GameplayTags' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_HandleMissionEvent_PlayersNotNearMachine, MissionEvent) == 0x000068, "Member 'Mission_HuskHarvester_C_HandleMissionEvent_PlayersNotNearMachine::MissionEvent' has a wrong offset!");

// Function Mission_HuskHarvester.Mission_HuskHarvester_C.HandleMissionEvent_BluGloSpawner
// 0x00D4 (0x00D4 - 0x0000)
struct Mission_HuskHarvester_C_HandleMissionEvent_BluGloSpawner final
{
public:
	struct FGuid                                  MissionGuid_0;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  ObjectiveHandle;                                   // 0x0010(0x0018)(Parm)
	class UFortMissionEventParams*                Params_0;                                          // 0x0028(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          DO_NOT_USE_THIS_OR_VARIABLES_BELOW;                // 0x002C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                EventFocus;                                        // 0x0030(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	const class UDataAsset*                       EventContent;                                      // 0x0034(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 EventInstigator;                                   // 0x0038(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         GenericInt;                                        // 0x003C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         GenericFloat;                                      // 0x0040(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class FText                                   GenericText;                                       // 0x0044(0x000C)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FGameplayTagContainer                  GameplayTags;                                      // 0x0050(0x0018)(Parm)
	struct FFortMissionEvent                      MissionEvent;                                      // 0x0068(0x006C)(ConstParm, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(Mission_HuskHarvester_C_HandleMissionEvent_BluGloSpawner) == 0x000004, "Wrong alignment on Mission_HuskHarvester_C_HandleMissionEvent_BluGloSpawner");
static_assert(sizeof(Mission_HuskHarvester_C_HandleMissionEvent_BluGloSpawner) == 0x0000D4, "Wrong size on Mission_HuskHarvester_C_HandleMissionEvent_BluGloSpawner");
static_assert(offsetof(Mission_HuskHarvester_C_HandleMissionEvent_BluGloSpawner, MissionGuid_0) == 0x000000, "Member 'Mission_HuskHarvester_C_HandleMissionEvent_BluGloSpawner::MissionGuid_0' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_HandleMissionEvent_BluGloSpawner, ObjectiveHandle) == 0x000010, "Member 'Mission_HuskHarvester_C_HandleMissionEvent_BluGloSpawner::ObjectiveHandle' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_HandleMissionEvent_BluGloSpawner, Params_0) == 0x000028, "Member 'Mission_HuskHarvester_C_HandleMissionEvent_BluGloSpawner::Params_0' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_HandleMissionEvent_BluGloSpawner, DO_NOT_USE_THIS_OR_VARIABLES_BELOW) == 0x00002C, "Member 'Mission_HuskHarvester_C_HandleMissionEvent_BluGloSpawner::DO_NOT_USE_THIS_OR_VARIABLES_BELOW' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_HandleMissionEvent_BluGloSpawner, EventFocus) == 0x000030, "Member 'Mission_HuskHarvester_C_HandleMissionEvent_BluGloSpawner::EventFocus' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_HandleMissionEvent_BluGloSpawner, EventContent) == 0x000034, "Member 'Mission_HuskHarvester_C_HandleMissionEvent_BluGloSpawner::EventContent' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_HandleMissionEvent_BluGloSpawner, EventInstigator) == 0x000038, "Member 'Mission_HuskHarvester_C_HandleMissionEvent_BluGloSpawner::EventInstigator' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_HandleMissionEvent_BluGloSpawner, GenericInt) == 0x00003C, "Member 'Mission_HuskHarvester_C_HandleMissionEvent_BluGloSpawner::GenericInt' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_HandleMissionEvent_BluGloSpawner, GenericFloat) == 0x000040, "Member 'Mission_HuskHarvester_C_HandleMissionEvent_BluGloSpawner::GenericFloat' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_HandleMissionEvent_BluGloSpawner, GenericText) == 0x000044, "Member 'Mission_HuskHarvester_C_HandleMissionEvent_BluGloSpawner::GenericText' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_HandleMissionEvent_BluGloSpawner, GameplayTags) == 0x000050, "Member 'Mission_HuskHarvester_C_HandleMissionEvent_BluGloSpawner::GameplayTags' has a wrong offset!");
static_assert(offsetof(Mission_HuskHarvester_C_HandleMissionEvent_BluGloSpawner, MissionEvent) == 0x000068, "Member 'Mission_HuskHarvester_C_HandleMissionEvent_BluGloSpawner::MissionEvent' has a wrong offset!");

// Function Mission_HuskHarvester.Mission_HuskHarvester_C.BlueprintOnActivated
// 0x006C (0x006C - 0x0000)
struct Mission_HuskHarvester_C_BlueprintOnActivated final
{
public:
	struct FFortMissionEvent                      MissionEvent;                                      // 0x0000(0x006C)(ConstParm, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(Mission_HuskHarvester_C_BlueprintOnActivated) == 0x000004, "Wrong alignment on Mission_HuskHarvester_C_BlueprintOnActivated");
static_assert(sizeof(Mission_HuskHarvester_C_BlueprintOnActivated) == 0x00006C, "Wrong size on Mission_HuskHarvester_C_BlueprintOnActivated");
static_assert(offsetof(Mission_HuskHarvester_C_BlueprintOnActivated, MissionEvent) == 0x000000, "Member 'Mission_HuskHarvester_C_BlueprintOnActivated::MissionEvent' has a wrong offset!");

// Function Mission_HuskHarvester.Mission_HuskHarvester_C.allenemieskilled
// 0x0004 (0x0004 - 0x0000)
struct Mission_HuskHarvester_C_allenemieskilled final
{
public:
	class UFortAIEncounterInfo*                   Encounter;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Mission_HuskHarvester_C_allenemieskilled) == 0x000004, "Wrong alignment on Mission_HuskHarvester_C_allenemieskilled");
static_assert(sizeof(Mission_HuskHarvester_C_allenemieskilled) == 0x000004, "Wrong size on Mission_HuskHarvester_C_allenemieskilled");
static_assert(offsetof(Mission_HuskHarvester_C_allenemieskilled, Encounter) == 0x000000, "Member 'Mission_HuskHarvester_C_allenemieskilled::Encounter' has a wrong offset!");

// Function Mission_HuskHarvester.Mission_HuskHarvester_C.HandleMissionEvent_SpawnBluGlo
// 0x00D4 (0x00D4 - 0x0000)
