#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: mToD_FoundMix

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ENUM_Resource_JT_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass mToD_FoundMix.mToD_FoundMix_C
// 0x00AC (0x02EC - 0x0240)
class AmToD_FoundMix_C final : public AFortClientOnlyActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0240(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          TriggerRange;                                      // 0x0244(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UAudioComponent*                        AmbientMix_B;                                      // 0x0248(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UAudioComponent*                        AmbientMix_A;                                      // 0x024C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class USceneComponent*                        Scene1;                                            // 0x0250(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	ENUM_Resource_JT                              Attenuation_Shape;                                 // 0x0254(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	ESoundDistanceModel                           distance_algorithm;                                // 0x0255(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_256[0x2];                                      // 0x0256(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Falloff_Range;                                     // 0x0258(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class USoundBase*                             Day_Mix_Sound;                                     // 0x025C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class USoundBase*                             Morning_Mix_Sound;                                 // 0x0260(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class USoundBase*                             Evening_Mix_Sound;                                 // 0x0264(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class USoundBase*                             Night_Mix_Sound;                                   // 0x0268(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         RandomSound_MaxDelay;                              // 0x026C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         RandomSound_MinDelay;                              // 0x0270(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class USoundBase*                             RandomSoundCurrent;                                // 0x0274(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class USoundBase*                             Random_Day;                                        // 0x0278(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class USoundBase*                             Random_Evening;                                    // 0x027C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class USoundBase*                             Random_Morning;                                    // 0x0280(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class USoundBase*                             Random_Night;                                      // 0x0284(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   TileReverbTag;                                     // 0x0288(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UReverbEffect*                          Tile_Reverb_Preset;                                // 0x0290(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Attenuate_with_LPF;                                // 0x0294(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_295[0x3];                                      // 0x0295(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LPFRRadius_Min;                                    // 0x0298(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         LPFRRadius_Max;                                    // 0x029C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                Falloff_Extents;                                   // 0x02A0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          AddAutomatically;                                  // 0x02AC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor)
	uint8                                         Pad_2AD[0x3];                                      // 0x02AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Elements_List;                                     // 0x02B0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate)
	int32                                         ElementsDestroyed;                                 // 0x02BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	int32                                         No_of_Elements_to_Deactivate;                      // 0x02C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                Attenuation_Extents;                               // 0x02C4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          AmbientMix_A_isActive;                             // 0x02D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D1[0x3];                                      // 0x02D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         On_Destroy_Fade_Out_Time;                          // 0x02D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          BlockNextPhase;                                    // 0x02D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ShowAudioDebug;                                    // 0x02D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ClearAmbient;                                      // 0x02DA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsAmbientActive;                                   // 0x02DB(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	TArray<class AActor*>                         TempElementList;                                   // 0x02DC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance)
	bool                                          Delete_Repeated;                                   // 0x02E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_mToD_FoundMix(int32 EntryPoint);
	void FadeinAudio();
	void FadeoutAudio();
	void ManualFadeOut();
	void SetupRoofs();
	void ActorDestroyedSignature__DelegateSignature_Event();
	void Leaving_subzone();
	void Entering_subzone();
	void StopRandomSounds();
	void PlayRandomSounds();
	void Update_attenuation();
	void BndEvt__TriggerRange_K2Node_ComponentBoundEvent_109_ComponentEndOverlapSignature__DelegateSignature(class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void BndEvt__TriggerRange_K2Node_ComponentBoundEvent_104_ComponentBeginOverlapSignature__DelegateSignature(class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void PlayCrossfadeBA();
	void PlayCrossfadeAB();
	void Night_Start();
	void Evening_Start();
	void Day_Start();
	void Morning_Start();
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"mToD_FoundMix_C">();
	}
	static class AmToD_FoundMix_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AmToD_FoundMix_C>();
	}
};
static_assert(alignof(AmToD_FoundMix_C) == 0x000004, "Wrong alignment on AmToD_FoundMix_C");
static_assert(sizeof(AmToD_FoundMix_C) == 0x0002EC, "Wrong size on AmToD_FoundMix_C");
static_assert(offsetof(AmToD_FoundMix_C, UberGraphFrame) == 0x000240, "Member 'AmToD_FoundMix_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AmToD_FoundMix_C, TriggerRange) == 0x000244, "Member 'AmToD_FoundMix_C::TriggerRange' has a wrong offset!");
static_assert(offsetof(AmToD_FoundMix_C, AmbientMix_B) == 0x000248, "Member 'AmToD_FoundMix_C::AmbientMix_B' has a wrong offset!");
static_assert(offsetof(AmToD_FoundMix_C, AmbientMix_A) == 0x00024C, "Member 'AmToD_FoundMix_C::AmbientMix_A' has a wrong offset!");
static_assert(offsetof(AmToD_FoundMix_C, Scene1) == 0x000250, "Member 'AmToD_FoundMix_C::Scene1' has a wrong offset!");
static_assert(offsetof(AmToD_FoundMix_C, Attenuation_Shape) == 0x000254, "Member 'AmToD_FoundMix_C::Attenuation_Shape' has a wrong offset!");
static_assert(offsetof(AmToD_FoundMix_C, distance_algorithm) == 0x000255, "Member 'AmToD_FoundMix_C::distance_algorithm' has a wrong offset!");
static_assert(offsetof(AmToD_FoundMix_C, Falloff_Range) == 0x000258, "Member 'AmToD_FoundMix_C::Falloff_Range' has a wrong offset!");
static_assert(offsetof(AmToD_FoundMix_C, Day_Mix_Sound) == 0x00025C, "Member 'AmToD_FoundMix_C::Day_Mix_Sound' has a wrong offset!");
static_assert(offsetof(AmToD_FoundMix_C, Morning_Mix_Sound) == 0x000260, "Member 'AmToD_FoundMix_C::Morning_Mix_Sound' has a wrong offset!");
static_assert(offsetof(AmToD_FoundMix_C, Evening_Mix_Sound) == 0x000264, "Member 'AmToD_FoundMix_C::Evening_Mix_Sound' has a wrong offset!");
static_assert(offsetof(AmToD_FoundMix_C, Night_Mix_Sound) == 0x000268, "Member 'AmToD_FoundMix_C::Night_Mix_Sound' has a wrong offset!");
static_assert(offsetof(AmToD_FoundMix_C, RandomSound_MaxDelay) == 0x00026C, "Member 'AmToD_FoundMix_C::RandomSound_MaxDelay' has a wrong offset!");
static_assert(offsetof(AmToD_FoundMix_C, RandomSound_MinDelay) == 0x000270, "Member 'AmToD_FoundMix_C::RandomSound_MinDelay' has a wrong offset!");
static_assert(offsetof(AmToD_FoundMix_C, RandomSoundCurrent) == 0x000274, "Member 'AmToD_FoundMix_C::RandomSoundCurrent' has a wrong offset!");
static_assert(offsetof(AmToD_FoundMix_C, Random_Day) == 0x000278, "Member 'AmToD_FoundMix_C::Random_Day' has a wrong offset!");
static_assert(offsetof(AmToD_FoundMix_C, Random_Evening) == 0x00027C, "Member 'AmToD_FoundMix_C::Random_Evening' has a wrong offset!");
static_assert(offsetof(AmToD_FoundMix_C, Random_Morning) == 0x000280, "Member 'AmToD_FoundMix_C::Random_Morning' has a wrong offset!");
static_assert(offsetof(AmToD_FoundMix_C, Random_Night) == 0x000284, "Member 'AmToD_FoundMix_C::Random_Night' has a wrong offset!");
static_assert(offsetof(AmToD_FoundMix_C, TileReverbTag) == 0x000288, "Member 'AmToD_FoundMix_C::TileReverbTag' has a wrong offset!");
static_assert(offsetof(AmToD_FoundMix_C, Tile_Reverb_Preset) == 0x000290, "Member 'AmToD_FoundMix_C::Tile_Reverb_Preset' has a wrong offset!");
static_assert(offsetof(AmToD_FoundMix_C, Attenuate_with_LPF) == 0x000294, "Member 'AmToD_FoundMix_C::Attenuate_with_LPF' has a wrong offset!");
static_assert(offsetof(AmToD_FoundMix_C, LPFRRadius_Min) == 0x000298, "Member 'AmToD_FoundMix_C::LPFRRadius_Min' has a wrong offset!");
static_assert(offsetof(AmToD_FoundMix_C, LPFRRadius_Max) == 0x00029C, "Member 'AmToD_FoundMix_C::LPFRRadius_Max' has a wrong offset!");
static_assert(offsetof(AmToD_FoundMix_C, Falloff_Extents) == 0x0002A0, "Member 'AmToD_FoundMix_C::Falloff_Extents' has a wrong offset!");
static_assert(offsetof(AmToD_FoundMix_C, AddAutomatically) == 0x0002AC, "Member 'AmToD_FoundMix_C::AddAutomatically' has a wrong offset!");
static_assert(offsetof(AmToD_FoundMix_C, Elements_List) == 0x0002B0, "Member 'AmToD_FoundMix_C::Elements_List' has a wrong offset!");
static_assert(offsetof(AmToD_FoundMix_C, ElementsDestroyed) == 0x0002BC, "Member 'AmToD_FoundMix_C::ElementsDestroyed' has a wrong offset!");
static_assert(offsetof(AmToD_FoundMix_C, No_of_Elements_to_Deactivate) == 0x0002C0, "Member 'AmToD_FoundMix_C::No_of_Elements_to_Deactivate' has a wrong offset!");
static_assert(offsetof(AmToD_FoundMix_C, Attenuation_Extents) == 0x0002C4, "Member 'AmToD_FoundMix_C::Attenuation_Extents' has a wrong offset!");
static_assert(offsetof(AmToD_FoundMix_C, AmbientMix_A_isActive) == 0x0002D0, "Member 'AmToD_FoundMix_C::AmbientMix_A_isActive' has a wrong offset!");
static_assert(offsetof(AmToD_FoundMix_C, On_Destroy_Fade_Out_Time) == 0x0002D4, "Member 'AmToD_FoundMix_C::On_Destroy_Fade_Out_Time' has a wrong offset!");
static_assert(offsetof(AmToD_FoundMix_C, BlockNextPhase) == 0x0002D8, "Member 'AmToD_FoundMix_C::BlockNextPhase' has a wrong offset!");
static_assert(offsetof(AmToD_FoundMix_C, ShowAudioDebug) == 0x0002D9, "Member 'AmToD_FoundMix_C::ShowAudioDebug' has a wrong offset!");
static_assert(offsetof(AmToD_FoundMix_C, ClearAmbient) == 0x0002DA, "Member 'AmToD_FoundMix_C::ClearAmbient' has a wrong offset!");
static_assert(offsetof(AmToD_FoundMix_C, IsAmbientActive) == 0x0002DB, "Member 'AmToD_FoundMix_C::IsAmbientActive' has a wrong offset!");
static_assert(offsetof(AmToD_FoundMix_C, TempElementList) == 0x0002DC, "Member 'AmToD_FoundMix_C::TempElementList' has a wrong offset!");
static_assert(offsetof(AmToD_FoundMix_C, Delete_Repeated) == 0x0002E8, "Member 'AmToD_FoundMix_C::Delete_Repeated' has a wrong offset!");

}

#pragma pack(pop)
