#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: mToD_FoundMix

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function mToD_FoundMix.mToD_FoundMix_C.ExecuteUbergraph_mToD_FoundMix
// 0x013C (0x013C - 0x0000)
struct mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable2; // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable2;                // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor2;            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp2;             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex2;        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0028(0x0080)(ConstParm, ContainsInstancedReference)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn2;            // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortDayPhase                                 CallFunc_GetCurrentDayPhase_ReturnValue;           // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C2[0x2];                                       // 0x00C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x00C4(0x000C)(ZeroConstructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue2;           // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue3;           // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue4;           // 0x00D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable2;                      // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00DC(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F5[0x3];                                       // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Min_ReturnValue;                          // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_105[0x3];                                      // 0x0105(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue2;          // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x010C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_RandomFloatInRange_ReturnValue3;          // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X;                            // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Y;                            // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Z;                            // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Add_FloatFloat_ReturnValue2;              // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0130(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix) == 0x000004, "Wrong alignment on mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix");
static_assert(sizeof(mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix) == 0x00013C, "Wrong size on mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix");
static_assert(offsetof(mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix, EntryPoint) == 0x000000, "Member 'mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix::EntryPoint' has a wrong offset!");
static_assert(offsetof(mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable) == 0x000004, "Member 'mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable' has a wrong offset!");
static_assert(offsetof(mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix, Temp_int_Array_Index_Variable) == 0x000010, "Member 'mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix, Temp_bool_IsClosed_Variable) == 0x000014, "Member 'mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable2) == 0x000015, "Member 'mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable2' has a wrong offset!");
static_assert(offsetof(mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix, Temp_bool_Has_Been_Initd_Variable) == 0x000016, "Member 'mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix, Temp_bool_Has_Been_Initd_Variable2) == 0x000017, "Member 'mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix::Temp_bool_Has_Been_Initd_Variable2' has a wrong offset!");
static_assert(offsetof(mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix, K2Node_ComponentBoundEvent_OtherActor2) == 0x000018, "Member 'mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix::K2Node_ComponentBoundEvent_OtherActor2' has a wrong offset!");
static_assert(offsetof(mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix, K2Node_ComponentBoundEvent_OtherComp2) == 0x00001C, "Member 'mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix::K2Node_ComponentBoundEvent_OtherComp2' has a wrong offset!");
static_assert(offsetof(mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix, K2Node_ComponentBoundEvent_OtherBodyIndex2) == 0x000020, "Member 'mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix::K2Node_ComponentBoundEvent_OtherBodyIndex2' has a wrong offset!");
static_assert(offsetof(mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix, K2Node_ComponentBoundEvent_bFromSweep) == 0x000024, "Member 'mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix, K2Node_ComponentBoundEvent_SweepResult) == 0x000028, "Member 'mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x0000A8, "Member 'mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix, K2Node_DynamicCast_bSuccess) == 0x0000AC, "Member 'mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix, K2Node_ComponentBoundEvent_OtherActor) == 0x0000B0, "Member 'mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix, K2Node_ComponentBoundEvent_OtherComp) == 0x0000B4, "Member 'mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x0000B8, "Member 'mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix, K2Node_DynamicCast_AsFort_Player_Pawn2) == 0x0000BC, "Member 'mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix::K2Node_DynamicCast_AsFort_Player_Pawn2' has a wrong offset!");
static_assert(offsetof(mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix, K2Node_DynamicCast_bSuccess2) == 0x0000C0, "Member 'mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix, CallFunc_GetCurrentDayPhase_ReturnValue) == 0x0000C1, "Member 'mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix::CallFunc_GetCurrentDayPhase_ReturnValue' has a wrong offset!");
static_assert(offsetof(mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x0000C4, "Member 'mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x0000D0, "Member 'mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix, CallFunc_EqualEqual_StrStr_ReturnValue2) == 0x0000D1, "Member 'mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix::CallFunc_EqualEqual_StrStr_ReturnValue2' has a wrong offset!");
static_assert(offsetof(mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix, CallFunc_EqualEqual_StrStr_ReturnValue3) == 0x0000D2, "Member 'mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix::CallFunc_EqualEqual_StrStr_ReturnValue3' has a wrong offset!");
static_assert(offsetof(mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix, CallFunc_EqualEqual_StrStr_ReturnValue4) == 0x0000D3, "Member 'mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix::CallFunc_EqualEqual_StrStr_ReturnValue4' has a wrong offset!");
static_assert(offsetof(mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix, Temp_bool_IsClosed_Variable2) == 0x0000D4, "Member 'mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix::Temp_bool_IsClosed_Variable2' has a wrong offset!");
static_assert(offsetof(mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix, CallFunc_RandomFloatInRange_ReturnValue) == 0x0000D8, "Member 'mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix, K2Node_CreateDelegate_OutputDelegate) == 0x0000DC, "Member 'mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix, CallFunc_Array_Get_Item) == 0x0000EC, "Member 'mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix, CallFunc_Array_Length_ReturnValue) == 0x0000F0, "Member 'mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix, CallFunc_Less_IntInt_ReturnValue) == 0x0000F4, "Member 'mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix, CallFunc_Array_Length_ReturnValue2) == 0x0000F8, "Member 'mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix, CallFunc_Add_IntInt_ReturnValue2) == 0x0000FC, "Member 'mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix, CallFunc_Min_ReturnValue) == 0x000100, "Member 'mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix::CallFunc_Min_ReturnValue' has a wrong offset!");
static_assert(offsetof(mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000104, "Member 'mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix, CallFunc_RandomFloatInRange_ReturnValue2) == 0x000108, "Member 'mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix::CallFunc_RandomFloatInRange_ReturnValue2' has a wrong offset!");
static_assert(offsetof(mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x00010C, "Member 'mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix, CallFunc_RandomFloatInRange_ReturnValue3) == 0x000118, "Member 'mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix::CallFunc_RandomFloatInRange_ReturnValue3' has a wrong offset!");
static_assert(offsetof(mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix, CallFunc_BreakVector_X) == 0x00011C, "Member 'mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix, CallFunc_BreakVector_Y) == 0x000120, "Member 'mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix, CallFunc_BreakVector_Z) == 0x000124, "Member 'mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix, CallFunc_Add_FloatFloat_ReturnValue) == 0x000128, "Member 'mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix, CallFunc_Add_FloatFloat_ReturnValue2) == 0x00012C, "Member 'mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix::CallFunc_Add_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix, CallFunc_MakeVector_ReturnValue) == 0x000130, "Member 'mToD_FoundMix_C_ExecuteUbergraph_mToD_FoundMix::CallFunc_MakeVector_ReturnValue' has a wrong offset!");

// Function mToD_FoundMix.mToD_FoundMix_C.BndEvt__TriggerRange_K2Node_ComponentBoundEvent_109_ComponentEndOverlapSignature__DelegateSignature
// 0x000C (0x000C - 0x0000)
struct mToD_FoundMix_C_BndEvt__TriggerRange_K2Node_ComponentBoundEvent_109_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         OtherBodyIndex;                                    // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(mToD_FoundMix_C_BndEvt__TriggerRange_K2Node_ComponentBoundEvent_109_ComponentEndOverlapSignature__DelegateSignature) == 0x000004, "Wrong alignment on mToD_FoundMix_C_BndEvt__TriggerRange_K2Node_ComponentBoundEvent_109_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(mToD_FoundMix_C_BndEvt__TriggerRange_K2Node_ComponentBoundEvent_109_ComponentEndOverlapSignature__DelegateSignature) == 0x00000C, "Wrong size on mToD_FoundMix_C_BndEvt__TriggerRange_K2Node_ComponentBoundEvent_109_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(mToD_FoundMix_C_BndEvt__TriggerRange_K2Node_ComponentBoundEvent_109_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000000, "Member 'mToD_FoundMix_C_BndEvt__TriggerRange_K2Node_ComponentBoundEvent_109_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(mToD_FoundMix_C_BndEvt__TriggerRange_K2Node_ComponentBoundEvent_109_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000004, "Member 'mToD_FoundMix_C_BndEvt__TriggerRange_K2Node_ComponentBoundEvent_109_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(mToD_FoundMix_C_BndEvt__TriggerRange_K2Node_ComponentBoundEvent_109_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000008, "Member 'mToD_FoundMix_C_BndEvt__TriggerRange_K2Node_ComponentBoundEvent_109_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function mToD_FoundMix.mToD_FoundMix_C.BndEvt__TriggerRange_K2Node_ComponentBoundEvent_104_ComponentBeginOverlapSignature__DelegateSignature
// 0x0090 (0x0090 - 0x0000)
struct mToD_FoundMix_C_BndEvt__TriggerRange_K2Node_ComponentBoundEvent_104_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         OtherBodyIndex;                                    // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bFromSweep;                                        // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0010(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(mToD_FoundMix_C_BndEvt__TriggerRange_K2Node_ComponentBoundEvent_104_ComponentBeginOverlapSignature__DelegateSignature) == 0x000004, "Wrong alignment on mToD_FoundMix_C_BndEvt__TriggerRange_K2Node_ComponentBoundEvent_104_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(mToD_FoundMix_C_BndEvt__TriggerRange_K2Node_ComponentBoundEvent_104_ComponentBeginOverlapSignature__DelegateSignature) == 0x000090, "Wrong size on mToD_FoundMix_C_BndEvt__TriggerRange_K2Node_ComponentBoundEvent_104_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(mToD_FoundMix_C_BndEvt__TriggerRange_K2Node_ComponentBoundEvent_104_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000000, "Member 'mToD_FoundMix_C_BndEvt__TriggerRange_K2Node_ComponentBoundEvent_104_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(mToD_FoundMix_C_BndEvt__TriggerRange_K2Node_ComponentBoundEvent_104_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000004, "Member 'mToD_FoundMix_C_BndEvt__TriggerRange_K2Node_ComponentBoundEvent_104_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(mToD_FoundMix_C_BndEvt__TriggerRange_K2Node_ComponentBoundEvent_104_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000008, "Member 'mToD_FoundMix_C_BndEvt__TriggerRange_K2Node_ComponentBoundEvent_104_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(mToD_FoundMix_C_BndEvt__TriggerRange_K2Node_ComponentBoundEvent_104_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00000C, "Member 'mToD_FoundMix_C_BndEvt__TriggerRange_K2Node_ComponentBoundEvent_104_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(mToD_FoundMix_C_BndEvt__TriggerRange_K2Node_ComponentBoundEvent_104_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000010, "Member 'mToD_FoundMix_C_BndEvt__TriggerRange_K2Node_ComponentBoundEvent_104_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function mToD_FoundMix.mToD_FoundMix_C.UserConstructionScript
// 0x00B0 (0x00B0 - 0x0000)
struct mToD_FoundMix_C_UserConstructionScript final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0030(0x0030)(IsPlainOldData, NoDestructor)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0060(0x000C)(ConstParm, ZeroConstructor, ReferenceParm)
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x006C(0x000C)(ConstParm, ZeroConstructor, ReferenceParm)
	TArray<class AActor*>                         CallFunc_ComponentOverlapActors_NEW_OutActors;     // 0x0078(0x000C)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_ComponentOverlapActors_NEW_ReturnValue;   // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable2;                   // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_Array_Get_Item2;                          // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_AddUnique_ReturnValue2;             // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue3;                  // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue3;                // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(mToD_FoundMix_C_UserConstructionScript) == 0x000010, "Wrong alignment on mToD_FoundMix_C_UserConstructionScript");
static_assert(sizeof(mToD_FoundMix_C_UserConstructionScript) == 0x0000B0, "Wrong size on mToD_FoundMix_C_UserConstructionScript");
static_assert(offsetof(mToD_FoundMix_C_UserConstructionScript, Temp_int_Array_Index_Variable) == 0x000000, "Member 'mToD_FoundMix_C_UserConstructionScript::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(mToD_FoundMix_C_UserConstructionScript, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'mToD_FoundMix_C_UserConstructionScript::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(mToD_FoundMix_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'mToD_FoundMix_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
