#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Plant_Shrub_03

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function Plant_Shrub_03.Plant_Shrub_03_C.ExecuteUbergraph_Plant_Shrub_03
// 0x0050 (0x0050 - 0x0000)
struct Plant_Shrub_03_C_ExecuteUbergraph_Plant_Shrub_03 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Plant_Shrub_03_C_ExecuteUbergraph_Plant_Shrub_03) == 0x000010, "Wrong alignment on Plant_Shrub_03_C_ExecuteUbergraph_Plant_Shrub_03");
static_assert(sizeof(Plant_Shrub_03_C_ExecuteUbergraph_Plant_Shrub_03) == 0x000050, "Wrong size on Plant_Shrub_03_C_ExecuteUbergraph_Plant_Shrub_03");
static_assert(offsetof(Plant_Shrub_03_C_ExecuteUbergraph_Plant_Shrub_03, EntryPoint) == 0x000000, "Member 'Plant_Shrub_03_C_ExecuteUbergraph_Plant_Shrub_03::EntryPoint' has a wrong offset!");
static_assert(offsetof(Plant_Shrub_03_C_ExecuteUbergraph_Plant_Shrub_03, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000004, "Member 'Plant_Shrub_03_C_ExecuteUbergraph_Plant_Shrub_03::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Plant_Shrub_03_C_ExecuteUbergraph_Plant_Shrub_03, CallFunc_RandomFloatInRange_ReturnValue) == 0x000008, "Member 'Plant_Shrub_03_C_ExecuteUbergraph_Plant_Shrub_03::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Plant_Shrub_03_C_ExecuteUbergraph_Plant_Shrub_03, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000010, "Member 'Plant_Shrub_03_C_ExecuteUbergraph_Plant_Shrub_03::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(Plant_Shrub_03_C_ExecuteUbergraph_Plant_Shrub_03, CallFunc_Less_FloatFloat_ReturnValue) == 0x000040, "Member 'Plant_Shrub_03_C_ExecuteUbergraph_Plant_Shrub_03::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Plant_Shrub_03_C_ExecuteUbergraph_Plant_Shrub_03, CallFunc_AddComponent_ReturnValue) == 0x000044, "Member 'Plant_Shrub_03_C_ExecuteUbergraph_Plant_Shrub_03::CallFunc_AddComponent_ReturnValue' has a wrong offset!");

}

#pragma pack(pop)
