#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Plant_Shrub_03

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass Plant_Shrub_03.Plant_Shrub_03_C
// 0x0014 (0x0A90 - 0x0A7C)
class APlant_Shrub_03_C final : public ABuildingContainer
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0A7C(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               Effect;                                            // 0x0A80(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UParticleSystemComponent*               Bugs;                                              // 0x0A84(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UStaticMeshComponent*                   Dust_Mesh_Particles;                               // 0x0A88(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         PercentChanceOfAddedFX;                            // 0x0A8C(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_Plant_Shrub_03(int32 EntryPoint);
	void ReceiveDestroyed();
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Plant_Shrub_03_C">();
	}
	static class APlant_Shrub_03_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APlant_Shrub_03_C>();
	}
};
static_assert(alignof(APlant_Shrub_03_C) == 0x000004, "Wrong alignment on APlant_Shrub_03_C");
static_assert(sizeof(APlant_Shrub_03_C) == 0x000A90, "Wrong size on APlant_Shrub_03_C");
static_assert(offsetof(APlant_Shrub_03_C, UberGraphFrame) == 0x000A7C, "Member 'APlant_Shrub_03_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(APlant_Shrub_03_C, Effect) == 0x000A80, "Member 'APlant_Shrub_03_C::Effect' has a wrong offset!");
static_assert(offsetof(APlant_Shrub_03_C, Bugs) == 0x000A84, "Member 'APlant_Shrub_03_C::Bugs' has a wrong offset!");
static_assert(offsetof(APlant_Shrub_03_C, Dust_Mesh_Particles) == 0x000A88, "Member 'APlant_Shrub_03_C::Dust_Mesh_Particles' has a wrong offset!");
static_assert(offsetof(APlant_Shrub_03_C, PercentChanceOfAddedFX) == 0x000A8C, "Member 'APlant_Shrub_03_C::PercentChanceOfAddedFX' has a wrong offset!");

}

#pragma pack(pop)
