#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PowerTransformer02

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function PowerTransformer02.PowerTransformer02_C.ExecuteUbergraph_PowerTransformer02
// 0x00C4 (0x00C4 - 0x0000)
struct PowerTransformer02_C_ExecuteUbergraph_PowerTransformer02 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_Damage;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  K2Node_Event_DamageTags;                           // 0x0008(0x0018)(ConstParm)
	struct FVector                                K2Node_Event_Momentum;                             // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             K2Node_Event_HitInfo;                              // 0x002C(0x0080)(ConstParm, ContainsInstancedReference)
	class AFortPawn*                              K2Node_Event_InstigatedBy;                         // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext;                        // 0x00B4(0x000C)()
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PowerTransformer02_C_ExecuteUbergraph_PowerTransformer02) == 0x000004, "Wrong alignment on PowerTransformer02_C_ExecuteUbergraph_PowerTransformer02");
static_assert(sizeof(PowerTransformer02_C_ExecuteUbergraph_PowerTransformer02) == 0x0000C4, "Wrong size on PowerTransformer02_C_ExecuteUbergraph_PowerTransformer02");
static_assert(offsetof(PowerTransformer02_C_ExecuteUbergraph_PowerTransformer02, EntryPoint) == 0x000000, "Member 'PowerTransformer02_C_ExecuteUbergraph_PowerTransformer02::EntryPoint' has a wrong offset!");
static_assert(offsetof(PowerTransformer02_C_ExecuteUbergraph_PowerTransformer02, K2Node_Event_Damage) == 0x000004, "Member 'PowerTransformer02_C_ExecuteUbergraph_PowerTransformer02::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(PowerTransformer02_C_ExecuteUbergraph_PowerTransformer02, K2Node_Event_DamageTags) == 0x000008, "Member 'PowerTransformer02_C_ExecuteUbergraph_PowerTransformer02::K2Node_Event_DamageTags' has a wrong offset!");
static_assert(offsetof(PowerTransformer02_C_ExecuteUbergraph_PowerTransformer02, K2Node_Event_Momentum) == 0x000020, "Member 'PowerTransformer02_C_ExecuteUbergraph_PowerTransformer02::K2Node_Event_Momentum' has a wrong offset!");
static_assert(offsetof(PowerTransformer02_C_ExecuteUbergraph_PowerTransformer02, K2Node_Event_HitInfo) == 0x00002C, "Member 'PowerTransformer02_C_ExecuteUbergraph_PowerTransformer02::K2Node_Event_HitInfo' has a wrong offset!");
static_assert(offsetof(PowerTransformer02_C_ExecuteUbergraph_PowerTransformer02, K2Node_Event_InstigatedBy) == 0x0000AC, "Member 'PowerTransformer02_C_ExecuteUbergraph_PowerTransformer02::K2Node_Event_InstigatedBy' has a wrong offset!");
static_assert(offsetof(PowerTransformer02_C_ExecuteUbergraph_PowerTransformer02, K2Node_Event_DamageCauser) == 0x0000B0, "Member 'PowerTransformer02_C_ExecuteUbergraph_PowerTransformer02::K2Node_Event_DamageCauser' has a wrong offset!");
static_assert(offsetof(PowerTransformer02_C_ExecuteUbergraph_PowerTransformer02, K2Node_Event_EffectContext) == 0x0000B4, "Member 'PowerTransformer02_C_ExecuteUbergraph_PowerTransformer02::K2Node_Event_EffectContext' has a wrong offset!");
static_assert(offsetof(PowerTransformer02_C_ExecuteUbergraph_PowerTransformer02, CallFunc_SpawnSoundAttached_ReturnValue) == 0x0000C0, "Member 'PowerTransformer02_C_ExecuteUbergraph_PowerTransformer02::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");

// Function PowerTransformer02.PowerTransformer02_C.OnDamagePlayEffects
// 0x00BC (0x00BC - 0x0000)
struct PowerTransformer02_C_OnDamagePlayEffects final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  DamageTags;                                        // 0x0004(0x0018)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FVector                                Momentum;                                          // 0x001C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             HitInfo;                                           // 0x0028(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class AFortPawn*                              InstigatedBy;                                      // 0x00A8(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 DamageCauser;                                      // 0x00AC(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x00B0(0x000C)(Parm)
};
static_assert(alignof(PowerTransformer02_C_OnDamagePlayEffects) == 0x000004, "Wrong alignment on PowerTransformer02_C_OnDamagePlayEffects");
static_assert(sizeof(PowerTransformer02_C_OnDamagePlayEffects) == 0x0000BC, "Wrong size on PowerTransformer02_C_OnDamagePlayEffects");
static_assert(offsetof(PowerTransformer02_C_OnDamagePlayEffects, Damage) == 0x000000, "Member 'PowerTransformer02_C_OnDamagePlayEffects::Damage' has a wrong offset!");
static_assert(offsetof(PowerTransformer02_C_OnDamagePlayEffects, DamageTags) == 0x000004, "Member 'PowerTransformer02_C_OnDamagePlayEffects::DamageTags' has a wrong offset!");
static_assert(offsetof(PowerTransformer02_C_OnDamagePlayEffects, Momentum) == 0x00001C, "Member 'PowerTransformer02_C_OnDamagePlayEffects::Momentum' has a wrong offset!");
static_assert(offsetof(PowerTransformer02_C_OnDamagePlayEffects, HitInfo) == 0x000028, "Member 'PowerTransformer02_C_OnDamagePlayEffects::HitInfo' has a wrong offset!");
static_assert(offsetof(PowerTransformer02_C_OnDamagePlayEffects, InstigatedBy) == 0x0000A8, "Member 'PowerTransformer02_C_OnDamagePlayEffects::InstigatedBy' has a wrong offset!");
static_assert(offsetof(PowerTransformer02_C_OnDamagePlayEffects, DamageCauser) == 0x0000AC, "Member 'PowerTransformer02_C_OnDamagePlayEffects::DamageCauser' has a wrong offset!");
static_assert(offsetof(PowerTransformer02_C_OnDamagePlayEffects, EffectContext) == 0x0000B0, "Member 'PowerTransformer02_C_OnDamagePlayEffects::EffectContext' has a wrong offset!");

}

#pragma pack(pop)
