#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PowerTransformer01

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function PowerTransformer01.PowerTransformer01_C.ExecuteUbergraph_PowerTransformer01
// 0x018C (0x018C - 0x0000)
struct PowerTransformer01_C_ExecuteUbergraph_PowerTransformer01 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Damage2;                              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  K2Node_Event_DamageTags2;                          // 0x000C(0x0018)(ConstParm)
	struct FVector                                K2Node_Event_Momentum2;                            // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             K2Node_Event_HitInfo2;                             // 0x0030(0x0080)(ConstParm, ContainsInstancedReference)
	class AFortPawn*                              K2Node_Event_InstigatedBy2;                        // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_Event_DamageCauser2;                        // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext2;                       // 0x00B8(0x000C)()
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Damage;                               // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  K2Node_Event_DamageTags;                           // 0x00D0(0x0018)(ConstParm)
	struct FVector                                K2Node_Event_Momentum;                             // 0x00E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             K2Node_Event_HitInfo;                              // 0x00F4(0x0080)(ConstParm, ContainsInstancedReference)
	class AFortPawn*                              K2Node_Event_InstigatedBy;                         // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext;                        // 0x017C(0x000C)()
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue2;          // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PowerTransformer01_C_ExecuteUbergraph_PowerTransformer01) == 0x000004, "Wrong alignment on PowerTransformer01_C_ExecuteUbergraph_PowerTransformer01");
static_assert(sizeof(PowerTransformer01_C_ExecuteUbergraph_PowerTransformer01) == 0x00018C, "Wrong size on PowerTransformer01_C_ExecuteUbergraph_PowerTransformer01");
static_assert(offsetof(PowerTransformer01_C_ExecuteUbergraph_PowerTransformer01, EntryPoint) == 0x000000, "Member 'PowerTransformer01_C_ExecuteUbergraph_PowerTransformer01::EntryPoint' has a wrong offset!");
static_assert(offsetof(PowerTransformer01_C_ExecuteUbergraph_PowerTransformer01, Temp_bool_Has_Been_Initd_Variable) == 0x000004, "Member 'PowerTransformer01_C_ExecuteUbergraph_PowerTransformer01::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(PowerTransformer01_C_ExecuteUbergraph_PowerTransformer01, K2Node_Event_Damage2) == 0x000008, "Member 'PowerTransformer01_C_ExecuteUbergraph_PowerTransformer01::K2Node_Event_Damage2' has a wrong offset!");
static_assert(offsetof(PowerTransformer01_C_ExecuteUbergraph_PowerTransformer01, K2Node_Event_DamageTags2) == 0x00000C, "Member 'PowerTransformer01_C_ExecuteUbergraph_PowerTransformer01::K2Node_Event_DamageTags2' has a wrong offset!");
static_assert(offsetof(PowerTransformer01_C_ExecuteUbergraph_PowerTransformer01, K2Node_Event_Momentum2) == 0x000024, "Member 'PowerTransformer01_C_ExecuteUbergraph_PowerTransformer01::K2Node_Event_Momentum2' has a wrong offset!");
static_assert(offsetof(PowerTransformer01_C_ExecuteUbergraph_PowerTransformer01, K2Node_Event_HitInfo2) == 0x000030, "Member 'PowerTransformer01_C_ExecuteUbergraph_PowerTransformer01::K2Node_Event_HitInfo2' has a wrong offset!");
static_assert(offsetof(PowerTransformer01_C_ExecuteUbergraph_PowerTransformer01, K2Node_Event_InstigatedBy2) == 0x0000B0, "Member 'PowerTransformer01_C_ExecuteUbergraph_PowerTransformer01::K2Node_Event_InstigatedBy2' has a wrong offset!");
static_assert(offsetof(PowerTransformer01_C_ExecuteUbergraph_PowerTransformer01, K2Node_Event_DamageCauser2) == 0x0000B4, "Member 'PowerTransformer01_C_ExecuteUbergraph_PowerTransformer01::K2Node_Event_DamageCauser2' has a wrong offset!");
static_assert(offsetof(PowerTransformer01_C_ExecuteUbergraph_PowerTransformer01, K2Node_Event_EffectContext2) == 0x0000B8, "Member 'PowerTransformer01_C_ExecuteUbergraph_PowerTransformer01::K2Node_Event_EffectContext2' has a wrong offset!");
static_assert(offsetof(PowerTransformer01_C_ExecuteUbergraph_PowerTransformer01, CallFunc_SpawnSoundAttached_ReturnValue) == 0x0000C4, "Member 'PowerTransformer01_C_ExecuteUbergraph_PowerTransformer01::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(PowerTransformer01_C_ExecuteUbergraph_PowerTransformer01, Temp_bool_IsClosed_Variable) == 0x0000C8, "Member 'PowerTransformer01_C_ExecuteUbergraph_PowerTransformer01::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(PowerTransformer01_C_ExecuteUbergraph_PowerTransformer01, K2Node_Event_Damage) == 0x0000CC, "Member 'PowerTransformer01_C_ExecuteUbergraph_PowerTransformer01::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(PowerTransformer01_C_ExecuteUbergraph_PowerTransformer01, K2Node_Event_DamageTags) == 0x0000D0, "Member 'PowerTransformer01_C_ExecuteUbergraph_PowerTransformer01::K2Node_Event_DamageTags' has a wrong offset!");
static_assert(offsetof(PowerTransformer01_C_ExecuteUbergraph_PowerTransformer01, K2Node_Event_Momentum) == 0x0000E8, "Member 'PowerTransformer01_C_ExecuteUbergraph_PowerTransformer01::K2Node_Event_Momentum' has a wrong offset!");
static_assert(offsetof(PowerTransformer01_C_ExecuteUbergraph_PowerTransformer01, K2Node_Event_HitInfo) == 0x0000F4, "Member 'PowerTransformer01_C_ExecuteUbergraph_PowerTransformer01::K2Node_Event_HitInfo' has a wrong offset!");
static_assert(offsetof(PowerTransformer01_C_ExecuteUbergraph_PowerTransformer01, K2Node_Event_InstigatedBy) == 0x000174, "Member 'PowerTransformer01_C_ExecuteUbergraph_PowerTransformer01::K2Node_Event_InstigatedBy' has a wrong offset!");
static_assert(offsetof(PowerTransformer01_C_ExecuteUbergraph_PowerTransformer01, K2Node_Event_DamageCauser) == 0x000178, "Member 'PowerTransformer01_C_ExecuteUbergraph_PowerTransformer01::K2Node_Event_DamageCauser' has a wrong offset!");
static_assert(offsetof(PowerTransformer01_C_ExecuteUbergraph_PowerTransformer01, K2Node_Event_EffectContext) == 0x00017C, "Member 'PowerTransformer01_C_ExecuteUbergraph_PowerTransformer01::K2Node_Event_EffectContext' has a wrong offset!");
static_assert(offsetof(PowerTransformer01_C_ExecuteUbergraph_PowerTransformer01, CallFunc_SpawnSoundAttached_ReturnValue2) == 0x000188, "Member 'PowerTransformer01_C_ExecuteUbergraph_PowerTransformer01::CallFunc_SpawnSoundAttached_ReturnValue2' has a wrong offset!");

// Function PowerTransformer01.PowerTransformer01_C.OnDeathPlayEffects
// 0x00BC (0x00BC - 0x0000)
struct PowerTransformer01_C_OnDeathPlayEffects final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  DamageTags;                                        // 0x0004(0x0018)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FVector                                Momentum;                                          // 0x001C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             HitInfo;                                           // 0x0028(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class AFortPawn*                              InstigatedBy;                                      // 0x00A8(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 DamageCauser;                                      // 0x00AC(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x00B0(0x000C)(Parm)
};
static_assert(alignof(PowerTransformer01_C_OnDeathPlayEffects) == 0x000004, "Wrong alignment on PowerTransformer01_C_OnDeathPlayEffects");
static_assert(sizeof(PowerTransformer01_C_OnDeathPlayEffects) == 0x0000BC, "Wrong size on PowerTransformer01_C_OnDeathPlayEffects");
static_assert(offsetof(PowerTransformer01_C_OnDeathPlayEffects, Damage) == 0x000000, "Member 'PowerTransformer01_C_OnDeathPlayEffects::Damage' has a wrong offset!");
static_assert(offsetof(PowerTransformer01_C_OnDeathPlayEffects, DamageTags) == 0x000004, "Member 'PowerTransformer01_C_OnDeathPlayEffects::DamageTags' has a wrong offset!");
static_assert(offsetof(PowerTransformer01_C_OnDeathPlayEffects, Momentum) == 0x00001C, "Member 'PowerTransformer01_C_OnDeathPlayEffects::Momentum' has a wrong offset!");
static_assert(offsetof(PowerTransformer01_C_OnDeathPlayEffects, HitInfo) == 0x000028, "Member 'PowerTransformer01_C_OnDeathPlayEffects::HitInfo' has a wrong offset!");
static_assert(offsetof(PowerTransformer01_C_OnDeathPlayEffects, InstigatedBy) == 0x0000A8, "Member 'PowerTransformer01_C_OnDeathPlayEffects::InstigatedBy' has a wrong offset!");
static_assert(offsetof(PowerTransformer01_C_OnDeathPlayEffects, DamageCauser) == 0x0000AC, "Member 'PowerTransformer01_C_OnDeathPlayEffects::DamageCauser' has a wrong offset!");
static_assert(offsetof(PowerTransformer01_C_OnDeathPlayEffects, EffectContext) == 0x0000B0, "Member 'PowerTransformer01_C_OnDeathPlayEffects::EffectContext' has a wrong offset!");

// Function PowerTransformer01.PowerTransformer01_C.OnDamagePlayEffects
// 0x00BC (0x00BC - 0x0000)
struct PowerTransformer01_C_OnDamagePlayEffects final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  DamageTags;                                        // 0x0004(0x0018)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FVector                                Momentum;                                          // 0x001C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             HitInfo;                                           // 0x0028(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class AFortPawn*                              InstigatedBy;                                      // 0x00A8(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 DamageCauser;                                      // 0x00AC(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x00B0(0x000C)(Parm)
};
static_assert(alignof(PowerTransformer01_C_OnDamagePlayEffects) == 0x000004, "Wrong alignment on PowerTransformer01_C_OnDamagePlayEffects");
static_assert(sizeof(PowerTransformer01_C_OnDamagePlayEffects) == 0x0000BC, "Wrong size on PowerTransformer01_C_OnDamagePlayEffects");
static_assert(offsetof(PowerTransformer01_C_OnDamagePlayEffects, Damage) == 0x000000, "Member 'PowerTransformer01_C_OnDamagePlayEffects::Damage' has a wrong offset!");
static_assert(offsetof(PowerTransformer01_C_OnDamagePlayEffects, DamageTags) == 0x000004, "Member 'PowerTransformer01_C_OnDamagePlayEffects::DamageTags' has a wrong offset!");
static_assert(offsetof(PowerTransformer01_C_OnDamagePlayEffects, Momentum) == 0x00001C, "Member 'PowerTransformer01_C_OnDamagePlayEffects::Momentum' has a wrong offset!");
static_assert(offsetof(PowerTransformer01_C_OnDamagePlayEffects, HitInfo) == 0x000028, "Member 'PowerTransformer01_C_OnDamagePlayEffects::HitInfo' has a wrong offset!");
static_assert(offsetof(PowerTransformer01_C_OnDamagePlayEffects, InstigatedBy) == 0x0000A8, "Member 'PowerTransformer01_C_OnDamagePlayEffects::InstigatedBy' has a wrong offset!");
static_assert(offsetof(PowerTransformer01_C_OnDamagePlayEffects, DamageCauser) == 0x0000AC, "Member 'PowerTransformer01_C_OnDamagePlayEffects::DamageCauser' has a wrong offset!");
static_assert(offsetof(PowerTransformer01_C_OnDamagePlayEffects, EffectContext) == 0x0000B0, "Member 'PowerTransformer01_C_OnDamagePlayEffects::EffectContext' has a wrong offset!");

}

#pragma pack(pop)
