#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prj_TrashmanBag

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function Prj_TrashmanBag.Prj_TrashmanBag_C.ExecuteUbergraph_Prj_TrashmanBag
// 0x02B0 (0x02B0 - 0x0000)
struct Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Variable;                                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    K2Node_Event_MyComp;                               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_Event_Other;                                // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    K2Node_Event_OtherComp;                            // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bSelfMoved;                           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_HitLocation;                          // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                K2Node_Event_HitNormal;                            // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                K2Node_Event_NormalImpulse;                        // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             K2Node_Event_Hit2;                                 // 0x0050(0x0080)(ConstParm, ContainsInstancedReference)
	class AController*                            CallFunc_GetInstigatorController_ReturnValue;      // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortAIController*                      K2Node_DynamicCast_AsFort_AIController;            // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_GetGoalActor_ReturnValue;                 // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x00EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FD[0x3];                                       // 0x00FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X;                            // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Y;                            // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Z;                            // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue2;                  // 0x010C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortTeamAffiliation                          CallFunc_GetTeamAffiliation_ReturnValue;           // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x011C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Cross_VectorVector_ReturnValue;           // 0x0128(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotationFromAxes_ReturnValue;         // 0x0134(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue2;         // 0x0140(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x014C(0x0080)(ConstParm, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x01CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x01CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1CE[0x2];                                      // 0x01CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x01D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x01E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x01EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x01F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x021C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0228(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_241[0x3];                                      // 0x0241(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_RandomFloatInRange_ReturnValue2;          // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0258(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_264[0xC];                                      // 0x0264(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0270(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x02A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AB_BGA_TrashmanBagSkull_C*              K2Node_DynamicCast_AsB_BGA_Trashman_Bag_Skull;     // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x02AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag) == 0x000010, "Wrong alignment on Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag");
static_assert(sizeof(Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag) == 0x0002B0, "Wrong size on Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag");
static_assert(offsetof(Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag, EntryPoint) == 0x000000, "Member 'Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag, CallFunc_IsDedicatedServer_ReturnValue) == 0x000004, "Member 'Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000008, "Member 'Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag, Temp_int_Variable) == 0x000014, "Member 'Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag, K2Node_Event_MyComp) == 0x00001C, "Member 'Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag::K2Node_Event_MyComp' has a wrong offset!");
static_assert(offsetof(Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag, K2Node_Event_Other) == 0x000020, "Member 'Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag::K2Node_Event_Other' has a wrong offset!");
static_assert(offsetof(Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag, K2Node_Event_OtherComp) == 0x000024, "Member 'Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag::K2Node_Event_OtherComp' has a wrong offset!");
static_assert(offsetof(Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag, K2Node_Event_bSelfMoved) == 0x000028, "Member 'Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag::K2Node_Event_bSelfMoved' has a wrong offset!");
static_assert(offsetof(Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag, K2Node_Event_HitLocation) == 0x00002C, "Member 'Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag::K2Node_Event_HitLocation' has a wrong offset!");
static_assert(offsetof(Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag, K2Node_Event_HitNormal) == 0x000038, "Member 'Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag::K2Node_Event_HitNormal' has a wrong offset!");
static_assert(offsetof(Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag, K2Node_Event_NormalImpulse) == 0x000044, "Member 'Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag::K2Node_Event_NormalImpulse' has a wrong offset!");
static_assert(offsetof(Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag, K2Node_Event_Hit2) == 0x000050, "Member 'Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag::K2Node_Event_Hit2' has a wrong offset!");
static_assert(offsetof(Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag, CallFunc_GetInstigatorController_ReturnValue) == 0x0000D0, "Member 'Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag::CallFunc_GetInstigatorController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag, K2Node_DynamicCast_AsFort_AIController) == 0x0000D4, "Member 'Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag::K2Node_DynamicCast_AsFort_AIController' has a wrong offset!");
static_assert(offsetof(Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag, K2Node_DynamicCast_bSuccess) == 0x0000D8, "Member 'Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag, CallFunc_MakeVector_ReturnValue) == 0x0000DC, "Member 'Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag, CallFunc_GetGoalActor_ReturnValue) == 0x0000E8, "Member 'Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag::CallFunc_GetGoalActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag, CallFunc_GetVelocity_ReturnValue) == 0x0000EC, "Member 'Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag, K2Node_DynamicCast_AsFort_Pawn) == 0x0000F8, "Member 'Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag::K2Node_DynamicCast_AsFort_Pawn' has a wrong offset!");
static_assert(offsetof(Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag, K2Node_DynamicCast_bSuccess2) == 0x0000FC, "Member 'Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag, CallFunc_BreakVector_X) == 0x000100, "Member 'Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag, CallFunc_BreakVector_Y) == 0x000104, "Member 'Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag, CallFunc_BreakVector_Z) == 0x000108, "Member 'Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag, CallFunc_MakeVector_ReturnValue2) == 0x00010C, "Member 'Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag::CallFunc_MakeVector_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag, CallFunc_GetTeamAffiliation_ReturnValue) == 0x000118, "Member 'Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag::CallFunc_GetTeamAffiliation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag, CallFunc_Normal_ReturnValue) == 0x00011C, "Member 'Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag, CallFunc_Cross_VectorVector_ReturnValue) == 0x000128, "Member 'Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag::CallFunc_Cross_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag, CallFunc_MakeRotationFromAxes_ReturnValue) == 0x000134, "Member 'Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag::CallFunc_MakeRotationFromAxes_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag, CallFunc_K2_GetActorLocation_ReturnValue2) == 0x000140, "Member 'Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag::CallFunc_K2_GetActorLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag, K2Node_Event_Hit) == 0x00014C, "Member 'Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag, CallFunc_BreakHitResult_bBlockingHit) == 0x0001CC, "Member 'Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag, CallFunc_BreakHitResult_bInitialOverlap) == 0x0001CD, "Member 'Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag, CallFunc_BreakHitResult_Time) == 0x0001D0, "Member 'Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag, CallFunc_BreakHitResult_Location) == 0x0001D4, "Member 'Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag, CallFunc_BreakHitResult_ImpactPoint) == 0x0001E0, "Member 'Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag, CallFunc_BreakHitResult_Normal) == 0x0001EC, "Member 'Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag, CallFunc_BreakHitResult_ImpactNormal) == 0x0001F8, "Member 'Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag, CallFunc_BreakHitResult_PhysMat) == 0x000204, "Member 'Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag, CallFunc_BreakHitResult_HitActor) == 0x000208, "Member 'Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag, CallFunc_BreakHitResult_HitComponent) == 0x00020C, "Member 'Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag, CallFunc_BreakHitResult_HitBoneName) == 0x000210, "Member 'Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag, CallFunc_BreakHitResult_HitItem) == 0x000218, "Member 'Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag, CallFunc_BreakHitResult_TraceStart) == 0x00021C, "Member 'Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag, CallFunc_BreakHitResult_TraceEnd) == 0x000228, "Member 'Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000234, "Member 'Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag, CallFunc_RandomFloatInRange_ReturnValue) == 0x000238, "Member 'Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag, CallFunc_Subtract_IntInt_ReturnValue) == 0x00023C, "Member 'Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000240, "Member 'Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000244, "Member 'Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000248, "Member 'Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag, CallFunc_Multiply_IntFloat_ReturnValue) == 0x00024C, "Member 'Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag, CallFunc_Add_FloatFloat_ReturnValue) == 0x000250, "Member 'Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag, CallFunc_RandomFloatInRange_ReturnValue2) == 0x000254, "Member 'Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag::CallFunc_RandomFloatInRange_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag, CallFunc_MakeRotator_ReturnValue) == 0x000258, "Member 'Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag, CallFunc_MakeTransform_ReturnValue) == 0x000270, "Member 'Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0002A0, "Member 'Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag, CallFunc_FinishSpawningActor_ReturnValue) == 0x0002A4, "Member 'Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag, K2Node_DynamicCast_AsB_BGA_Trashman_Bag_Skull) == 0x0002A8, "Member 'Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag::K2Node_DynamicCast_AsB_BGA_Trashman_Bag_Skull' has a wrong offset!");
static_assert(offsetof(Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag, K2Node_DynamicCast_bSuccess3) == 0x0002AC, "Member 'Prj_TrashmanBag_C_ExecuteUbergraph_Prj_TrashmanBag::K2Node_DynamicCast_bSuccess3' has a wrong offset!");

// Function Prj_TrashmanBag.Prj_TrashmanBag_C.OnStop
// 0x0080 (0x0080 - 0x0000)
struct Prj_TrashmanBag_C_OnStop final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(Prj_TrashmanBag_C_OnStop) == 0x000004, "Wrong alignment on Prj_TrashmanBag_C_OnStop");
static_assert(sizeof(Prj_TrashmanBag_C_OnStop) == 0x000080, "Wrong size on Prj_TrashmanBag_C_OnStop");
static_assert(offsetof(Prj_TrashmanBag_C_OnStop, Hit) == 0x000000, "Member 'Prj_TrashmanBag_C_OnStop::Hit' has a wrong offset!");

// Function Prj_TrashmanBag.Prj_TrashmanBag_C.ReceiveHit
// 0x00B4 (0x00B4 - 0x0000)
struct Prj_TrashmanBag_C_ReceiveHit final
{
public:
	class UPrimitiveComponent*                    MyComp;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 Other;                                             // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bSelfMoved;                                        // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                HitLocation_0;                                     // 0x0010(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                HitNormal;                                         // 0x001C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                NormalImpulse;                                     // 0x0028(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             Hit;                                               // 0x0034(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(Prj_TrashmanBag_C_ReceiveHit) == 0x000004, "Wrong alignment on Prj_TrashmanBag_C_ReceiveHit");
static_assert(sizeof(Prj_TrashmanBag_C_ReceiveHit) == 0x0000B4, "Wrong size on Prj_TrashmanBag_C_ReceiveHit");
static_assert(offsetof(Prj_TrashmanBag_C_ReceiveHit, MyComp) == 0x000000, "Member 'Prj_TrashmanBag_C_ReceiveHit::MyComp' has a wrong offset!");
static_assert(offsetof(Prj_TrashmanBag_C_ReceiveHit, Other) == 0x000004, "Member 'Prj_TrashmanBag_C_ReceiveHit::Other' has a wrong offset!");
static_assert(offsetof(Prj_TrashmanBag_C_ReceiveHit, OtherComp) == 0x000008, "Member 'Prj_TrashmanBag_C_ReceiveHit::OtherComp' has a wrong offset!");
static_assert(offsetof(Prj_TrashmanBag_C_ReceiveHit, bSelfMoved) == 0x00000C, "Member 'Prj_TrashmanBag_C_ReceiveHit::bSelfMoved' has a wrong offset!");
static_assert(offsetof(Prj_TrashmanBag_C_ReceiveHit, HitLocation_0) == 0x000010, "Member 'Prj_TrashmanBag_C_ReceiveHit::HitLocation_0' has a wrong offset!");
static_assert(offsetof(Prj_TrashmanBag_C_ReceiveHit, HitNormal) == 0x00001C, "Member 'Prj_TrashmanBag_C_ReceiveHit::HitNormal' has a wrong offset!");
static_assert(offsetof(Prj_TrashmanBag_C_ReceiveHit, NormalImpulse) == 0x000028, "Member 'Prj_TrashmanBag_C_ReceiveHit::NormalImpulse' has a wrong offset!");
static_assert(offsetof(Prj_TrashmanBag_C_ReceiveHit, Hit) == 0x000034, "Member 'Prj_TrashmanBag_C_ReceiveHit::Hit' has a wrong offset!");

// Function Prj_TrashmanBag.Prj_TrashmanBag_C.UserConstructionScript
// 0x000C (0x000C - 0x0000)
struct Prj_TrashmanBag_C_UserConstructionScript final
{
public:
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue2; // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prj_TrashmanBag_C_UserConstructionScript) == 0x000004, "Wrong alignment on Prj_TrashmanBag_C_UserConstructionScript");
static_assert(sizeof(Prj_TrashmanBag_C_UserConstructionScript) == 0x00000C, "Wrong size on Prj_TrashmanBag_C_UserConstructionScript");
static_assert(offsetof(Prj_TrashmanBag_C_UserConstructionScript, CallFunc_RandomFloatInRange_ReturnValue) == 0x000000, "Member 'Prj_TrashmanBag_C_UserConstructionScript::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_TrashmanBag_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000004, "Member 'Prj_TrashmanBag_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
