#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prj_HuskBeeAOECloud

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function Prj_HuskBeeAOECloud.Prj_HuskBeeAOECloud_C.ExecuteUbergraph_Prj_HuskBeeAOECloud
// 0x01C4 (0x01C4 - 0x0000)
struct Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetInstigatorController_ReturnValue;      // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortAIController*                      K2Node_DynamicCast_AsFort_AIController;            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue2;                // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetGoalActor_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortTeamAffiliation                          CallFunc_GetTeamAffiliation_ReturnValue;           // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue3;                // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable2;                      // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetMaxSpeed_ReturnValue;                  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_Event_OtherActor;                           // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    K2Node_Event_OtherComp;                            // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             K2Node_Event_HitResult;                            // 0x0040(0x0080)(ConstParm, ContainsInstancedReference)
	EFortTeam                                     CallFunc_GetActorTeam_ReturnValue;                 // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x00C4(0x0004)()
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable2;                // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CD[0x3];                                       // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor3;            // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp3;             // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex3;        // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput;    // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x00EC(0x0004)()
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor2;            // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp2;             // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex2;        // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0104(0x0080)(ConstParm, ContainsInstancedReference)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue2;   // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue3;   // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self2_CastInput;   // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue2;      // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A1[0x3];                                      // 0x01A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self3_CastInput;   // 0x01A4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue3;      // 0x01AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1AD[0x3];                                      // 0x01AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue2; // 0x01B0(0x0004)()
	float                                         CallFunc_GetMaxSpeed_ReturnValue2;                 // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue2;         // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortTeam                                     CallFunc_GetActorTeam_ReturnValue2;                // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortTeamAffiliation                          CallFunc_GetTeamAffiliationBetweenTeams_ReturnValue; // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x01C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud) == 0x000004, "Wrong alignment on Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud");
static_assert(sizeof(Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud) == 0x0001C4, "Wrong size on Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud");
static_assert(offsetof(Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud, EntryPoint) == 0x000000, "Member 'Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000004, "Member 'Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud, CallFunc_HasAuthority_ReturnValue) == 0x000010, "Member 'Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud, CallFunc_GetInstigatorController_ReturnValue) == 0x000014, "Member 'Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud::CallFunc_GetInstigatorController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud, K2Node_DynamicCast_AsFort_AIController) == 0x000018, "Member 'Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud::K2Node_DynamicCast_AsFort_AIController' has a wrong offset!");
static_assert(offsetof(Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud, K2Node_DynamicCast_bSuccess) == 0x00001C, "Member 'Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud, CallFunc_HasAuthority_ReturnValue2) == 0x00001D, "Member 'Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud::CallFunc_HasAuthority_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud, CallFunc_GetGoalActor_ReturnValue) == 0x000020, "Member 'Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud::CallFunc_GetGoalActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud, K2Node_DynamicCast_AsFort_Pawn) == 0x000024, "Member 'Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud::K2Node_DynamicCast_AsFort_Pawn' has a wrong offset!");
static_assert(offsetof(Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud, K2Node_DynamicCast_bSuccess2) == 0x000028, "Member 'Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud, Temp_bool_IsClosed_Variable) == 0x000029, "Member 'Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud, CallFunc_GetTeamAffiliation_ReturnValue) == 0x00002A, "Member 'Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud::CallFunc_GetTeamAffiliation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud, CallFunc_HasAuthority_ReturnValue3) == 0x00002B, "Member 'Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud::CallFunc_HasAuthority_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud, Temp_bool_IsClosed_Variable2) == 0x00002C, "Member 'Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud::Temp_bool_IsClosed_Variable2' has a wrong offset!");
static_assert(offsetof(Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud, Temp_bool_Has_Been_Initd_Variable) == 0x00002D, "Member 'Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud, CallFunc_GetMaxSpeed_ReturnValue) == 0x000030, "Member 'Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud::CallFunc_GetMaxSpeed_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000034, "Member 'Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud, K2Node_Event_OtherActor) == 0x000038, "Member 'Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud::K2Node_Event_OtherActor' has a wrong offset!");
static_assert(offsetof(Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud, K2Node_Event_OtherComp) == 0x00003C, "Member 'Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud::K2Node_Event_OtherComp' has a wrong offset!");
static_assert(offsetof(Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud, K2Node_Event_HitResult) == 0x000040, "Member 'Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud::K2Node_Event_HitResult' has a wrong offset!");
static_assert(offsetof(Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud, CallFunc_GetActorTeam_ReturnValue) == 0x0000C0, "Member 'Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud::CallFunc_GetActorTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud, CallFunc_K2_SetTimer_ReturnValue) == 0x0000C4, "Member 'Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud, CallFunc_Add_FloatFloat_ReturnValue) == 0x0000C8, "Member 'Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud, Temp_bool_Has_Been_Initd_Variable2) == 0x0000CC, "Member 'Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud::Temp_bool_Has_Been_Initd_Variable2' has a wrong offset!");
static_assert(offsetof(Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud, K2Node_ComponentBoundEvent_OtherActor3) == 0x0000D0, "Member 'Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud::K2Node_ComponentBoundEvent_OtherActor3' has a wrong offset!");
static_assert(offsetof(Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud, K2Node_ComponentBoundEvent_OtherComp3) == 0x0000D4, "Member 'Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud::K2Node_ComponentBoundEvent_OtherComp3' has a wrong offset!");
static_assert(offsetof(Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud, K2Node_ComponentBoundEvent_OtherBodyIndex3) == 0x0000D8, "Member 'Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud::K2Node_ComponentBoundEvent_OtherBodyIndex3' has a wrong offset!");
static_assert(offsetof(Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x0000DC, "Member 'Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x0000E0, "Member 'Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x0000E8, "Member 'Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x0000EC, "Member 'Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud, CallFunc_Not_PreBool_ReturnValue) == 0x0000F0, "Member 'Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud, K2Node_ComponentBoundEvent_OtherActor2) == 0x0000F4, "Member 'Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud::K2Node_ComponentBoundEvent_OtherActor2' has a wrong offset!");
static_assert(offsetof(Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud, K2Node_ComponentBoundEvent_OtherComp2) == 0x0000F8, "Member 'Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud::K2Node_ComponentBoundEvent_OtherComp2' has a wrong offset!");
static_assert(offsetof(Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud, K2Node_ComponentBoundEvent_OtherBodyIndex2) == 0x0000FC, "Member 'Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud::K2Node_ComponentBoundEvent_OtherBodyIndex2' has a wrong offset!");
static_assert(offsetof(Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud, K2Node_ComponentBoundEvent_bFromSweep) == 0x000100, "Member 'Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud, K2Node_ComponentBoundEvent_SweepResult) == 0x000104, "Member 'Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud, CallFunc_GetAbilitySystemComponent_ReturnValue2) == 0x000184, "Member 'Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud::CallFunc_GetAbilitySystemComponent_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud, K2Node_ComponentBoundEvent_OtherActor) == 0x000188, "Member 'Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud, K2Node_ComponentBoundEvent_OtherComp) == 0x00018C, "Member 'Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000190, "Member 'Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud, CallFunc_GetAbilitySystemComponent_ReturnValue3) == 0x000194, "Member 'Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud::CallFunc_GetAbilitySystemComponent_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud, CallFunc_HasMatchingGameplayTag_self2_CastInput) == 0x000198, "Member 'Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud::CallFunc_HasMatchingGameplayTag_self2_CastInput' has a wrong offset!");
static_assert(offsetof(Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud, CallFunc_HasMatchingGameplayTag_ReturnValue2) == 0x0001A0, "Member 'Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud::CallFunc_HasMatchingGameplayTag_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud, CallFunc_HasMatchingGameplayTag_self3_CastInput) == 0x0001A4, "Member 'Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud::CallFunc_HasMatchingGameplayTag_self3_CastInput' has a wrong offset!");
static_assert(offsetof(Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud, CallFunc_HasMatchingGameplayTag_ReturnValue3) == 0x0001AC, "Member 'Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud::CallFunc_HasMatchingGameplayTag_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue2) == 0x0001B0, "Member 'Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud, CallFunc_GetMaxSpeed_ReturnValue2) == 0x0001B4, "Member 'Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud::CallFunc_GetMaxSpeed_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud, CallFunc_Multiply_FloatFloat_ReturnValue2) == 0x0001B8, "Member 'Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud::CallFunc_Multiply_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud, CallFunc_GetInstigator_ReturnValue) == 0x0001BC, "Member 'Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud, CallFunc_GetActorTeam_ReturnValue2) == 0x0001C0, "Member 'Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud::CallFunc_GetActorTeam_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud, CallFunc_GetTeamAffiliationBetweenTeams_ReturnValue) == 0x0001C1, "Member 'Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud::CallFunc_GetTeamAffiliationBetweenTeams_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud, K2Node_SwitchEnum_CmpSuccess) == 0x0001C2, "Member 'Prj_HuskBeeAOECloud_C_ExecuteUbergraph_Prj_HuskBeeAOECloud::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function Prj_HuskBeeAOECloud.Prj_HuskBeeAOECloud_C.BndEvt__BeeAntiOverlapArea_K2Node_ComponentBoundEvent_70_ComponentEndOverlapSignature__DelegateSignature
// 0x000C (0x000C - 0x0000)
struct Prj_HuskBeeAOECloud_C_BndEvt__BeeAntiOverlapArea_K2Node_ComponentBoundEvent_70_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         OtherBodyIndex;                                    // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prj_HuskBeeAOECloud_C_BndEvt__BeeAntiOverlapArea_K2Node_ComponentBoundEvent_70_ComponentEndOverlapSignature__DelegateSignature) == 0x000004, "Wrong alignment on Prj_HuskBeeAOECloud_C_BndEvt__BeeAntiOverlapArea_K2Node_ComponentBoundEvent_70_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(Prj_HuskBeeAOECloud_C_BndEvt__BeeAntiOverlapArea_K2Node_ComponentBoundEvent_70_ComponentEndOverlapSignature__DelegateSignature) == 0x00000C, "Wrong size on Prj_HuskBeeAOECloud_C_BndEvt__BeeAntiOverlapArea_K2Node_ComponentBoundEvent_70_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(Prj_HuskBeeAOECloud_C_BndEvt__BeeAntiOverlapArea_K2Node_ComponentBoundEvent_70_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000000, "Member 'Prj_HuskBeeAOECloud_C_BndEvt__BeeAntiOverlapArea_K2Node_ComponentBoundEvent_70_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(Prj_HuskBeeAOECloud_C_BndEvt__BeeAntiOverlapArea_K2Node_ComponentBoundEvent_70_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000004, "Member 'Prj_HuskBeeAOECloud_C_BndEvt__BeeAntiOverlapArea_K2Node_ComponentBoundEvent_70_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(Prj_HuskBeeAOECloud_C_BndEvt__BeeAntiOverlapArea_K2Node_ComponentBoundEvent_70_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000008, "Member 'Prj_HuskBeeAOECloud_C_BndEvt__BeeAntiOverlapArea_K2Node_ComponentBoundEvent_70_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function Prj_HuskBeeAOECloud.Prj_HuskBeeAOECloud_C.BndEvt__BeeAntiOverlapArea_K2Node_ComponentBoundEvent_66_ComponentBeginOverlapSignature__DelegateSignature
// 0x0090 (0x0090 - 0x0000)
struct Prj_HuskBeeAOECloud_C_BndEvt__BeeAntiOverlapArea_K2Node_ComponentBoundEvent_66_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         OtherBodyIndex;                                    // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bFromSweep;                                        // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0010(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(Prj_HuskBeeAOECloud_C_BndEvt__BeeAntiOverlapArea_K2Node_ComponentBoundEvent_66_ComponentBeginOverlapSignature__DelegateSignature) == 0x000004, "Wrong alignment on Prj_HuskBeeAOECloud_C_BndEvt__BeeAntiOverlapArea_K2Node_ComponentBoundEvent_66_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(Prj_HuskBeeAOECloud_C_BndEvt__BeeAntiOverlapArea_K2Node_ComponentBoundEvent_66_ComponentBeginOverlapSignature__DelegateSignature) == 0x000090, "Wrong size on Prj_HuskBeeAOECloud_C_BndEvt__BeeAntiOverlapArea_K2Node_ComponentBoundEvent_66_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(Prj_HuskBeeAOECloud_C_BndEvt__BeeAntiOverlapArea_K2Node_ComponentBoundEvent_66_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000000, "Member 'Prj_HuskBeeAOECloud_C_BndEvt__BeeAntiOverlapArea_K2Node_ComponentBoundEvent_66_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(Prj_HuskBeeAOECloud_C_BndEvt__BeeAntiOverlapArea_K2Node_ComponentBoundEvent_66_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000004, "Member 'Prj_HuskBeeAOECloud_C_BndEvt__BeeAntiOverlapArea_K2Node_ComponentBoundEvent_66_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(Prj_HuskBeeAOECloud_C_BndEvt__BeeAntiOverlapArea_K2Node_ComponentBoundEvent_66_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000008, "Member 'Prj_HuskBeeAOECloud_C_BndEvt__BeeAntiOverlapArea_K2Node_ComponentBoundEvent_66_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Prj_HuskBeeAOECloud_C_BndEvt__BeeAntiOverlapArea_K2Node_ComponentBoundEvent_66_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00000C, "Member 'Prj_HuskBeeAOECloud_C_BndEvt__BeeAntiOverlapArea_K2Node_ComponentBoundEvent_66_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(Prj_HuskBeeAOECloud_C_BndEvt__BeeAntiOverlapArea_K2Node_ComponentBoundEvent_66_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000010, "Member 'Prj_HuskBeeAOECloud_C_BndEvt__BeeAntiOverlapArea_K2Node_ComponentBoundEvent_66_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function Prj_HuskBeeAOECloud.Prj_HuskBeeAOECloud_C.BndEvt__BeeArea_K2Node_ComponentBoundEvent_73_ComponentEndOverlapSignature__DelegateSignature
// 0x000C (0x000C - 0x0000)
struct Prj_HuskBeeAOECloud_C_BndEvt__BeeArea_K2Node_ComponentBoundEvent_73_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         OtherBodyIndex;                                    // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prj_HuskBeeAOECloud_C_BndEvt__BeeArea_K2Node_ComponentBoundEvent_73_ComponentEndOverlapSignature__DelegateSignature) == 0x000004, "Wrong alignment on Prj_HuskBeeAOECloud_C_BndEvt__BeeArea_K2Node_ComponentBoundEvent_73_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(Prj_HuskBeeAOECloud_C_BndEvt__BeeArea_K2Node_ComponentBoundEvent_73_ComponentEndOverlapSignature__DelegateSignature) == 0x00000C, "Wrong size on Prj_HuskBeeAOECloud_C_BndEvt__BeeArea_K2Node_ComponentBoundEvent_73_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(Prj_HuskBeeAOECloud_C_BndEvt__BeeArea_K2Node_ComponentBoundEvent_73_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000000, "Member 'Prj_HuskBeeAOECloud_C_BndEvt__BeeArea_K2Node_ComponentBoundEvent_73_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(Prj_HuskBeeAOECloud_C_BndEvt__BeeArea_K2Node_ComponentBoundEvent_73_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000004, "Member 'Prj_HuskBeeAOECloud_C_BndEvt__BeeArea_K2Node_ComponentBoundEvent_73_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(Prj_HuskBeeAOECloud_C_BndEvt__BeeArea_K2Node_ComponentBoundEvent_73_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000008, "Member 'Prj_HuskBeeAOECloud_C_BndEvt__BeeArea_K2Node_ComponentBoundEvent_73_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function Prj_HuskBeeAOECloud.Prj_HuskBeeAOECloud_C.OnTouched
// 0x0088 (0x0088 - 0x0000)
struct Prj_HuskBeeAOECloud_C_OnTouched final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             HitResult;                                         // 0x0008(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(Prj_HuskBeeAOECloud_C_OnTouched) == 0x000004, "Wrong alignment on Prj_HuskBeeAOECloud_C_OnTouched");
static_assert(sizeof(Prj_HuskBeeAOECloud_C_OnTouched) == 0x000088, "Wrong size on Prj_HuskBeeAOECloud_C_OnTouched");
static_assert(offsetof(Prj_HuskBeeAOECloud_C_OnTouched, OtherActor) == 0x000000, "Member 'Prj_HuskBeeAOECloud_C_OnTouched::OtherActor' has a wrong offset!");
static_assert(offsetof(Prj_HuskBeeAOECloud_C_OnTouched, OtherComp) == 0x000004, "Member 'Prj_HuskBeeAOECloud_C_OnTouched::OtherComp' has a wrong offset!");
static_assert(offsetof(Prj_HuskBeeAOECloud_C_OnTouched, HitResult) == 0x000008, "Member 'Prj_HuskBeeAOECloud_C_OnTouched::HitResult' has a wrong offset!");

}

#pragma pack(pop)
