#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ProjectileHuskPropane

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass ProjectileHuskPropane.ProjectileHuskPropane_C
// 0x0088 (0x04A0 - 0x0418)
class AProjectileHuskPropane_C final : public AFortProjectileBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0418(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        PropaneHiss;                                       // 0x041C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UParticleSystemComponent*               ProjectileParticleSystem;                          // 0x0420(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   PropaneTank;                                       // 0x0424(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	float                                         ExpandBeforeExplosion_Scale_D8D32F5C461720AD3E80E0AFA0C35A66; // 0x0428(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ETimelineDirection                            ExpandBeforeExplosion__Direction_D8D32F5C461720AD3E80E0AFA0C35A66; // 0x042C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42D[0x3];                                      // 0x042D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     ExpandBeforeExplosion;                             // 0x0430(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         TankWiggle_Scale_D15B7C104FC1BC0812E244B2C6229DE6; // 0x0434(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ETimelineDirection                            TankWiggle__Direction_D15B7C104FC1BC0812E244B2C6229DE6; // 0x0438(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_439[0x3];                                      // 0x0439(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     TankWiggle;                                        // 0x043C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UMaterialInstanceDynamic*               Trail_Material;                                    // 0x0440(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class ABuildingSMActor*                       MyBaseMesh;                                        // 0x0444(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Dropped;                                           // 0x0448(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	bool                                          IsDestroyed;                                       // 0x0449(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	uint8                                         Pad_44A[0x2];                                      // 0x044A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                VelocityWhenDropped;                               // 0x044C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          MeleeDrop;                                         // 0x0458(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_459[0x3];                                      // 0x0459(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                MeleeDropVector;                                   // 0x045C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class USoundBase*                             ExplosionSound;                                    // 0x0468(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	int32                                         TankShotsToExplode;                                // 0x046C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         DamageDealt;                                       // 0x0470(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class AController*                            DamageInstigatedBy;                                // 0x0474(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	int32                                         TankShotsToExplodeProgress;                        // 0x0478(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	bool                                          TankOnGround;                                      // 0x047C(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	bool                                          MeleeThrowsTank;                                   // 0x047D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_47E[0x2];                                      // 0x047E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 DamageCauser;                                      // 0x0480(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	EFortTeam                                     DamageInstigatorTeam;                              // 0x0484(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_485[0x3];                                      // 0x0485(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        ExplosionEffect;                                   // 0x0488(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                ExplosionEffectScale;                              // 0x048C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class USoundBase*                             BounceSound;                                       // 0x0498(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class USoundBase*                             SoundBeforeExplode;                                // 0x049C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_ProjectileHuskPropane(int32 EntryPoint);
	void ExpandThenExplode();
	void AIKnowsTankHasDropped();
	void ExplodeNow();
	void DelayExplosion_();
	void TankBaseDestroyed();
	void NotMeleeDamage();
	void CheckDamageType();
	void ShotgunTimeout();
	void TankForceFXOn();
	void OnTankTakeDamage();
	void MyBaseDied(EEndPlayReason EndPlayReason);
	void RemindAI();
	void DropOrExplodeTank(bool Drop, bool MeleeDrop_0, class AActor* DamageCauser_0);
	void BaseTookDamage(float Damage, const class UDamageType* DamageType, class AController* InstigatedBy, class AActor* DamageCauser_0);
	void OnStop(const struct FHitResult& Hit);
	void ReceiveAnyDamage(float Damage, const class UDamageType* DamageType, class AController* InstigatedBy, class AActor* DamageCauser_0);
	void OnBounce(const struct FHitResult& Hit);
	void ExpandBeforeExplosion__UpdateFunc();
	void ExpandBeforeExplosion__FinishedFunc();
	void TankWiggle__UpdateFunc();
	void TankWiggle__FinishedFunc();
	void UserConstructionScript();
	void OnRep_IsDestroyed();
	void OnRep_Dropped();
	void OnRep_TankShotsToExplodeProgress();
	void OnRep_TankOnGround();
	void SetTankInBT(class UObject* ObjectToPassToBT, class UObject** ObjectPassedToBT);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ProjectileHuskPropane_C">();
	}
	static class AProjectileHuskPropane_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProjectileHuskPropane_C>();
	}
};
static_assert(alignof(AProjectileHuskPropane_C) == 0x000004, "Wrong alignment on AProjectileHuskPropane_C");
static_assert(sizeof(AProjectileHuskPropane_C) == 0x0004A0, "Wrong size on AProjectileHuskPropane_C");
static_assert(offsetof(AProjectileHuskPropane_C, UberGraphFrame) == 0x000418, "Member 'AProjectileHuskPropane_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AProjectileHuskPropane_C, PropaneHiss) == 0x00041C, "Member 'AProjectileHuskPropane_C::PropaneHiss' has a wrong offset!");
static_assert(offsetof(AProjectileHuskPropane_C, ProjectileParticleSystem) == 0x000420, "Member 'AProjectileHuskPropane_C::ProjectileParticleSystem' has a wrong offset!");
static_assert(offsetof(AProjectileHuskPropane_C, PropaneTank) == 0x000424, "Member 'AProjectileHuskPropane_C::PropaneTank' has a wrong offset!");
static_assert(offsetof(AProjectileHuskPropane_C, ExpandBeforeExplosion_Scale_D8D32F5C461720AD3E80E0AFA0C35A66) == 0x000428, "Member 'AProjectileHuskPropane_C::ExpandBeforeExplosion_Scale_D8D32F5C461720AD3E80E0AFA0C35A66' has a wrong offset!");
static_assert(offsetof(AProjectileHuskPropane_C, ExpandBeforeExplosion__Direction_D8D32F5C461720AD3E80E0AFA0C35A66) == 0x00042C, "Member 'AProjectileHuskPropane_C::ExpandBeforeExplosion__Direction_D8D32F5C461720AD3E80E0AFA0C35A66' has a wrong offset!");
static_assert(offsetof(AProjectileHuskPropane_C, ExpandBeforeExplosion) == 0x000430, "Member 'AProjectileHuskPropane_C::ExpandBeforeExplosion' has a wrong offset!");
static_assert(offsetof(AProjectileHuskPropane_C, TankWiggle_Scale_D15B7C104FC1BC0812E244B2C6229DE6) == 0x000434, "Member 'AProjectileHuskPropane_C::TankWiggle_Scale_D15B7C104FC1BC0812E244B2C6229DE6' has a wrong offset!");
static_assert(offsetof(AProjectileHuskPropane_C, TankWiggle__Direction_D15B7C104FC1BC0812E244B2C6229DE6) == 0x000438, "Member 'AProjectileHuskPropane_C::TankWiggle__Direction_D15B7C104FC1BC0812E244B2C6229DE6' has a wrong offset!");
static_assert(offsetof(AProjectileHuskPropane_C, TankWiggle) == 0x00043C, "Member 'AProjectileHuskPropane_C::TankWiggle' has a wrong offset!");
static_assert(offsetof(AProjectileHuskPropane_C, Trail_Material) == 0x000440, "Member 'AProjectileHuskPropane_C::Trail_Material' has a wrong offset!");
static_assert(offsetof(AProjectileHuskPropane_C, MyBaseMesh) == 0x000444, "Member 'AProjectileHuskPropane_C::MyBaseMesh' has a wrong offset!");
static_assert(offsetof(AProjectileHuskPropane_C, Dropped) == 0x000448, "Member 'AProjectileHuskPropane_C::Dropped' has a wrong offset!");
static_assert(offsetof(AProjectileHuskPropane_C, IsDestroyed) == 0x000449, "Member 'AProjectileHuskPropane_C::IsDestroyed' has a wrong offset!");
static_assert(offsetof(AProjectileHuskPropane_C, VelocityWhenDropped) == 0x00044C, "Member 'AProjectileHuskPropane_C::VelocityWhenDropped' has a wrong offset!");
static_assert(offsetof(AProjectileHuskPropane_C, MeleeDrop) == 0x000458, "Member 'AProjectileHuskPropane_C::MeleeDrop' has a wrong offset!");
static_assert(offsetof(AProjectileHuskPropane_C, MeleeDropVector) == 0x00045C, "Member 'AProjectileHuskPropane_C::MeleeDropVector' has a wrong offset!");
static_assert(offsetof(AProjectileHuskPropane_C, ExplosionSound) == 0x000468, "Member 'AProjectileHuskPropane_C::ExplosionSound' has a wrong offset!");
static_assert(offsetof(AProjectileHuskPropane_C, TankShotsToExplode) == 0x00046C, "Member 'AProjectileHuskPropane_C::TankShotsToExplode' has a wrong offset!");
static_assert(offsetof(AProjectileHuskPropane_C, DamageDealt) == 0x000470, "Member 'AProjectileHuskPropane_C::DamageDealt' has a wrong offset!");
static_assert(offsetof(AProjectileHuskPropane_C, DamageInstigatedBy) == 0x000474, "Member 'AProjectileHuskPropane_C::DamageInstigatedBy' has a wrong offset!");
static_assert(offsetof(AProjectileHuskPropane_C, TankShotsToExplodeProgress) == 0x000478, "Member 'AProjectileHuskPropane_C::TankShotsToExplodeProgress' has a wrong offset!");
static_assert(offsetof(AProjectileHuskPropane_C, TankOnGround) == 0x00047C, "Member 'AProjectileHuskPropane_C::TankOnGround' has a wrong offset!");
static_assert(offsetof(AProjectileHuskPropane_C, MeleeThrowsTank) == 0x00047D, "Member 'AProjectileHuskPropane_C::MeleeThrowsTank' has a wrong offset!");
static_assert(offsetof(AProjectileHuskPropane_C, DamageCauser) == 0x000480, "Member 'AProjectileHuskPropane_C::DamageCauser' has a wrong offset!");
static_assert(offsetof(AProjectileHuskPropane_C, DamageInstigatorTeam) == 0x000484, "Member 'AProjectileHuskPropane_C::DamageInstigatorTeam' has a wrong offset!");
static_assert(offsetof(AProjectileHuskPropane_C, ExplosionEffect) == 0x000488, "Member 'AProjectileHuskPropane_C::ExplosionEffect' has a wrong offset!");
static_assert(offsetof(AProjectileHuskPropane_C, ExplosionEffectScale) == 0x00048C, "Member 'AProjectileHuskPropane_C::ExplosionEffectScale' has a wrong offset!");
static_assert(offsetof(AProjectileHuskPropane_C, BounceSound) == 0x000498, "Member 'AProjectileHuskPropane_C::BounceSound' has a wrong offset!");
static_assert(offsetof(AProjectileHuskPropane_C, SoundBeforeExplode) == 0x00049C, "Member 'AProjectileHuskPropane_C::SoundBeforeExplode' has a wrong offset!");

}

#pragma pack(pop)
