#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ProjectileHuskPropane

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function ProjectileHuskPropane.ProjectileHuskPropane_C.ExecuteUbergraph_ProjectileHuskPropane
// 0x037C (0x037C - 0x0000)
struct ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable2;                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable2;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_Event_Hit2;                                 // 0x000C(0x0080)(ConstParm, ContainsInstancedReference)
	float                                         K2Node_Event_Damage;                               // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	const class UDamageType*                      K2Node_Event_DamageType;                           // 0x0090(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AController*                            K2Node_Event_InstigatedBy;                         // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortTeam                                     CallFunc_GetActorTeam_ReturnValue;                 // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x00AC(0x0080)(ConstParm, ContainsInstancedReference)
	float                                         K2Node_CustomEvent_Damage;                         // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	const class UDamageType*                      K2Node_CustomEvent_DamageType;                     // 0x0130(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AController*                            K2Node_CustomEvent_InstigatedBy;                   // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_CustomEvent_DamageCauser2;                  // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x013D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13E[0x2];                                      // 0x013E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0144(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0150(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x015C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0168(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x018C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0198(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ABuildingSMActor*                       K2Node_DynamicCast_AsBuilding_SMActor;             // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A9[0x3];                                      // 0x01A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetHealth_ReturnValue;                    // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x01B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B3[0x1];                                      // 0x01B3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x01B4(0x0004)()
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable3;                // 0x01BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1BD[0x3];                                      // 0x01BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x01C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x01D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D6[0x2];                                      // 0x01D6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x01DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1DD[0x3];                                      // 0x01DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_SetTankInBT_ObjectPassedToBT;             // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_Drop;                           // 0x01E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_MeleeDrop;                      // 0x01E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E6[0x2];                                      // 0x01E6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_DamageCauser;                   // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue2;         // 0x01EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_RandomFloatInRange_ReturnValue2;          // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEndPlayReason                                K2Node_CustomEvent_EndPlayReason;                  // 0x01FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_IsTimerActive_ReturnValue;             // 0x01FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x01FE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable3;                      // 0x01FF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue3;                 // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0202(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_203[0x1];                                      // 0x0203(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue4;                 // 0x020C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable4;                      // 0x020D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_20E[0x2];                                      // 0x020E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    K2Node_DynamicCast_AsPrimitive_Component;          // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue2;         // 0x0219(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21A[0x2];                                      // 0x021A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EEndPlayReason EndPlayReason)> K2Node_CreateDelegate_OutputDelegate;              // 0x021C(0x0010)(ZeroConstructor, NoDestructor)
	class UObject*                                CallFunc_SetTankInBT_ObjectPassedToBT2;            // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AController*                            CallFunc_GetInstigatorController_ReturnValue;      // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AProjectileHuskPropane_C*               K2Node_DynamicCast_AsProjectile_Husk_Propane;      // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortTeam                                     CallFunc_GetActorTeam_ReturnValue2;                // 0x0239(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23A[0x2];                                      // 0x023A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue2;                 // 0x023C(0x0004)()
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue2;        // 0x0240(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UObject*                                CallFunc_SetTankInBT_ObjectPassedToBT3;            // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(float Damage, const class UDamageType* DamageType, class AController* InstigatedBy, class AActor* DamageCauser)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0250(0x0010)(ZeroConstructor, NoDestructor)
	class UObject*                                CallFunc_SetTankInBT_ObjectPassedToBT4;            // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue2;          // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable4;                // 0x026C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26D[0x3];                                      // 0x026D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue2;               // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x027C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27D[0x3];                                      // 0x027D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue;                // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UObject*                                CallFunc_GetValueAsObject_ReturnValue;             // 0x0284(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x0289(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_28A[0x2];                                      // 0x028A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_MakeLiteralName_ReturnValue2;             // 0x028C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue3;                  // 0x0294(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_295[0x3];                                      // 0x0295(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue3;               // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue2;       // 0x029C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29D[0x3];                                      // 0x029D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue2;               // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UObject*                                CallFunc_GetValueAsObject_ReturnValue2;            // 0x02A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue2;     // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue4;                  // 0x02A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue5;                  // 0x02AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2AB[0x1];                                      // 0x02AB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue3;         // 0x02AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue4;         // 0x02B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x02C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue4;               // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X;                            // 0x02D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Y;                            // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Z;                            // 0x02DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue5;         // 0x02E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x02EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue2;       // 0x02F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0304(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X2;                           // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Y2;                           // 0x0314(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Z2;                           // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X3;                           // 0x031C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Y3;                           // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Z3;                           // 0x0324(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue2;                  // 0x0328(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue3;                  // 0x0334(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Normal_ReturnValue2;                      // 0x0340(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Normal_ReturnValue3;                      // 0x034C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x0358(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue3;        // 0x0364(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_SelectVector_ReturnValue2;                // 0x0370(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane) == 0x000004, "Wrong alignment on ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane");
static_assert(sizeof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane) == 0x00037C, "Wrong size on ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, EntryPoint) == 0x000000, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::EntryPoint' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, Temp_bool_Has_Been_Initd_Variable) == 0x000004, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, Temp_bool_IsClosed_Variable) == 0x000005, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, Temp_bool_Has_Been_Initd_Variable2) == 0x000006, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::Temp_bool_Has_Been_Initd_Variable2' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, CallFunc_IsDedicatedServer_ReturnValue) == 0x000007, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, Temp_bool_Variable) == 0x000008, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, Temp_bool_IsClosed_Variable2) == 0x000009, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::Temp_bool_IsClosed_Variable2' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, K2Node_Event_Hit2) == 0x00000C, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::K2Node_Event_Hit2' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, K2Node_Event_Damage) == 0x00008C, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, K2Node_Event_DamageType) == 0x000090, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::K2Node_Event_DamageType' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, K2Node_Event_InstigatedBy) == 0x000094, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::K2Node_Event_InstigatedBy' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, K2Node_Event_DamageCauser) == 0x000098, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::K2Node_Event_DamageCauser' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00009C, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, CallFunc_GetActorTeam_ReturnValue) == 0x0000A8, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::CallFunc_GetActorTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, K2Node_Event_Hit) == 0x0000AC, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, K2Node_CustomEvent_Damage) == 0x00012C, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::K2Node_CustomEvent_Damage' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, K2Node_CustomEvent_DamageType) == 0x000130, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::K2Node_CustomEvent_DamageType' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, K2Node_CustomEvent_InstigatedBy) == 0x000134, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::K2Node_CustomEvent_InstigatedBy' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, K2Node_CustomEvent_DamageCauser2) == 0x000138, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::K2Node_CustomEvent_DamageCauser2' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, CallFunc_BreakHitResult_bBlockingHit) == 0x00013C, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, CallFunc_BreakHitResult_bInitialOverlap) == 0x00013D, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, CallFunc_BreakHitResult_Time) == 0x000140, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, CallFunc_BreakHitResult_Location) == 0x000144, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, CallFunc_BreakHitResult_ImpactPoint) == 0x000150, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, CallFunc_BreakHitResult_Normal) == 0x00015C, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, CallFunc_BreakHitResult_ImpactNormal) == 0x000168, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, CallFunc_BreakHitResult_PhysMat) == 0x000174, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, CallFunc_BreakHitResult_HitActor) == 0x000178, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, CallFunc_BreakHitResult_HitComponent) == 0x00017C, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, CallFunc_BreakHitResult_HitBoneName) == 0x000180, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, CallFunc_BreakHitResult_HitItem) == 0x000188, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, CallFunc_BreakHitResult_TraceStart) == 0x00018C, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, CallFunc_BreakHitResult_TraceEnd) == 0x000198, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, K2Node_DynamicCast_AsBuilding_SMActor) == 0x0001A4, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::K2Node_DynamicCast_AsBuilding_SMActor' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, K2Node_DynamicCast_bSuccess) == 0x0001A8, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, CallFunc_GetHealth_ReturnValue) == 0x0001AC, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::CallFunc_GetHealth_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x0001B0, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x0001B1, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, CallFunc_BooleanOR_ReturnValue) == 0x0001B2, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, CallFunc_K2_SetTimer_ReturnValue) == 0x0001B4, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, CallFunc_RandomFloatInRange_ReturnValue) == 0x0001B8, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, Temp_bool_Has_Been_Initd_Variable3) == 0x0001BC, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::Temp_bool_Has_Been_Initd_Variable3' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0001C0, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, CallFunc_GetInstigator_ReturnValue) == 0x0001CC, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, K2Node_DynamicCast_AsFort_Pawn) == 0x0001D0, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::K2Node_DynamicCast_AsFort_Pawn' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, K2Node_DynamicCast_bSuccess2) == 0x0001D4, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, CallFunc_Not_PreBool_ReturnValue) == 0x0001D5, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, CallFunc_GetController_ReturnValue) == 0x0001D8, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0001DC, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, CallFunc_SetTankInBT_ObjectPassedToBT) == 0x0001E0, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::CallFunc_SetTankInBT_ObjectPassedToBT' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, K2Node_CustomEvent_Drop) == 0x0001E4, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::K2Node_CustomEvent_Drop' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, K2Node_CustomEvent_MeleeDrop) == 0x0001E5, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::K2Node_CustomEvent_MeleeDrop' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, K2Node_CustomEvent_DamageCauser) == 0x0001E8, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::K2Node_CustomEvent_DamageCauser' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, CallFunc_K2_GetActorLocation_ReturnValue2) == 0x0001EC, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::CallFunc_K2_GetActorLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, CallFunc_RandomFloatInRange_ReturnValue2) == 0x0001F8, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::CallFunc_RandomFloatInRange_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, K2Node_CustomEvent_EndPlayReason) == 0x0001FC, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::K2Node_CustomEvent_EndPlayReason' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, CallFunc_K2_IsTimerActive_ReturnValue) == 0x0001FD, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::CallFunc_K2_IsTimerActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, CallFunc_Not_PreBool_ReturnValue2) == 0x0001FE, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::CallFunc_Not_PreBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, Temp_bool_IsClosed_Variable3) == 0x0001FF, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::Temp_bool_IsClosed_Variable3' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000200, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, CallFunc_Not_PreBool_ReturnValue3) == 0x000201, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::CallFunc_Not_PreBool_ReturnValue3' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, CallFunc_BooleanAND_ReturnValue) == 0x000202, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, CallFunc_Add_IntInt_ReturnValue) == 0x000204, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, CallFunc_Subtract_IntInt_ReturnValue) == 0x000208, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, CallFunc_Not_PreBool_ReturnValue4) == 0x00020C, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::CallFunc_Not_PreBool_ReturnValue4' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, Temp_bool_IsClosed_Variable4) == 0x00020D, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::Temp_bool_IsClosed_Variable4' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000210, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, K2Node_DynamicCast_AsPrimitive_Component) == 0x000214, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::K2Node_DynamicCast_AsPrimitive_Component' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, K2Node_DynamicCast_bSuccess3) == 0x000218, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, CallFunc_GreaterEqual_IntInt_ReturnValue2) == 0x000219, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::CallFunc_GreaterEqual_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, K2Node_CreateDelegate_OutputDelegate) == 0x00021C, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, CallFunc_SetTankInBT_ObjectPassedToBT2) == 0x00022C, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::CallFunc_SetTankInBT_ObjectPassedToBT2' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, CallFunc_GetInstigatorController_ReturnValue) == 0x000230, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::CallFunc_GetInstigatorController_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, K2Node_DynamicCast_AsProjectile_Husk_Propane) == 0x000234, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::K2Node_DynamicCast_AsProjectile_Husk_Propane' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, K2Node_DynamicCast_bSuccess4) == 0x000238, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, CallFunc_GetActorTeam_ReturnValue2) == 0x000239, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::CallFunc_GetActorTeam_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, CallFunc_K2_SetTimer_ReturnValue2) == 0x00023C, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::CallFunc_K2_SetTimer_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, CallFunc_Multiply_VectorFloat_ReturnValue2) == 0x000240, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::CallFunc_Multiply_VectorFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, CallFunc_SetTankInBT_ObjectPassedToBT3) == 0x00024C, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::CallFunc_SetTankInBT_ObjectPassedToBT3' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, K2Node_CreateDelegate_OutputDelegate2) == 0x000250, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, CallFunc_SetTankInBT_ObjectPassedToBT4) == 0x000260, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::CallFunc_SetTankInBT_ObjectPassedToBT4' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000264, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, CallFunc_SpawnSoundAttached_ReturnValue2) == 0x000268, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::CallFunc_SpawnSoundAttached_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, Temp_bool_Has_Been_Initd_Variable4) == 0x00026C, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::Temp_bool_Has_Been_Initd_Variable4' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, CallFunc_MakeLiteralName_ReturnValue) == 0x000270, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, CallFunc_GetInstigator_ReturnValue2) == 0x000278, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::CallFunc_GetInstigator_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x00027C, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, CallFunc_GetBlackboard_ReturnValue) == 0x000280, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::CallFunc_GetBlackboard_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, CallFunc_GetValueAsObject_ReturnValue) == 0x000284, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::CallFunc_GetValueAsObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000288, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, CallFunc_BooleanAND_ReturnValue2) == 0x000289, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, CallFunc_MakeLiteralName_ReturnValue2) == 0x00028C, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::CallFunc_MakeLiteralName_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, CallFunc_BooleanAND_ReturnValue3) == 0x000294, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::CallFunc_BooleanAND_ReturnValue3' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, CallFunc_GetInstigator_ReturnValue3) == 0x000298, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::CallFunc_GetInstigator_ReturnValue3' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, CallFunc_NotEqual_ObjectObject_ReturnValue2) == 0x00029C, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::CallFunc_NotEqual_ObjectObject_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, CallFunc_GetBlackboard_ReturnValue2) == 0x0002A0, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::CallFunc_GetBlackboard_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, CallFunc_GetValueAsObject_ReturnValue2) == 0x0002A4, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::CallFunc_GetValueAsObject_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, CallFunc_EqualEqual_ObjectObject_ReturnValue2) == 0x0002A8, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::CallFunc_EqualEqual_ObjectObject_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, CallFunc_BooleanAND_ReturnValue4) == 0x0002A9, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::CallFunc_BooleanAND_ReturnValue4' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, CallFunc_BooleanAND_ReturnValue5) == 0x0002AA, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::CallFunc_BooleanAND_ReturnValue5' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, CallFunc_K2_GetActorLocation_ReturnValue3) == 0x0002AC, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::CallFunc_K2_GetActorLocation_ReturnValue3' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, CallFunc_K2_GetActorLocation_ReturnValue4) == 0x0002B8, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::CallFunc_K2_GetActorLocation_ReturnValue4' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0002C4, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, CallFunc_GetInstigator_ReturnValue4) == 0x0002D0, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::CallFunc_GetInstigator_ReturnValue4' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, CallFunc_BreakVector_X) == 0x0002D4, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, CallFunc_BreakVector_Y) == 0x0002D8, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, CallFunc_BreakVector_Z) == 0x0002DC, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, CallFunc_K2_GetActorLocation_ReturnValue5) == 0x0002E0, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::CallFunc_K2_GetActorLocation_ReturnValue5' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, CallFunc_MakeVector_ReturnValue) == 0x0002EC, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, CallFunc_Subtract_VectorVector_ReturnValue2) == 0x0002F8, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::CallFunc_Subtract_VectorVector_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, CallFunc_Normal_ReturnValue) == 0x000304, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, CallFunc_BreakVector_X2) == 0x000310, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::CallFunc_BreakVector_X2' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, CallFunc_BreakVector_Y2) == 0x000314, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::CallFunc_BreakVector_Y2' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, CallFunc_BreakVector_Z2) == 0x000318, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::CallFunc_BreakVector_Z2' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, CallFunc_BreakVector_X3) == 0x00031C, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::CallFunc_BreakVector_X3' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, CallFunc_BreakVector_Y3) == 0x000320, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::CallFunc_BreakVector_Y3' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, CallFunc_BreakVector_Z3) == 0x000324, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::CallFunc_BreakVector_Z3' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, CallFunc_MakeVector_ReturnValue2) == 0x000328, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::CallFunc_MakeVector_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, CallFunc_MakeVector_ReturnValue3) == 0x000334, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::CallFunc_MakeVector_ReturnValue3' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, CallFunc_Normal_ReturnValue2) == 0x000340, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::CallFunc_Normal_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, CallFunc_Normal_ReturnValue3) == 0x00034C, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::CallFunc_Normal_ReturnValue3' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, CallFunc_SelectVector_ReturnValue) == 0x000358, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, CallFunc_Multiply_VectorFloat_ReturnValue3) == 0x000364, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::CallFunc_Multiply_VectorFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane, CallFunc_SelectVector_ReturnValue2) == 0x000370, "Member 'ProjectileHuskPropane_C_ExecuteUbergraph_ProjectileHuskPropane::CallFunc_SelectVector_ReturnValue2' has a wrong offset!");

// Function ProjectileHuskPropane.ProjectileHuskPropane_C.MyBaseDied
// 0x0001 (0x0001 - 0x0000)
struct ProjectileHuskPropane_C_MyBaseDied final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ProjectileHuskPropane_C_MyBaseDied) == 0x000001, "Wrong alignment on ProjectileHuskPropane_C_MyBaseDied");
static_assert(sizeof(ProjectileHuskPropane_C_MyBaseDied) == 0x000001, "Wrong size on ProjectileHuskPropane_C_MyBaseDied");
static_assert(offsetof(ProjectileHuskPropane_C_MyBaseDied, EndPlayReason) == 0x000000, "Member 'ProjectileHuskPropane_C_MyBaseDied::EndPlayReason' has a wrong offset!");

// Function ProjectileHuskPropane.ProjectileHuskPropane_C.DropOrExplodeTank
// 0x0008 (0x0008 - 0x0000)
struct ProjectileHuskPropane_C_DropOrExplodeTank final
{
public:
	bool                                          Drop;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          MeleeDrop_0;                                       // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 DamageCauser_0;                                    // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ProjectileHuskPropane_C_DropOrExplodeTank) == 0x000004, "Wrong alignment on ProjectileHuskPropane_C_DropOrExplodeTank");
static_assert(sizeof(ProjectileHuskPropane_C_DropOrExplodeTank) == 0x000008, "Wrong size on ProjectileHuskPropane_C_DropOrExplodeTank");
static_assert(offsetof(ProjectileHuskPropane_C_DropOrExplodeTank, Drop) == 0x000000, "Member 'ProjectileHuskPropane_C_DropOrExplodeTank::Drop' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_DropOrExplodeTank, MeleeDrop_0) == 0x000001, "Member 'ProjectileHuskPropane_C_DropOrExplodeTank::MeleeDrop_0' has a wrong offset!");
static_assert(offsetof(ProjectileHuskPropane_C_DropOrExplodeTank, DamageCauser_0) == 0x000004, "Member 'ProjectileHuskPropane_C_DropOrExplodeTank::DamageCauser_0' has a wrong offset!");

// Function ProjectileHuskPropane.ProjectileHuskPropane_C.BaseTookDamage
// 0x0010 (0x0010 - 0x0000)
struct ProjectileHuskPropane_C_BaseTookDamage final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
