#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Projectile_Trap_Turret

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass Projectile_Trap_Turret.Projectile_Trap_Turret_C
// 0x0020 (0x0438 - 0x0418)
class AProjectile_Trap_Turret_C final : public AFortProjectileBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0418(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        LobberProjLoopingSound;                            // 0x041C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UParticleSystemComponent*               ProjectileParticleSystem;                          // 0x0420(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	float                                         Timeline_0_Fade_85A405EC457E196D3D0248BA83D5145F;  // 0x0424(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ETimelineDirection                            Timeline_0__Direction_85A405EC457E196D3D0248BA83D5145F; // 0x0428(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_429[0x3];                                      // 0x0429(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x042C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UMaterialInstanceDynamic*               Trail_Material;                                    // 0x0430(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UParticleSystem*                        Effect_Explosion;                                  // 0x0434(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_Projectile_Trap_Turret(int32 EntryPoint);
	void ReceiveHit(class UPrimitiveComponent* MyComp, class AActor* Other, class UPrimitiveComponent* OtherComp, bool bSelfMoved, const struct FVector& HitLocation, const struct FVector& HitNormal, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Projectile_Trap_Turret_C">();
	}
	static class AProjectile_Trap_Turret_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProjectile_Trap_Turret_C>();
	}
};
static_assert(alignof(AProjectile_Trap_Turret_C) == 0x000004, "Wrong alignment on AProjectile_Trap_Turret_C");
static_assert(sizeof(AProjectile_Trap_Turret_C) == 0x000438, "Wrong size on AProjectile_Trap_Turret_C");
static_assert(offsetof(AProjectile_Trap_Turret_C, UberGraphFrame) == 0x000418, "Member 'AProjectile_Trap_Turret_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AProjectile_Trap_Turret_C, LobberProjLoopingSound) == 0x00041C, "Member 'AProjectile_Trap_Turret_C::LobberProjLoopingSound' has a wrong offset!");
static_assert(offsetof(AProjectile_Trap_Turret_C, ProjectileParticleSystem) == 0x000420, "Member 'AProjectile_Trap_Turret_C::ProjectileParticleSystem' has a wrong offset!");
static_assert(offsetof(AProjectile_Trap_Turret_C, Timeline_0_Fade_85A405EC457E196D3D0248BA83D5145F) == 0x000424, "Member 'AProjectile_Trap_Turret_C::Timeline_0_Fade_85A405EC457E196D3D0248BA83D5145F' has a wrong offset!");
static_assert(offsetof(AProjectile_Trap_Turret_C, Timeline_0__Direction_85A405EC457E196D3D0248BA83D5145F) == 0x000428, "Member 'AProjectile_Trap_Turret_C::Timeline_0__Direction_85A405EC457E196D3D0248BA83D5145F' has a wrong offset!");
static_assert(offsetof(AProjectile_Trap_Turret_C, Timeline_0) == 0x00042C, "Member 'AProjectile_Trap_Turret_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(AProjectile_Trap_Turret_C, Trail_Material) == 0x000430, "Member 'AProjectile_Trap_Turret_C::Trail_Material' has a wrong offset!");
static_assert(offsetof(AProjectile_Trap_Turret_C, Effect_Explosion) == 0x000434, "Member 'AProjectile_Trap_Turret_C::Effect_Explosion' has a wrong offset!");

}

#pragma pack(pop)
