#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Projectile_Trap_Turret

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function Projectile_Trap_Turret.Projectile_Trap_Turret_C.ExecuteUbergraph_Projectile_Trap_Turret
// 0x0114 (0x0114 - 0x0000)
struct Projectile_Trap_Turret_C_ExecuteUbergraph_Projectile_Trap_Turret final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_Event_MyComp;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_Event_Other;                                // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    K2Node_Event_OtherComp;                            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bSelfMoved;                           // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_HitLocation;                          // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                K2Node_Event_HitNormal;                            // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                K2Node_Event_NormalImpulse;                        // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x003C(0x0080)(ConstParm, ContainsInstancedReference)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x00C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X;                            // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Y;                            // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Z;                            // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue2;                  // 0x00E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x00EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Cross_VectorVector_ReturnValue;           // 0x00F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotationFromAxes_ReturnValue;         // 0x0104(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Projectile_Trap_Turret_C_ExecuteUbergraph_Projectile_Trap_Turret) == 0x000004, "Wrong alignment on Projectile_Trap_Turret_C_ExecuteUbergraph_Projectile_Trap_Turret");
static_assert(sizeof(Projectile_Trap_Turret_C_ExecuteUbergraph_Projectile_Trap_Turret) == 0x000114, "Wrong size on Projectile_Trap_Turret_C_ExecuteUbergraph_Projectile_Trap_Turret");
static_assert(offsetof(Projectile_Trap_Turret_C_ExecuteUbergraph_Projectile_Trap_Turret, EntryPoint) == 0x000000, "Member 'Projectile_Trap_Turret_C_ExecuteUbergraph_Projectile_Trap_Turret::EntryPoint' has a wrong offset!");
static_assert(offsetof(Projectile_Trap_Turret_C_ExecuteUbergraph_Projectile_Trap_Turret, CallFunc_IsDedicatedServer_ReturnValue) == 0x000004, "Member 'Projectile_Trap_Turret_C_ExecuteUbergraph_Projectile_Trap_Turret::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Projectile_Trap_Turret_C_ExecuteUbergraph_Projectile_Trap_Turret, K2Node_Event_MyComp) == 0x000008, "Member 'Projectile_Trap_Turret_C_ExecuteUbergraph_Projectile_Trap_Turret::K2Node_Event_MyComp' has a wrong offset!");
static_assert(offsetof(Projectile_Trap_Turret_C_ExecuteUbergraph_Projectile_Trap_Turret, K2Node_Event_Other) == 0x00000C, "Member 'Projectile_Trap_Turret_C_ExecuteUbergraph_Projectile_Trap_Turret::K2Node_Event_Other' has a wrong offset!");
static_assert(offsetof(Projectile_Trap_Turret_C_ExecuteUbergraph_Projectile_Trap_Turret, K2Node_Event_OtherComp) == 0x000010, "Member 'Projectile_Trap_Turret_C_ExecuteUbergraph_Projectile_Trap_Turret::K2Node_Event_OtherComp' has a wrong offset!");
static_assert(offsetof(Projectile_Trap_Turret_C_ExecuteUbergraph_Projectile_Trap_Turret, K2Node_Event_bSelfMoved) == 0x000014, "Member 'Projectile_Trap_Turret_C_ExecuteUbergraph_Projectile_Trap_Turret::K2Node_Event_bSelfMoved' has a wrong offset!");
static_assert(offsetof(Projectile_Trap_Turret_C_ExecuteUbergraph_Projectile_Trap_Turret, K2Node_Event_HitLocation) == 0x000018, "Member 'Projectile_Trap_Turret_C_ExecuteUbergraph_Projectile_Trap_Turret::K2Node_Event_HitLocation' has a wrong offset!");
static_assert(offsetof(Projectile_Trap_Turret_C_ExecuteUbergraph_Projectile_Trap_Turret, K2Node_Event_HitNormal) == 0x000024, "Member 'Projectile_Trap_Turret_C_ExecuteUbergraph_Projectile_Trap_Turret::K2Node_Event_HitNormal' has a wrong offset!");
static_assert(offsetof(Projectile_Trap_Turret_C_ExecuteUbergraph_Projectile_Trap_Turret, K2Node_Event_NormalImpulse) == 0x000030, "Member 'Projectile_Trap_Turret_C_ExecuteUbergraph_Projectile_Trap_Turret::K2Node_Event_NormalImpulse' has a wrong offset!");
static_assert(offsetof(Projectile_Trap_Turret_C_ExecuteUbergraph_Projectile_Trap_Turret, K2Node_Event_Hit) == 0x00003C, "Member 'Projectile_Trap_Turret_C_ExecuteUbergraph_Projectile_Trap_Turret::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(Projectile_Trap_Turret_C_ExecuteUbergraph_Projectile_Trap_Turret, CallFunc_MakeVector_ReturnValue) == 0x0000BC, "Member 'Projectile_Trap_Turret_C_ExecuteUbergraph_Projectile_Trap_Turret::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Projectile_Trap_Turret_C_ExecuteUbergraph_Projectile_Trap_Turret, CallFunc_GetVelocity_ReturnValue) == 0x0000C8, "Member 'Projectile_Trap_Turret_C_ExecuteUbergraph_Projectile_Trap_Turret::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(Projectile_Trap_Turret_C_ExecuteUbergraph_Projectile_Trap_Turret, CallFunc_BreakVector_X) == 0x0000D4, "Member 'Projectile_Trap_Turret_C_ExecuteUbergraph_Projectile_Trap_Turret::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Projectile_Trap_Turret_C_ExecuteUbergraph_Projectile_Trap_Turret, CallFunc_BreakVector_Y) == 0x0000D8, "Member 'Projectile_Trap_Turret_C_ExecuteUbergraph_Projectile_Trap_Turret::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Projectile_Trap_Turret_C_ExecuteUbergraph_Projectile_Trap_Turret, CallFunc_BreakVector_Z) == 0x0000DC, "Member 'Projectile_Trap_Turret_C_ExecuteUbergraph_Projectile_Trap_Turret::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Projectile_Trap_Turret_C_ExecuteUbergraph_Projectile_Trap_Turret, CallFunc_MakeVector_ReturnValue2) == 0x0000E0, "Member 'Projectile_Trap_Turret_C_ExecuteUbergraph_Projectile_Trap_Turret::CallFunc_MakeVector_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Projectile_Trap_Turret_C_ExecuteUbergraph_Projectile_Trap_Turret, CallFunc_Normal_ReturnValue) == 0x0000EC, "Member 'Projectile_Trap_Turret_C_ExecuteUbergraph_Projectile_Trap_Turret::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(Projectile_Trap_Turret_C_ExecuteUbergraph_Projectile_Trap_Turret, CallFunc_Cross_VectorVector_ReturnValue) == 0x0000F8, "Member 'Projectile_Trap_Turret_C_ExecuteUbergraph_Projectile_Trap_Turret::CallFunc_Cross_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Projectile_Trap_Turret_C_ExecuteUbergraph_Projectile_Trap_Turret, CallFunc_MakeRotationFromAxes_ReturnValue) == 0x000104, "Member 'Projectile_Trap_Turret_C_ExecuteUbergraph_Projectile_Trap_Turret::CallFunc_MakeRotationFromAxes_ReturnValue' has a wrong offset!");
static_assert(offsetof(Projectile_Trap_Turret_C_ExecuteUbergraph_Projectile_Trap_Turret, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000110, "Member 'Projectile_Trap_Turret_C_ExecuteUbergraph_Projectile_Trap_Turret::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");

// Function Projectile_Trap_Turret.Projectile_Trap_Turret_C.ReceiveHit
// 0x00B4 (0x00B4 - 0x0000)
struct Projectile_Trap_Turret_C_ReceiveHit final
{
public:
	class UPrimitiveComponent*                    MyComp;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 Other;                                             // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bSelfMoved;                                        // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                HitLocation;                                       // 0x0010(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                HitNormal;                                         // 0x001C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                NormalImpulse;                                     // 0x0028(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             Hit;                                               // 0x0034(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(Projectile_Trap_Turret_C_ReceiveHit) == 0x000004, "Wrong alignment on Projectile_Trap_Turret_C_ReceiveHit");
static_assert(sizeof(Projectile_Trap_Turret_C_ReceiveHit) == 0x0000B4, "Wrong size on Projectile_Trap_Turret_C_ReceiveHit");
static_assert(offsetof(Projectile_Trap_Turret_C_ReceiveHit, MyComp) == 0x000000, "Member 'Projectile_Trap_Turret_C_ReceiveHit::MyComp' has a wrong offset!");
static_assert(offsetof(Projectile_Trap_Turret_C_ReceiveHit, Other) == 0x000004, "Member 'Projectile_Trap_Turret_C_ReceiveHit::Other' has a wrong offset!");
static_assert(offsetof(Projectile_Trap_Turret_C_ReceiveHit, OtherComp) == 0x000008, "Member 'Projectile_Trap_Turret_C_ReceiveHit::OtherComp' has a wrong offset!");
static_assert(offsetof(Projectile_Trap_Turret_C_ReceiveHit, bSelfMoved) == 0x00000C, "Member 'Projectile_Trap_Turret_C_ReceiveHit::bSelfMoved' has a wrong offset!");
static_assert(offsetof(Projectile_Trap_Turret_C_ReceiveHit, HitLocation) == 0x000010, "Member 'Projectile_Trap_Turret_C_ReceiveHit::HitLocation' has a wrong offset!");
static_assert(offsetof(Projectile_Trap_Turret_C_ReceiveHit, HitNormal) == 0x00001C, "Member 'Projectile_Trap_Turret_C_ReceiveHit::HitNormal' has a wrong offset!");
static_assert(offsetof(Projectile_Trap_Turret_C_ReceiveHit, NormalImpulse) == 0x000028, "Member 'Projectile_Trap_Turret_C_ReceiveHit::NormalImpulse' has a wrong offset!");
static_assert(offsetof(Projectile_Trap_Turret_C_ReceiveHit, Hit) == 0x000034, "Member 'Projectile_Trap_Turret_C_ReceiveHit::Hit' has a wrong offset!");

// Function Projectile_Trap_Turret.Projectile_Trap_Turret_C.UserConstructionScript
// 0x0008 (0x0008 - 0x0000)
struct Projectile_Trap_Turret_C_UserConstructionScript final
{
public:
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Projectile_Trap_Turret_C_UserConstructionScript) == 0x000004, "Wrong alignment on Projectile_Trap_Turret_C_UserConstructionScript");
static_assert(sizeof(Projectile_Trap_Turret_C_UserConstructionScript) == 0x000008, "Wrong size on Projectile_Trap_Turret_C_UserConstructionScript");
static_assert(offsetof(Projectile_Trap_Turret_C_UserConstructionScript, CallFunc_RandomFloatInRange_ReturnValue) == 0x000000, "Member 'Projectile_Trap_Turret_C_UserConstructionScript::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Projectile_Trap_Turret_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000004, "Member 'Projectile_Trap_Turret_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

}

#pragma pack(pop)
