#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_TirePile_03

#include "Basic.hpp"

#include "Prop_TirePile_01_classes.hpp"
#include "Engine_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass Prop_TirePile_03.Prop_TirePile_03_C
// 0x000C (0x0960 - 0x0954)
class AProp_TirePile_03_C final : public AProp_TirePile_01_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Prop_TirePile_03_C;                 // 0x0954(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          Ceiling_0;                                         // 0x0958(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_959[0x3];                                      // 0x0959(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         JumpHeight_0;                                      // 0x095C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_Prop_TirePile_03(int32 EntryPoint);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Prop_TirePile_03_C">();
	}
	static class AProp_TirePile_03_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProp_TirePile_03_C>();
	}
};
static_assert(alignof(AProp_TirePile_03_C) == 0x000004, "Wrong alignment on AProp_TirePile_03_C");
static_assert(sizeof(AProp_TirePile_03_C) == 0x000960, "Wrong size on AProp_TirePile_03_C");
static_assert(offsetof(AProp_TirePile_03_C, UberGraphFrame_Prop_TirePile_03_C) == 0x000954, "Member 'AProp_TirePile_03_C::UberGraphFrame_Prop_TirePile_03_C' has a wrong offset!");
static_assert(offsetof(AProp_TirePile_03_C, Ceiling_0) == 0x000958, "Member 'AProp_TirePile_03_C::Ceiling_0' has a wrong offset!");
static_assert(offsetof(AProp_TirePile_03_C, JumpHeight_0) == 0x00095C, "Member 'AProp_TirePile_03_C::JumpHeight_0' has a wrong offset!");

}

#pragma pack(pop)
