#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_TirePile_01

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass Prop_TirePile_01.Prop_TirePile_01_C
// 0x0010 (0x0954 - 0x0944)
class AProp_TirePile_01_C : public ABuildingProp
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0944(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Jump_Collision;                                    // 0x0948(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	bool                                          Ceiling;                                           // 0x094C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_94D[0x3];                                      // 0x094D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         JumpHeight;                                        // 0x0950(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_Prop_TirePile_01(int32 EntryPoint);
	void OnDamagePlayEffects(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void BndEvt__Jump_Collision_K2Node_ComponentBoundEvent_252_ComponentBeginOverlapSignature__DelegateSignature(class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Prop_TirePile_01_C">();
	}
	static class AProp_TirePile_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProp_TirePile_01_C>();
	}
};
static_assert(alignof(AProp_TirePile_01_C) == 0x000004, "Wrong alignment on AProp_TirePile_01_C");
static_assert(sizeof(AProp_TirePile_01_C) == 0x000954, "Wrong size on AProp_TirePile_01_C");
static_assert(offsetof(AProp_TirePile_01_C, UberGraphFrame) == 0x000944, "Member 'AProp_TirePile_01_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AProp_TirePile_01_C, Jump_Collision) == 0x000948, "Member 'AProp_TirePile_01_C::Jump_Collision' has a wrong offset!");
static_assert(offsetof(AProp_TirePile_01_C, Ceiling) == 0x00094C, "Member 'AProp_TirePile_01_C::Ceiling' has a wrong offset!");
static_assert(offsetof(AProp_TirePile_01_C, JumpHeight) == 0x000950, "Member 'AProp_TirePile_01_C::JumpHeight' has a wrong offset!");

}

#pragma pack(pop)
