#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_HuskHarvester

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function Prop_HuskHarvester.Prop_HuskHarvester_C.ExecuteUbergraph_Prop_HuskHarvester
// 0x0700 (0x0700 - 0x0000)
struct Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable2;                // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable2;                      // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x001C(0x0004)()
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortMissionEvent                      K2Node_Event_MissionEvent;                         // 0x0044(0x006C)(ConstParm)
	const class AFortPawn*                        K2Node_Event_InteractingPawn;                      // 0x00B0(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGuid                                  CallFunc_GetMissionGuid_ReturnValue;               // 0x00B4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_CustomEvent_DamagedActor;                   // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_CustomEvent_Damage;                         // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AController*                            K2Node_CustomEvent_InstigatedBy;                   // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_CustomEvent_DamageCauser;                   // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                K2Node_CustomEvent_HitLocation;                    // 0x00D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    K2Node_CustomEvent_FHitComponent;                  // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   K2Node_CustomEvent_BoneName;                       // 0x00E4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                K2Node_CustomEvent_Momentum;                       // 0x00EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F8[0x8];                                       // 0x00F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_Conv_VectorToTransform_ReturnValue;       // 0x0100(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0130(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortAIPawn*                            K2Node_DynamicCast_AsFort_AIPawn;                  // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x3];                                      // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_ScoreEnemyKill_ScoreOutput;               // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_148[0x8];                                      // 0x0148(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             K2Node_CustomEvent_HitTransform;                   // 0x0150(0x0030)(IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable2;                   // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AProp_HuskHarvester_Attractor_C*        CallFunc_FinishSpawningActor_ReturnValue;          // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGuid                                  K2Node_HandleMissionEvent_MissionGuid2;            // 0x0190(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  K2Node_HandleMissionEvent_ObjectiveHandle2;        // 0x01A0(0x0018)()
	class UFortMissionEventParams*                K2Node_HandleMissionEvent_Params2;                 // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_HandleMissionEvent_DO_NOT_USE_THIS_OR_VARIABLES_BELOW2; // 0x01BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1BD[0x3];                                      // 0x01BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_HandleMissionEvent_EventFocus2;             // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	const class UDataAsset*                       K2Node_HandleMissionEvent_EventContent2;           // 0x01C4(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_HandleMissionEvent_EventInstigator2;        // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         K2Node_HandleMissionEvent_GenericInt2;             // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_HandleMissionEvent_GenericFloat2;           // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FText                                   K2Node_HandleMissionEvent_GenericText2;            // 0x01D4(0x000C)(ConstParm)
	struct FGameplayTagContainer                  K2Node_HandleMissionEvent_GameplayTags2;           // 0x01E0(0x0018)()
	struct FFortMissionEvent                      K2Node_HandleMissionEvent_MissionEvent2;           // 0x01F8(0x006C)(ConstParm)
	struct FGuid                                  CallFunc_GetMissionGuid_ReturnValue2;              // 0x0264(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0274(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         K2Node_CustomEvent_ScoreOutput;                    // 0x0284(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor4;            // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp4;             // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex4;        // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep2;            // 0x0294(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_295[0x3];                                      // 0x0295(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult2;           // 0x0298(0x0080)(ConstParm, ContainsInstancedReference)
	struct FGuid                                  CallFunc_GetMissionGuid_ReturnValue3;              // 0x0318(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x032C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32D[0x3];                                      // 0x032D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  CallFunc_GetMissionGuid_ReturnValue4;              // 0x0330(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGuid                                  CallFunc_GetMissionGuid_ReturnValue5;              // 0x0340(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue3;                  // 0x0350(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0354(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_355[0x3];                                      // 0x0355(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0358(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue2;         // 0x035C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X;                            // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Y;                            // 0x036C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Z;                            // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0374(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0378(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGuid                                  CallFunc_GetMissionGuid_ReturnValue6;              // 0x0384(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors;   // 0x0394(0x000C)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue2;         // 0x03A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A5[0xB];                                      // 0x03A5(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x03B0(0x0030)(IsPlainOldData, NoDestructor)
	struct FGuid                                  K2Node_HandleMissionEvent_MissionGuid;             // 0x03E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  K2Node_HandleMissionEvent_ObjectiveHandle;         // 0x03F0(0x0018)()
	class UFortMissionEventParams*                K2Node_HandleMissionEvent_Params;                  // 0x0408(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_HandleMissionEvent_DO_NOT_USE_THIS_OR_VARIABLES_BELOW; // 0x040C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_40D[0x3];                                      // 0x040D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_HandleMissionEvent_EventFocus;              // 0x0410(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	const class UDataAsset*                       K2Node_HandleMissionEvent_EventContent;            // 0x0414(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_HandleMissionEvent_EventInstigator;         // 0x0418(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         K2Node_HandleMissionEvent_GenericInt;              // 0x041C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_HandleMissionEvent_GenericFloat;            // 0x0420(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FText                                   K2Node_HandleMissionEvent_GenericText;             // 0x0424(0x000C)(ConstParm)
	struct FGameplayTagContainer                  K2Node_HandleMissionEvent_GameplayTags;            // 0x0430(0x0018)()
	struct FFortMissionEvent                      K2Node_HandleMissionEvent_MissionEvent;            // 0x0448(0x006C)(ConstParm)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor3;            // 0x04B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp3;             // 0x04B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex3;        // 0x04BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x04C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C1[0x3];                                      // 0x04C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x04C4(0x0080)(ConstParm, ContainsInstancedReference)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor2;            // 0x0544(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp2;             // 0x0548(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex2;        // 0x054C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortAIPawn*                            K2Node_DynamicCast_AsFort_AIPawn2;                 // 0x0550(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0554(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_555[0x3];                                      // 0x0555(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortAIPawn*                            K2Node_DynamicCast_AsFort_AIPawn3;                 // 0x0558(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x055C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDead_ReturnValue;                       // 0x055D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55E[0x2];                                      // 0x055E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Captured;                       // 0x0560(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         K2Node_CustomEvent_Goal;                           // 0x0564(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0568(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x056C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue2;             // 0x0570(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0574(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0578(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Lerp_ReturnValue2;                        // 0x057C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue2;                  // 0x0580(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x058C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Lerp_ReturnValue3;                        // 0x0598(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x059C(0x0080)(ContainsInstancedReference)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue2;                 // 0x061C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable3;                // 0x0628(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_629[0x3];                                      // 0x0629(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult2;   // 0x062C(0x0080)(ContainsInstancedReference)
	struct FGuid                                  CallFunc_GetMissionGuid_ReturnValue7;              // 0x06AC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x06BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x06C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x06C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn2;            // 0x06C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess5;                      // 0x06CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6CD[0x3];                                      // 0x06CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Clamp_ReturnValue2;                       // 0x06D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable3;                      // 0x06D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D5[0x3];                                      // 0x06D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x06D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x06DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DD[0x3];                                      // 0x06DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x06E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortAIPawn*                            CallFunc_Array_Get_Item;                           // 0x06E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x06E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDead_ReturnValue2;                      // 0x06E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x06EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x06EB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x06EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x06ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6EE[0x2];                                      // 0x06EE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue3;                // 0x06F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_Array_Get_Item2;                          // 0x06F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x06F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F9[0x3];                                      // 0x06F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_AddComponent_ReturnValue;                 // 0x06FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester) == 0x000010, "Wrong alignment on Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester");
static_assert(sizeof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester) == 0x000700, "Wrong size on Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, EntryPoint) == 0x000000, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, Temp_int_Array_Index_Variable) == 0x000004, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, Temp_bool_Has_Been_Initd_Variable) == 0x000008, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, Temp_bool_IsClosed_Variable) == 0x000009, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, Temp_bool_Has_Been_Initd_Variable2) == 0x00000A, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::Temp_bool_Has_Been_Initd_Variable2' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, Temp_bool_IsClosed_Variable2) == 0x00000B, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::Temp_bool_IsClosed_Variable2' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x00001C, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, CallFunc_HasAuthority_ReturnValue) == 0x000020, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, CallFunc_VLerp_ReturnValue) == 0x000024, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, Temp_int_Loop_Counter_Variable) == 0x000030, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, Temp_bool_True_if_break_was_hit_Variable) == 0x000038, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, Temp_int_Array_Index_Variable2) == 0x00003C, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::Temp_int_Array_Index_Variable2' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, CallFunc_Not_PreBool_ReturnValue) == 0x000040, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, K2Node_Event_MissionEvent) == 0x000044, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::K2Node_Event_MissionEvent' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, K2Node_Event_InteractingPawn) == 0x0000B0, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::K2Node_Event_InteractingPawn' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, CallFunc_GetMissionGuid_ReturnValue) == 0x0000B4, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::CallFunc_GetMissionGuid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, K2Node_CustomEvent_DamagedActor) == 0x0000C4, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::K2Node_CustomEvent_DamagedActor' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, K2Node_CustomEvent_Damage) == 0x0000C8, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::K2Node_CustomEvent_Damage' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, K2Node_CustomEvent_InstigatedBy) == 0x0000CC, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::K2Node_CustomEvent_InstigatedBy' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, K2Node_CustomEvent_DamageCauser) == 0x0000D0, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::K2Node_CustomEvent_DamageCauser' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, K2Node_CustomEvent_HitLocation) == 0x0000D4, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::K2Node_CustomEvent_HitLocation' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, K2Node_CustomEvent_FHitComponent) == 0x0000E0, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::K2Node_CustomEvent_FHitComponent' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, K2Node_CustomEvent_BoneName) == 0x0000E4, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::K2Node_CustomEvent_BoneName' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, K2Node_CustomEvent_Momentum) == 0x0000EC, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::K2Node_CustomEvent_Momentum' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, CallFunc_Conv_VectorToTransform_ReturnValue) == 0x000100, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::CallFunc_Conv_VectorToTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000130, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, K2Node_DynamicCast_AsFort_AIPawn) == 0x00013C, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::K2Node_DynamicCast_AsFort_AIPawn' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, K2Node_DynamicCast_bSuccess) == 0x000140, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, CallFunc_ScoreEnemyKill_ScoreOutput) == 0x000144, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::CallFunc_ScoreEnemyKill_ScoreOutput' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, K2Node_CustomEvent_HitTransform) == 0x000150, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::K2Node_CustomEvent_HitTransform' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, Temp_int_Loop_Counter_Variable2) == 0x000180, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::Temp_int_Loop_Counter_Variable2' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000184, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, CallFunc_FinishSpawningActor_ReturnValue) == 0x000188, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, CallFunc_Add_IntInt_ReturnValue2) == 0x00018C, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, K2Node_HandleMissionEvent_MissionGuid2) == 0x000190, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::K2Node_HandleMissionEvent_MissionGuid2' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, K2Node_HandleMissionEvent_ObjectiveHandle2) == 0x0001A0, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::K2Node_HandleMissionEvent_ObjectiveHandle2' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, K2Node_HandleMissionEvent_Params2) == 0x0001B8, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::K2Node_HandleMissionEvent_Params2' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, K2Node_HandleMissionEvent_DO_NOT_USE_THIS_OR_VARIABLES_BELOW2) == 0x0001BC, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::K2Node_HandleMissionEvent_DO_NOT_USE_THIS_OR_VARIABLES_BELOW2' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, K2Node_HandleMissionEvent_EventFocus2) == 0x0001C0, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::K2Node_HandleMissionEvent_EventFocus2' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, K2Node_HandleMissionEvent_EventContent2) == 0x0001C4, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::K2Node_HandleMissionEvent_EventContent2' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, K2Node_HandleMissionEvent_EventInstigator2) == 0x0001C8, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::K2Node_HandleMissionEvent_EventInstigator2' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, K2Node_HandleMissionEvent_GenericInt2) == 0x0001CC, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::K2Node_HandleMissionEvent_GenericInt2' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, K2Node_HandleMissionEvent_GenericFloat2) == 0x0001D0, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::K2Node_HandleMissionEvent_GenericFloat2' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, K2Node_HandleMissionEvent_GenericText2) == 0x0001D4, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::K2Node_HandleMissionEvent_GenericText2' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, K2Node_HandleMissionEvent_GameplayTags2) == 0x0001E0, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::K2Node_HandleMissionEvent_GameplayTags2' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, K2Node_HandleMissionEvent_MissionEvent2) == 0x0001F8, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::K2Node_HandleMissionEvent_MissionEvent2' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, CallFunc_GetMissionGuid_ReturnValue2) == 0x000264, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::CallFunc_GetMissionGuid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, K2Node_CreateDelegate_OutputDelegate2) == 0x000274, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, K2Node_CustomEvent_ScoreOutput) == 0x000284, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::K2Node_CustomEvent_ScoreOutput' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, K2Node_ComponentBoundEvent_OtherActor4) == 0x000288, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::K2Node_ComponentBoundEvent_OtherActor4' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, K2Node_ComponentBoundEvent_OtherComp4) == 0x00028C, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::K2Node_ComponentBoundEvent_OtherComp4' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, K2Node_ComponentBoundEvent_OtherBodyIndex4) == 0x000290, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::K2Node_ComponentBoundEvent_OtherBodyIndex4' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, K2Node_ComponentBoundEvent_bFromSweep2) == 0x000294, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::K2Node_ComponentBoundEvent_bFromSweep2' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, K2Node_ComponentBoundEvent_SweepResult2) == 0x000298, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::K2Node_ComponentBoundEvent_SweepResult2' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, CallFunc_GetMissionGuid_ReturnValue3) == 0x000318, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::CallFunc_GetMissionGuid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000328, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, K2Node_DynamicCast_bSuccess2) == 0x00032C, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, CallFunc_GetMissionGuid_ReturnValue4) == 0x000330, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::CallFunc_GetMissionGuid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, CallFunc_GetMissionGuid_ReturnValue5) == 0x000340, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::CallFunc_GetMissionGuid_ReturnValue5' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, CallFunc_Add_IntInt_ReturnValue3) == 0x000350, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::CallFunc_Add_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000354, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, CallFunc_Clamp_ReturnValue) == 0x000358, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, CallFunc_K2_GetActorLocation_ReturnValue2) == 0x00035C, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::CallFunc_K2_GetActorLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, CallFunc_BreakVector_X) == 0x000368, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, CallFunc_BreakVector_Y) == 0x00036C, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, CallFunc_BreakVector_Z) == 0x000370, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, CallFunc_Add_FloatFloat_ReturnValue) == 0x000374, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, CallFunc_MakeVector_ReturnValue) == 0x000378, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, CallFunc_GetMissionGuid_ReturnValue6) == 0x000384, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::CallFunc_GetMissionGuid_ReturnValue6' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, CallFunc_GetOverlappingActors_OverlappingActors) == 0x000394, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::CallFunc_GetOverlappingActors_OverlappingActors' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, CallFunc_Array_Length_ReturnValue) == 0x0003A0, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, CallFunc_GreaterEqual_IntInt_ReturnValue2) == 0x0003A4, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::CallFunc_GreaterEqual_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, CallFunc_MakeTransform_ReturnValue) == 0x0003B0, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, K2Node_HandleMissionEvent_MissionGuid) == 0x0003E0, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::K2Node_HandleMissionEvent_MissionGuid' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, K2Node_HandleMissionEvent_ObjectiveHandle) == 0x0003F0, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::K2Node_HandleMissionEvent_ObjectiveHandle' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, K2Node_HandleMissionEvent_Params) == 0x000408, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::K2Node_HandleMissionEvent_Params' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, K2Node_HandleMissionEvent_DO_NOT_USE_THIS_OR_VARIABLES_BELOW) == 0x00040C, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::K2Node_HandleMissionEvent_DO_NOT_USE_THIS_OR_VARIABLES_BELOW' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, K2Node_HandleMissionEvent_EventFocus) == 0x000410, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::K2Node_HandleMissionEvent_EventFocus' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, K2Node_HandleMissionEvent_EventContent) == 0x000414, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::K2Node_HandleMissionEvent_EventContent' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, K2Node_HandleMissionEvent_EventInstigator) == 0x000418, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::K2Node_HandleMissionEvent_EventInstigator' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, K2Node_HandleMissionEvent_GenericInt) == 0x00041C, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::K2Node_HandleMissionEvent_GenericInt' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, K2Node_HandleMissionEvent_GenericFloat) == 0x000420, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::K2Node_HandleMissionEvent_GenericFloat' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, K2Node_HandleMissionEvent_GenericText) == 0x000424, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::K2Node_HandleMissionEvent_GenericText' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, K2Node_HandleMissionEvent_GameplayTags) == 0x000430, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::K2Node_HandleMissionEvent_GameplayTags' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, K2Node_HandleMissionEvent_MissionEvent) == 0x000448, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::K2Node_HandleMissionEvent_MissionEvent' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, K2Node_ComponentBoundEvent_OtherActor3) == 0x0004B4, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::K2Node_ComponentBoundEvent_OtherActor3' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, K2Node_ComponentBoundEvent_OtherComp3) == 0x0004B8, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::K2Node_ComponentBoundEvent_OtherComp3' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, K2Node_ComponentBoundEvent_OtherBodyIndex3) == 0x0004BC, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::K2Node_ComponentBoundEvent_OtherBodyIndex3' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, K2Node_ComponentBoundEvent_bFromSweep) == 0x0004C0, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, K2Node_ComponentBoundEvent_SweepResult) == 0x0004C4, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, K2Node_ComponentBoundEvent_OtherActor2) == 0x000544, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::K2Node_ComponentBoundEvent_OtherActor2' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, K2Node_ComponentBoundEvent_OtherComp2) == 0x000548, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::K2Node_ComponentBoundEvent_OtherComp2' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, K2Node_ComponentBoundEvent_OtherBodyIndex2) == 0x00054C, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::K2Node_ComponentBoundEvent_OtherBodyIndex2' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, K2Node_DynamicCast_AsFort_AIPawn2) == 0x000550, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::K2Node_DynamicCast_AsFort_AIPawn2' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, K2Node_DynamicCast_bSuccess3) == 0x000554, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, K2Node_DynamicCast_AsFort_AIPawn3) == 0x000558, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::K2Node_DynamicCast_AsFort_AIPawn3' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, K2Node_DynamicCast_bSuccess4) == 0x00055C, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, CallFunc_IsDead_ReturnValue) == 0x00055D, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::CallFunc_IsDead_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, K2Node_CustomEvent_Captured) == 0x000560, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::K2Node_CustomEvent_Captured' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, K2Node_CustomEvent_Goal) == 0x000564, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::K2Node_CustomEvent_Goal' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000568, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00056C, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, CallFunc_Conv_IntToFloat_ReturnValue2) == 0x000570, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::CallFunc_Conv_IntToFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000574, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, CallFunc_Lerp_ReturnValue) == 0x000578, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, CallFunc_Lerp_ReturnValue2) == 0x00057C, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::CallFunc_Lerp_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, CallFunc_MakeVector_ReturnValue2) == 0x000580, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::CallFunc_MakeVector_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, CallFunc_MakeRotator_ReturnValue) == 0x00058C, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, CallFunc_Lerp_ReturnValue3) == 0x000598, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::CallFunc_Lerp_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x00059C, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, CallFunc_MakeRotator_ReturnValue2) == 0x00061C, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::CallFunc_MakeRotator_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, Temp_bool_Has_Been_Initd_Variable3) == 0x000628, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::Temp_bool_Has_Been_Initd_Variable3' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, CallFunc_K2_SetRelativeRotation_SweepHitResult2) == 0x00062C, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::CallFunc_K2_SetRelativeRotation_SweepHitResult2' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, CallFunc_GetMissionGuid_ReturnValue7) == 0x0006AC, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::CallFunc_GetMissionGuid_ReturnValue7' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, K2Node_ComponentBoundEvent_OtherActor) == 0x0006BC, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, K2Node_ComponentBoundEvent_OtherComp) == 0x0006C0, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x0006C4, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, K2Node_DynamicCast_AsFort_Player_Pawn2) == 0x0006C8, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::K2Node_DynamicCast_AsFort_Player_Pawn2' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, K2Node_DynamicCast_bSuccess5) == 0x0006CC, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::K2Node_DynamicCast_bSuccess5' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, CallFunc_Clamp_ReturnValue2) == 0x0006D0, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::CallFunc_Clamp_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, Temp_bool_IsClosed_Variable3) == 0x0006D4, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::Temp_bool_IsClosed_Variable3' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, CallFunc_Array_Add_ReturnValue) == 0x0006D8, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, CallFunc_Array_RemoveItem_ReturnValue) == 0x0006DC, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, CallFunc_Array_Length_ReturnValue2) == 0x0006E0, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, CallFunc_Array_Get_Item) == 0x0006E4, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, CallFunc_Less_IntInt_ReturnValue) == 0x0006E8, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, CallFunc_IsDead_ReturnValue2) == 0x0006E9, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::CallFunc_IsDead_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, CallFunc_BooleanAND_ReturnValue) == 0x0006EA, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester, CallFunc_IsValid_ReturnValue) == 0x0006EB, "Member 'Prop_HuskHarvester_C_ExecuteUbergraph_Prop_HuskHarvester::CallFunc_IsValid_ReturnValue' has a wrong offset!");
