#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_TirePile_01

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function Prop_TirePile_01.Prop_TirePile_01_C.ExecuteUbergraph_Prop_TirePile_01
// 0x0268 (0x0268 - 0x0000)
struct Prop_TirePile_01_C_ExecuteUbergraph_Prop_TirePile_01 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x002C(0x0080)(ConstParm, ContainsInstancedReference)
	float                                         CallFunc_BreakVector_X;                            // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Y;                            // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Z;                            // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue2;         // 0x00C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x00D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X2;                           // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Y2;                           // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Z2;                           // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Add_FloatFloat_ReturnValue2;              // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue2;                  // 0x0100(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Add_FloatFloat_ReturnValue3;              // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue3;                  // 0x0110(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x011C(0x000C)(ConstParm, ZeroConstructor, ReferenceParm)
	struct FHitResult                             CallFunc_CapsuleTraceSingle_NEW_OutHit;            // 0x0128(0x0080)(ContainsInstancedReference)
	bool                                          CallFunc_CapsuleTraceSingle_NEW_ReturnValue;       // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A9[0x3];                                      // 0x01A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Damage;                               // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  K2Node_Event_DamageTags;                           // 0x01B0(0x0018)(ConstParm)
	struct FVector                                K2Node_Event_Momentum;                             // 0x01C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             K2Node_Event_HitInfo;                              // 0x01D4(0x0080)(ConstParm, ContainsInstancedReference)
	class AFortPawn*                              K2Node_Event_InstigatedBy;                         // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext;                        // 0x025C(0x000C)()
};
static_assert(alignof(Prop_TirePile_01_C_ExecuteUbergraph_Prop_TirePile_01) == 0x000004, "Wrong alignment on Prop_TirePile_01_C_ExecuteUbergraph_Prop_TirePile_01");
static_assert(sizeof(Prop_TirePile_01_C_ExecuteUbergraph_Prop_TirePile_01) == 0x000268, "Wrong size on Prop_TirePile_01_C_ExecuteUbergraph_Prop_TirePile_01");
static_assert(offsetof(Prop_TirePile_01_C_ExecuteUbergraph_Prop_TirePile_01, EntryPoint) == 0x000000, "Member 'Prop_TirePile_01_C_ExecuteUbergraph_Prop_TirePile_01::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_TirePile_01_C_ExecuteUbergraph_Prop_TirePile_01, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000004, "Member 'Prop_TirePile_01_C_ExecuteUbergraph_Prop_TirePile_01::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_TirePile_01_C_ExecuteUbergraph_Prop_TirePile_01, CallFunc_GetVelocity_ReturnValue) == 0x000010, "Member 'Prop_TirePile_01_C_ExecuteUbergraph_Prop_TirePile_01::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_TirePile_01_C_ExecuteUbergraph_Prop_TirePile_01, K2Node_ComponentBoundEvent_OtherActor) == 0x00001C, "Member 'Prop_TirePile_01_C_ExecuteUbergraph_Prop_TirePile_01::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(Prop_TirePile_01_C_ExecuteUbergraph_Prop_TirePile_01, K2Node_ComponentBoundEvent_OtherComp) == 0x000020, "Member 'Prop_TirePile_01_C_ExecuteUbergraph_Prop_TirePile_01::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(Prop_TirePile_01_C_ExecuteUbergraph_Prop_TirePile_01, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000024, "Member 'Prop_TirePile_01_C_ExecuteUbergraph_Prop_TirePile_01::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Prop_TirePile_01_C_ExecuteUbergraph_Prop_TirePile_01, K2Node_ComponentBoundEvent_bFromSweep) == 0x000028, "Member 'Prop_TirePile_01_C_ExecuteUbergraph_Prop_TirePile_01::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(Prop_TirePile_01_C_ExecuteUbergraph_Prop_TirePile_01, K2Node_ComponentBoundEvent_SweepResult) == 0x00002C, "Member 'Prop_TirePile_01_C_ExecuteUbergraph_Prop_TirePile_01::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(Prop_TirePile_01_C_ExecuteUbergraph_Prop_TirePile_01, CallFunc_BreakVector_X) == 0x0000AC, "Member 'Prop_TirePile_01_C_ExecuteUbergraph_Prop_TirePile_01::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Prop_TirePile_01_C_ExecuteUbergraph_Prop_TirePile_01, CallFunc_BreakVector_Y) == 0x0000B0, "Member 'Prop_TirePile_01_C_ExecuteUbergraph_Prop_TirePile_01::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Prop_TirePile_01_C_ExecuteUbergraph_Prop_TirePile_01, CallFunc_BreakVector_Z) == 0x0000B4, "Member 'Prop_TirePile_01_C_ExecuteUbergraph_Prop_TirePile_01::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Prop_TirePile_01_C_ExecuteUbergraph_Prop_TirePile_01, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x0000B8, "Member 'Prop_TirePile_01_C_ExecuteUbergraph_Prop_TirePile_01::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(Prop_TirePile_01_C_ExecuteUbergraph_Prop_TirePile_01, K2Node_DynamicCast_bSuccess) == 0x0000BC, "Member 'Prop_TirePile_01_C_ExecuteUbergraph_Prop_TirePile_01::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Prop_TirePile_01_C_ExecuteUbergraph_Prop_TirePile_01, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000C0, "Member 'Prop_TirePile_01_C_ExecuteUbergraph_Prop_TirePile_01::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_TirePile_01_C_ExecuteUbergraph_Prop_TirePile_01, CallFunc_K2_GetActorLocation_ReturnValue2) == 0x0000C4, "Member 'Prop_TirePile_01_C_ExecuteUbergraph_Prop_TirePile_01::CallFunc_K2_GetActorLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Prop_TirePile_01_C_ExecuteUbergraph_Prop_TirePile_01, CallFunc_K2_GetRootComponent_ReturnValue) == 0x0000D0, "Member 'Prop_TirePile_01_C_ExecuteUbergraph_Prop_TirePile_01::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_TirePile_01_C_ExecuteUbergraph_Prop_TirePile_01, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0000D4, "Member 'Prop_TirePile_01_C_ExecuteUbergraph_Prop_TirePile_01::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_TirePile_01_C_ExecuteUbergraph_Prop_TirePile_01, CallFunc_BreakVector_X2) == 0x0000E0, "Member 'Prop_TirePile_01_C_ExecuteUbergraph_Prop_TirePile_01::CallFunc_BreakVector_X2' has a wrong offset!");
static_assert(offsetof(Prop_TirePile_01_C_ExecuteUbergraph_Prop_TirePile_01, CallFunc_BreakVector_Y2) == 0x0000E4, "Member 'Prop_TirePile_01_C_ExecuteUbergraph_Prop_TirePile_01::CallFunc_BreakVector_Y2' has a wrong offset!");
static_assert(offsetof(Prop_TirePile_01_C_ExecuteUbergraph_Prop_TirePile_01, CallFunc_BreakVector_Z2) == 0x0000E8, "Member 'Prop_TirePile_01_C_ExecuteUbergraph_Prop_TirePile_01::CallFunc_BreakVector_Z2' has a wrong offset!");
static_assert(offsetof(Prop_TirePile_01_C_ExecuteUbergraph_Prop_TirePile_01, CallFunc_Add_FloatFloat_ReturnValue) == 0x0000EC, "Member 'Prop_TirePile_01_C_ExecuteUbergraph_Prop_TirePile_01::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_TirePile_01_C_ExecuteUbergraph_Prop_TirePile_01, CallFunc_Add_FloatFloat_ReturnValue2) == 0x0000F0, "Member 'Prop_TirePile_01_C_ExecuteUbergraph_Prop_TirePile_01::CallFunc_Add_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Prop_TirePile_01_C_ExecuteUbergraph_Prop_TirePile_01, CallFunc_MakeVector_ReturnValue) == 0x0000F4, "Member 'Prop_TirePile_01_C_ExecuteUbergraph_Prop_TirePile_01::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_TirePile_01_C_ExecuteUbergraph_Prop_TirePile_01, CallFunc_MakeVector_ReturnValue2) == 0x000100, "Member 'Prop_TirePile_01_C_ExecuteUbergraph_Prop_TirePile_01::CallFunc_MakeVector_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Prop_TirePile_01_C_ExecuteUbergraph_Prop_TirePile_01, CallFunc_Add_FloatFloat_ReturnValue3) == 0x00010C, "Member 'Prop_TirePile_01_C_ExecuteUbergraph_Prop_TirePile_01::CallFunc_Add_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Prop_TirePile_01_C_ExecuteUbergraph_Prop_TirePile_01, CallFunc_MakeVector_ReturnValue3) == 0x000110, "Member 'Prop_TirePile_01_C_ExecuteUbergraph_Prop_TirePile_01::CallFunc_MakeVector_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Prop_TirePile_01_C_ExecuteUbergraph_Prop_TirePile_01, Temp_object_Variable) == 0x00011C, "Member 'Prop_TirePile_01_C_ExecuteUbergraph_Prop_TirePile_01::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Prop_TirePile_01_C_ExecuteUbergraph_Prop_TirePile_01, CallFunc_CapsuleTraceSingle_NEW_OutHit) == 0x000128, "Member 'Prop_TirePile_01_C_ExecuteUbergraph_Prop_TirePile_01::CallFunc_CapsuleTraceSingle_NEW_OutHit' has a wrong offset!");
static_assert(offsetof(Prop_TirePile_01_C_ExecuteUbergraph_Prop_TirePile_01, CallFunc_CapsuleTraceSingle_NEW_ReturnValue) == 0x0001A8, "Member 'Prop_TirePile_01_C_ExecuteUbergraph_Prop_TirePile_01::CallFunc_CapsuleTraceSingle_NEW_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_TirePile_01_C_ExecuteUbergraph_Prop_TirePile_01, K2Node_Event_Damage) == 0x0001AC, "Member 'Prop_TirePile_01_C_ExecuteUbergraph_Prop_TirePile_01::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(Prop_TirePile_01_C_ExecuteUbergraph_Prop_TirePile_01, K2Node_Event_DamageTags) == 0x0001B0, "Member 'Prop_TirePile_01_C_ExecuteUbergraph_Prop_TirePile_01::K2Node_Event_DamageTags' has a wrong offset!");
static_assert(offsetof(Prop_TirePile_01_C_ExecuteUbergraph_Prop_TirePile_01, K2Node_Event_Momentum) == 0x0001C8, "Member 'Prop_TirePile_01_C_ExecuteUbergraph_Prop_TirePile_01::K2Node_Event_Momentum' has a wrong offset!");
static_assert(offsetof(Prop_TirePile_01_C_ExecuteUbergraph_Prop_TirePile_01, K2Node_Event_HitInfo) == 0x0001D4, "Member 'Prop_TirePile_01_C_ExecuteUbergraph_Prop_TirePile_01::K2Node_Event_HitInfo' has a wrong offset!");
static_assert(offsetof(Prop_TirePile_01_C_ExecuteUbergraph_Prop_TirePile_01, K2Node_Event_InstigatedBy) == 0x000254, "Member 'Prop_TirePile_01_C_ExecuteUbergraph_Prop_TirePile_01::K2Node_Event_InstigatedBy' has a wrong offset!");
static_assert(offsetof(Prop_TirePile_01_C_ExecuteUbergraph_Prop_TirePile_01, K2Node_Event_DamageCauser) == 0x000258, "Member 'Prop_TirePile_01_C_ExecuteUbergraph_Prop_TirePile_01::K2Node_Event_DamageCauser' has a wrong offset!");
static_assert(offsetof(Prop_TirePile_01_C_ExecuteUbergraph_Prop_TirePile_01, K2Node_Event_EffectContext) == 0x00025C, "Member 'Prop_TirePile_01_C_ExecuteUbergraph_Prop_TirePile_01::K2Node_Event_EffectContext' has a wrong offset!");

// Function Prop_TirePile_01.Prop_TirePile_01_C.OnDamagePlayEffects
// 0x00BC (0x00BC - 0x0000)
struct Prop_TirePile_01_C_OnDamagePlayEffects final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  DamageTags;                                        // 0x0004(0x0018)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FVector                                Momentum;                                          // 0x001C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             HitInfo;                                           // 0x0028(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class AFortPawn*                              InstigatedBy;                                      // 0x00A8(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 DamageCauser;                                      // 0x00AC(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x00B0(0x000C)(Parm)
};
static_assert(alignof(Prop_TirePile_01_C_OnDamagePlayEffects) == 0x000004, "Wrong alignment on Prop_TirePile_01_C_OnDamagePlayEffects");
static_assert(sizeof(Prop_TirePile_01_C_OnDamagePlayEffects) == 0x0000BC, "Wrong size on Prop_TirePile_01_C_OnDamagePlayEffects");
static_assert(offsetof(Prop_TirePile_01_C_OnDamagePlayEffects, Damage) == 0x000000, "Member 'Prop_TirePile_01_C_OnDamagePlayEffects::Damage' has a wrong offset!");
static_assert(offsetof(Prop_TirePile_01_C_OnDamagePlayEffects, DamageTags) == 0x000004, "Member 'Prop_TirePile_01_C_OnDamagePlayEffects::DamageTags' has a wrong offset!");
static_assert(offsetof(Prop_TirePile_01_C_OnDamagePlayEffects, Momentum) == 0x00001C, "Member 'Prop_TirePile_01_C_OnDamagePlayEffects::Momentum' has a wrong offset!");
static_assert(offsetof(Prop_TirePile_01_C_OnDamagePlayEffects, HitInfo) == 0x000028, "Member 'Prop_TirePile_01_C_OnDamagePlayEffects::HitInfo' has a wrong offset!");
static_assert(offsetof(Prop_TirePile_01_C_OnDamagePlayEffects, InstigatedBy) == 0x0000A8, "Member 'Prop_TirePile_01_C_OnDamagePlayEffects::InstigatedBy' has a wrong offset!");
static_assert(offsetof(Prop_TirePile_01_C_OnDamagePlayEffects, DamageCauser) == 0x0000AC, "Member 'Prop_TirePile_01_C_OnDamagePlayEffects::DamageCauser' has a wrong offset!");
static_assert(offsetof(Prop_TirePile_01_C_OnDamagePlayEffects, EffectContext) == 0x0000B0, "Member 'Prop_TirePile_01_C_OnDamagePlayEffects::EffectContext' has a wrong offset!");

// Function Prop_TirePile_01.Prop_TirePile_01_C.BndEvt__Jump_Collision_K2Node_ComponentBoundEvent_252_ComponentBeginOverlapSignature__DelegateSignature
// 0x0090 (0x0090 - 0x0000)
struct Prop_TirePile_01_C_BndEvt__Jump_Collision_K2Node_ComponentBoundEvent_252_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         OtherBodyIndex;                                    // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bFromSweep;                                        // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0010(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(Prop_TirePile_01_C_BndEvt__Jump_Collision_K2Node_ComponentBoundEvent_252_ComponentBeginOverlapSignature__DelegateSignature) == 0x000004, "Wrong alignment on Prop_TirePile_01_C_BndEvt__Jump_Collision_K2Node_ComponentBoundEvent_252_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(Prop_TirePile_01_C_BndEvt__Jump_Collision_K2Node_ComponentBoundEvent_252_ComponentBeginOverlapSignature__DelegateSignature) == 0x000090, "Wrong size on Prop_TirePile_01_C_BndEvt__Jump_Collision_K2Node_ComponentBoundEvent_252_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(Prop_TirePile_01_C_BndEvt__Jump_Collision_K2Node_ComponentBoundEvent_252_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000000, "Member 'Prop_TirePile_01_C_BndEvt__Jump_Collision_K2Node_ComponentBoundEvent_252_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(Prop_TirePile_01_C_BndEvt__Jump_Collision_K2Node_ComponentBoundEvent_252_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000004, "Member 'Prop_TirePile_01_C_BndEvt__Jump_Collision_K2Node_ComponentBoundEvent_252_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(Prop_TirePile_01_C_BndEvt__Jump_Collision_K2Node_ComponentBoundEvent_252_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000008, "Member 'Prop_TirePile_01_C_BndEvt__Jump_Collision_K2Node_ComponentBoundEvent_252_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Prop_TirePile_01_C_BndEvt__Jump_Collision_K2Node_ComponentBoundEvent_252_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00000C, "Member 'Prop_TirePile_01_C_BndEvt__Jump_Collision_K2Node_ComponentBoundEvent_252_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(Prop_TirePile_01_C_BndEvt__Jump_Collision_K2Node_ComponentBoundEvent_252_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000010, "Member 'Prop_TirePile_01_C_BndEvt__Jump_Collision_K2Node_ComponentBoundEvent_252_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

}

#pragma pack(pop)
