#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_HuskHarvester_Attractor

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function Prop_HuskHarvester_Attractor.Prop_HuskHarvester_Attractor_C.ExecuteUbergraph_Prop_HuskHarvester_Attractor
// 0x0230 (0x0230 - 0x0000)
struct Prop_HuskHarvester_Attractor_C_ExecuteUbergraph_Prop_HuskHarvester_Attractor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFortMissionEvent                      K2Node_Event_MissionEvent;                         // 0x0024(0x006C)(ConstParm)
	struct FRotator                               CallFunc_RandomRotator_ReturnValue;                // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<class AProp_HuskHarvester_C*>          CallFunc_GetAllActorsOfClass_OutActors;            // 0x009C(0x000C)(ZeroConstructor, ReferenceParm)
	uint8                                         Pad_A8[0x8];                                       // 0x00A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00B0(0x0030)(IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult;      // 0x00E0(0x0080)(ContainsInstancedReference)
	class ABuildingSMActor*                       CallFunc_GetClosestBuildingActorFromArray_ReturnValue; // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AProp_HuskHarvester_C*                  K2Node_DynamicCast_AsProp_Husk_Harvester;          // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x3];                                      // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x016C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0178(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue2;     // 0x0184(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue3;     // 0x0190(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue4;     // 0x019C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Array_Get_Item;                           // 0x01A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Array_Get_Item2;                          // 0x01BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C9[0x3];                                      // 0x01C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_VSize_ReturnValue;                        // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue2;                   // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue3;                   // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue4;                   // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Array_Get_Item3;                          // 0x01E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue5;     // 0x01EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_VSize_ReturnValue2;                       // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue6;     // 0x01FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Abs_ReturnValue2;                         // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_211[0x3];                                      // 0x0211(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0214(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0224(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_HuskHarvester_Attractor_C_ExecuteUbergraph_Prop_HuskHarvester_Attractor) == 0x000010, "Wrong alignment on Prop_HuskHarvester_Attractor_C_ExecuteUbergraph_Prop_HuskHarvester_Attractor");
static_assert(sizeof(Prop_HuskHarvester_Attractor_C_ExecuteUbergraph_Prop_HuskHarvester_Attractor) == 0x000230, "Wrong size on Prop_HuskHarvester_Attractor_C_ExecuteUbergraph_Prop_HuskHarvester_Attractor");
static_assert(offsetof(Prop_HuskHarvester_Attractor_C_ExecuteUbergraph_Prop_HuskHarvester_Attractor, EntryPoint) == 0x000000, "Member 'Prop_HuskHarvester_Attractor_C_ExecuteUbergraph_Prop_HuskHarvester_Attractor::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_Attractor_C_ExecuteUbergraph_Prop_HuskHarvester_Attractor, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'Prop_HuskHarvester_Attractor_C_ExecuteUbergraph_Prop_HuskHarvester_Attractor::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_Attractor_C_ExecuteUbergraph_Prop_HuskHarvester_Attractor, Temp_bool_Has_Been_Initd_Variable) == 0x000005, "Member 'Prop_HuskHarvester_Attractor_C_ExecuteUbergraph_Prop_HuskHarvester_Attractor::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_Attractor_C_ExecuteUbergraph_Prop_HuskHarvester_Attractor, CallFunc_VLerp_ReturnValue) == 0x000008, "Member 'Prop_HuskHarvester_Attractor_C_ExecuteUbergraph_Prop_HuskHarvester_Attractor::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_Attractor_C_ExecuteUbergraph_Prop_HuskHarvester_Attractor, Temp_bool_IsClosed_Variable) == 0x000014, "Member 'Prop_HuskHarvester_Attractor_C_ExecuteUbergraph_Prop_HuskHarvester_Attractor::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_Attractor_C_ExecuteUbergraph_Prop_HuskHarvester_Attractor, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'Prop_HuskHarvester_Attractor_C_ExecuteUbergraph_Prop_HuskHarvester_Attractor::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_Attractor_C_ExecuteUbergraph_Prop_HuskHarvester_Attractor, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'Prop_HuskHarvester_Attractor_C_ExecuteUbergraph_Prop_HuskHarvester_Attractor::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_Attractor_C_ExecuteUbergraph_Prop_HuskHarvester_Attractor, Temp_int_Array_Index_Variable) == 0x000020, "Member 'Prop_HuskHarvester_Attractor_C_ExecuteUbergraph_Prop_HuskHarvester_Attractor::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_Attractor_C_ExecuteUbergraph_Prop_HuskHarvester_Attractor, K2Node_Event_MissionEvent) == 0x000024, "Member 'Prop_HuskHarvester_Attractor_C_ExecuteUbergraph_Prop_HuskHarvester_Attractor::K2Node_Event_MissionEvent' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_Attractor_C_ExecuteUbergraph_Prop_HuskHarvester_Attractor, CallFunc_RandomRotator_ReturnValue) == 0x000090, "Member 'Prop_HuskHarvester_Attractor_C_ExecuteUbergraph_Prop_HuskHarvester_Attractor::CallFunc_RandomRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_Attractor_C_ExecuteUbergraph_Prop_HuskHarvester_Attractor, CallFunc_GetAllActorsOfClass_OutActors) == 0x00009C, "Member 'Prop_HuskHarvester_Attractor_C_ExecuteUbergraph_Prop_HuskHarvester_Attractor::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_Attractor_C_ExecuteUbergraph_Prop_HuskHarvester_Attractor, CallFunc_MakeTransform_ReturnValue) == 0x0000B0, "Member 'Prop_HuskHarvester_Attractor_C_ExecuteUbergraph_Prop_HuskHarvester_Attractor::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_Attractor_C_ExecuteUbergraph_Prop_HuskHarvester_Attractor, CallFunc_K2_SetWorldTransform_SweepHitResult) == 0x0000E0, "Member 'Prop_HuskHarvester_Attractor_C_ExecuteUbergraph_Prop_HuskHarvester_Attractor::CallFunc_K2_SetWorldTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_Attractor_C_ExecuteUbergraph_Prop_HuskHarvester_Attractor, CallFunc_GetClosestBuildingActorFromArray_ReturnValue) == 0x000160, "Member 'Prop_HuskHarvester_Attractor_C_ExecuteUbergraph_Prop_HuskHarvester_Attractor::CallFunc_GetClosestBuildingActorFromArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_Attractor_C_ExecuteUbergraph_Prop_HuskHarvester_Attractor, K2Node_DynamicCast_AsProp_Husk_Harvester) == 0x000164, "Member 'Prop_HuskHarvester_Attractor_C_ExecuteUbergraph_Prop_HuskHarvester_Attractor::K2Node_DynamicCast_AsProp_Husk_Harvester' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_Attractor_C_ExecuteUbergraph_Prop_HuskHarvester_Attractor, K2Node_DynamicCast_bSuccess) == 0x000168, "Member 'Prop_HuskHarvester_Attractor_C_ExecuteUbergraph_Prop_HuskHarvester_Attractor::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_Attractor_C_ExecuteUbergraph_Prop_HuskHarvester_Attractor, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00016C, "Member 'Prop_HuskHarvester_Attractor_C_ExecuteUbergraph_Prop_HuskHarvester_Attractor::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_Attractor_C_ExecuteUbergraph_Prop_HuskHarvester_Attractor, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000178, "Member 'Prop_HuskHarvester_Attractor_C_ExecuteUbergraph_Prop_HuskHarvester_Attractor::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_Attractor_C_ExecuteUbergraph_Prop_HuskHarvester_Attractor, CallFunc_K2_GetComponentLocation_ReturnValue2) == 0x000184, "Member 'Prop_HuskHarvester_Attractor_C_ExecuteUbergraph_Prop_HuskHarvester_Attractor::CallFunc_K2_GetComponentLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_Attractor_C_ExecuteUbergraph_Prop_HuskHarvester_Attractor, CallFunc_K2_GetComponentLocation_ReturnValue3) == 0x000190, "Member 'Prop_HuskHarvester_Attractor_C_ExecuteUbergraph_Prop_HuskHarvester_Attractor::CallFunc_K2_GetComponentLocation_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_Attractor_C_ExecuteUbergraph_Prop_HuskHarvester_Attractor, CallFunc_K2_GetComponentLocation_ReturnValue4) == 0x00019C, "Member 'Prop_HuskHarvester_Attractor_C_ExecuteUbergraph_Prop_HuskHarvester_Attractor::CallFunc_K2_GetComponentLocation_ReturnValue4' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_Attractor_C_ExecuteUbergraph_Prop_HuskHarvester_Attractor, CallFunc_Array_Get_Item) == 0x0001A8, "Member 'Prop_HuskHarvester_Attractor_C_ExecuteUbergraph_Prop_HuskHarvester_Attractor::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_Attractor_C_ExecuteUbergraph_Prop_HuskHarvester_Attractor, CallFunc_Array_Add_ReturnValue) == 0x0001B4, "Member 'Prop_HuskHarvester_Attractor_C_ExecuteUbergraph_Prop_HuskHarvester_Attractor::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_Attractor_C_ExecuteUbergraph_Prop_HuskHarvester_Attractor, CallFunc_Array_Length_ReturnValue) == 0x0001B8, "Member 'Prop_HuskHarvester_Attractor_C_ExecuteUbergraph_Prop_HuskHarvester_Attractor::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_Attractor_C_ExecuteUbergraph_Prop_HuskHarvester_Attractor, CallFunc_Array_Get_Item2) == 0x0001BC, "Member 'Prop_HuskHarvester_Attractor_C_ExecuteUbergraph_Prop_HuskHarvester_Attractor::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_Attractor_C_ExecuteUbergraph_Prop_HuskHarvester_Attractor, CallFunc_Less_IntInt_ReturnValue) == 0x0001C8, "Member 'Prop_HuskHarvester_Attractor_C_ExecuteUbergraph_Prop_HuskHarvester_Attractor::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_Attractor_C_ExecuteUbergraph_Prop_HuskHarvester_Attractor, CallFunc_VSize_ReturnValue) == 0x0001CC, "Member 'Prop_HuskHarvester_Attractor_C_ExecuteUbergraph_Prop_HuskHarvester_Attractor::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_Attractor_C_ExecuteUbergraph_Prop_HuskHarvester_Attractor, CallFunc_Abs_ReturnValue) == 0x0001D0, "Member 'Prop_HuskHarvester_Attractor_C_ExecuteUbergraph_Prop_HuskHarvester_Attractor::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_Attractor_C_ExecuteUbergraph_Prop_HuskHarvester_Attractor, CallFunc_Array_Add_ReturnValue2) == 0x0001D4, "Member 'Prop_HuskHarvester_Attractor_C_ExecuteUbergraph_Prop_HuskHarvester_Attractor::CallFunc_Array_Add_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_Attractor_C_ExecuteUbergraph_Prop_HuskHarvester_Attractor, CallFunc_Array_Add_ReturnValue3) == 0x0001D8, "Member 'Prop_HuskHarvester_Attractor_C_ExecuteUbergraph_Prop_HuskHarvester_Attractor::CallFunc_Array_Add_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_Attractor_C_ExecuteUbergraph_Prop_HuskHarvester_Attractor, CallFunc_Array_Add_ReturnValue4) == 0x0001DC, "Member 'Prop_HuskHarvester_Attractor_C_ExecuteUbergraph_Prop_HuskHarvester_Attractor::CallFunc_Array_Add_ReturnValue4' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_Attractor_C_ExecuteUbergraph_Prop_HuskHarvester_Attractor, CallFunc_Array_Get_Item3) == 0x0001E0, "Member 'Prop_HuskHarvester_Attractor_C_ExecuteUbergraph_Prop_HuskHarvester_Attractor::CallFunc_Array_Get_Item3' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_Attractor_C_ExecuteUbergraph_Prop_HuskHarvester_Attractor, CallFunc_K2_GetComponentLocation_ReturnValue5) == 0x0001EC, "Member 'Prop_HuskHarvester_Attractor_C_ExecuteUbergraph_Prop_HuskHarvester_Attractor::CallFunc_K2_GetComponentLocation_ReturnValue5' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_Attractor_C_ExecuteUbergraph_Prop_HuskHarvester_Attractor, CallFunc_VSize_ReturnValue2) == 0x0001F8, "Member 'Prop_HuskHarvester_Attractor_C_ExecuteUbergraph_Prop_HuskHarvester_Attractor::CallFunc_VSize_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_Attractor_C_ExecuteUbergraph_Prop_HuskHarvester_Attractor, CallFunc_K2_GetComponentLocation_ReturnValue6) == 0x0001FC, "Member 'Prop_HuskHarvester_Attractor_C_ExecuteUbergraph_Prop_HuskHarvester_Attractor::CallFunc_K2_GetComponentLocation_ReturnValue6' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_Attractor_C_ExecuteUbergraph_Prop_HuskHarvester_Attractor, CallFunc_Abs_ReturnValue2) == 0x000208, "Member 'Prop_HuskHarvester_Attractor_C_ExecuteUbergraph_Prop_HuskHarvester_Attractor::CallFunc_Abs_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_Attractor_C_ExecuteUbergraph_Prop_HuskHarvester_Attractor, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00020C, "Member 'Prop_HuskHarvester_Attractor_C_ExecuteUbergraph_Prop_HuskHarvester_Attractor::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_Attractor_C_ExecuteUbergraph_Prop_HuskHarvester_Attractor, CallFunc_Less_FloatFloat_ReturnValue) == 0x000210, "Member 'Prop_HuskHarvester_Attractor_C_ExecuteUbergraph_Prop_HuskHarvester_Attractor::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_Attractor_C_ExecuteUbergraph_Prop_HuskHarvester_Attractor, CallFunc_Add_VectorVector_ReturnValue) == 0x000214, "Member 'Prop_HuskHarvester_Attractor_C_ExecuteUbergraph_Prop_HuskHarvester_Attractor::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_Attractor_C_ExecuteUbergraph_Prop_HuskHarvester_Attractor, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000220, "Member 'Prop_HuskHarvester_Attractor_C_ExecuteUbergraph_Prop_HuskHarvester_Attractor::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_HuskHarvester_Attractor_C_ExecuteUbergraph_Prop_HuskHarvester_Attractor, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000224, "Member 'Prop_HuskHarvester_Attractor_C_ExecuteUbergraph_Prop_HuskHarvester_Attractor::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");

// Function Prop_HuskHarvester_Attractor.Prop_HuskHarvester_Attractor_C.BlueprintHandleMissionEventNoReply
// 0x006C (0x006C - 0x0000)
struct Prop_HuskHarvester_Attractor_C_BlueprintHandleMissionEventNoReply final
{
public:
	struct FFortMissionEvent                      MissionEvent;                                      // 0x0000(0x006C)(ConstParm, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(Prop_HuskHarvester_Attractor_C_BlueprintHandleMissionEventNoReply) == 0x000004, "Wrong alignment on Prop_HuskHarvester_Attractor_C_BlueprintHandleMissionEventNoReply");
static_assert(sizeof(Prop_HuskHarvester_Attractor_C_BlueprintHandleMissionEventNoReply) == 0x00006C, "Wrong size on Prop_HuskHarvester_Attractor_C_BlueprintHandleMissionEventNoReply");
static_assert(offsetof(Prop_HuskHarvester_Attractor_C_BlueprintHandleMissionEventNoReply, MissionEvent) == 0x000000, "Member 'Prop_HuskHarvester_Attractor_C_BlueprintHandleMissionEventNoReply::MissionEvent' has a wrong offset!");

}

#pragma pack(pop)
