#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_HuskHarvester_Attractor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass Prop_HuskHarvester_Attractor.Prop_HuskHarvester_Attractor_C
// 0x0054 (0x0294 - 0x0240)
class AProp_HuskHarvester_Attractor_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0240(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        Laseraxe_Impact_Cue;                               // 0x0244(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0248(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class USceneComponent*                        Scene;                                             // 0x024C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	float                                         MoveOverTime_Move_803EAD914EB2F220C3594F8648041D35; // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ETimelineDirection                            MoveOverTime__Direction_803EAD914EB2F220C3594F8648041D35; // 0x0254(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_255[0x3];                                      // 0x0255(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     MoveOverTime;                                      // 0x0258(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                SpawnPosition;                                     // 0x025C(0x000C)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                PumpLocation;                                      // 0x0268(0x000C)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	TArray<struct FVector>                        PumpDistancesArray;                                // 0x0274(0x000C)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance)
	float                                         ChosenPump;                                        // 0x0280(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	int32                                         PumpIndex;                                         // 0x0284(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                MachineLocation;                                   // 0x0288(0x000C)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_Prop_HuskHarvester_Attractor(int32 EntryPoint);
	void arrived();
	void ReceiveBeginPlay();
	void BlueprintHandleMissionEventNoReply(const struct FFortMissionEvent& MissionEvent);
	void MoveOverTime__UpdateFunc();
	void MoveOverTime__FinishedFunc();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Prop_HuskHarvester_Attractor_C">();
	}
	static class AProp_HuskHarvester_Attractor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProp_HuskHarvester_Attractor_C>();
	}
};
static_assert(alignof(AProp_HuskHarvester_Attractor_C) == 0x000004, "Wrong alignment on AProp_HuskHarvester_Attractor_C");
static_assert(sizeof(AProp_HuskHarvester_Attractor_C) == 0x000294, "Wrong size on AProp_HuskHarvester_Attractor_C");
static_assert(offsetof(AProp_HuskHarvester_Attractor_C, UberGraphFrame) == 0x000240, "Member 'AProp_HuskHarvester_Attractor_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AProp_HuskHarvester_Attractor_C, Laseraxe_Impact_Cue) == 0x000244, "Member 'AProp_HuskHarvester_Attractor_C::Laseraxe_Impact_Cue' has a wrong offset!");
static_assert(offsetof(AProp_HuskHarvester_Attractor_C, StaticMesh) == 0x000248, "Member 'AProp_HuskHarvester_Attractor_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(AProp_HuskHarvester_Attractor_C, Scene) == 0x00024C, "Member 'AProp_HuskHarvester_Attractor_C::Scene' has a wrong offset!");
static_assert(offsetof(AProp_HuskHarvester_Attractor_C, MoveOverTime_Move_803EAD914EB2F220C3594F8648041D35) == 0x000250, "Member 'AProp_HuskHarvester_Attractor_C::MoveOverTime_Move_803EAD914EB2F220C3594F8648041D35' has a wrong offset!");
static_assert(offsetof(AProp_HuskHarvester_Attractor_C, MoveOverTime__Direction_803EAD914EB2F220C3594F8648041D35) == 0x000254, "Member 'AProp_HuskHarvester_Attractor_C::MoveOverTime__Direction_803EAD914EB2F220C3594F8648041D35' has a wrong offset!");
static_assert(offsetof(AProp_HuskHarvester_Attractor_C, MoveOverTime) == 0x000258, "Member 'AProp_HuskHarvester_Attractor_C::MoveOverTime' has a wrong offset!");
static_assert(offsetof(AProp_HuskHarvester_Attractor_C, SpawnPosition) == 0x00025C, "Member 'AProp_HuskHarvester_Attractor_C::SpawnPosition' has a wrong offset!");
static_assert(offsetof(AProp_HuskHarvester_Attractor_C, PumpLocation) == 0x000268, "Member 'AProp_HuskHarvester_Attractor_C::PumpLocation' has a wrong offset!");
static_assert(offsetof(AProp_HuskHarvester_Attractor_C, PumpDistancesArray) == 0x000274, "Member 'AProp_HuskHarvester_Attractor_C::PumpDistancesArray' has a wrong offset!");
static_assert(offsetof(AProp_HuskHarvester_Attractor_C, ChosenPump) == 0x000280, "Member 'AProp_HuskHarvester_Attractor_C::ChosenPump' has a wrong offset!");
static_assert(offsetof(AProp_HuskHarvester_Attractor_C, PumpIndex) == 0x000284, "Member 'AProp_HuskHarvester_Attractor_C::PumpIndex' has a wrong offset!");
static_assert(offsetof(AProp_HuskHarvester_Attractor_C, MachineLocation) == 0x000288, "Member 'AProp_HuskHarvester_Attractor_C::MachineLocation' has a wrong offset!");

}

#pragma pack(pop)
