#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Roof_AirConditioner_02

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function Roof_AirConditioner_02.Roof_AirConditioner_02_C.ExecuteUbergraph_Roof_AirConditioner_02
// 0x00CC (0x00CC - 0x0000)
struct Roof_AirConditioner_02_C_ExecuteUbergraph_Roof_AirConditioner_02 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_Damage;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  K2Node_Event_DamageTags;                           // 0x0014(0x0018)(ConstParm)
	struct FVector                                K2Node_Event_Momentum;                             // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             K2Node_Event_HitInfo;                              // 0x0038(0x0080)(ConstParm, ContainsInstancedReference)
	class AFortPawn*                              K2Node_Event_InstigatedBy;                         // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext;                        // 0x00C0(0x000C)()
};
static_assert(alignof(Roof_AirConditioner_02_C_ExecuteUbergraph_Roof_AirConditioner_02) == 0x000004, "Wrong alignment on Roof_AirConditioner_02_C_ExecuteUbergraph_Roof_AirConditioner_02");
static_assert(sizeof(Roof_AirConditioner_02_C_ExecuteUbergraph_Roof_AirConditioner_02) == 0x0000CC, "Wrong size on Roof_AirConditioner_02_C_ExecuteUbergraph_Roof_AirConditioner_02");
static_assert(offsetof(Roof_AirConditioner_02_C_ExecuteUbergraph_Roof_AirConditioner_02, EntryPoint) == 0x000000, "Member 'Roof_AirConditioner_02_C_ExecuteUbergraph_Roof_AirConditioner_02::EntryPoint' has a wrong offset!");
static_assert(offsetof(Roof_AirConditioner_02_C_ExecuteUbergraph_Roof_AirConditioner_02, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000004, "Member 'Roof_AirConditioner_02_C_ExecuteUbergraph_Roof_AirConditioner_02::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Roof_AirConditioner_02_C_ExecuteUbergraph_Roof_AirConditioner_02, K2Node_Event_Damage) == 0x000010, "Member 'Roof_AirConditioner_02_C_ExecuteUbergraph_Roof_AirConditioner_02::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(Roof_AirConditioner_02_C_ExecuteUbergraph_Roof_AirConditioner_02, K2Node_Event_DamageTags) == 0x000014, "Member 'Roof_AirConditioner_02_C_ExecuteUbergraph_Roof_AirConditioner_02::K2Node_Event_DamageTags' has a wrong offset!");
static_assert(offsetof(Roof_AirConditioner_02_C_ExecuteUbergraph_Roof_AirConditioner_02, K2Node_Event_Momentum) == 0x00002C, "Member 'Roof_AirConditioner_02_C_ExecuteUbergraph_Roof_AirConditioner_02::K2Node_Event_Momentum' has a wrong offset!");
static_assert(offsetof(Roof_AirConditioner_02_C_ExecuteUbergraph_Roof_AirConditioner_02, K2Node_Event_HitInfo) == 0x000038, "Member 'Roof_AirConditioner_02_C_ExecuteUbergraph_Roof_AirConditioner_02::K2Node_Event_HitInfo' has a wrong offset!");
static_assert(offsetof(Roof_AirConditioner_02_C_ExecuteUbergraph_Roof_AirConditioner_02, K2Node_Event_InstigatedBy) == 0x0000B8, "Member 'Roof_AirConditioner_02_C_ExecuteUbergraph_Roof_AirConditioner_02::K2Node_Event_InstigatedBy' has a wrong offset!");
static_assert(offsetof(Roof_AirConditioner_02_C_ExecuteUbergraph_Roof_AirConditioner_02, K2Node_Event_DamageCauser) == 0x0000BC, "Member 'Roof_AirConditioner_02_C_ExecuteUbergraph_Roof_AirConditioner_02::K2Node_Event_DamageCauser' has a wrong offset!");
static_assert(offsetof(Roof_AirConditioner_02_C_ExecuteUbergraph_Roof_AirConditioner_02, K2Node_Event_EffectContext) == 0x0000C0, "Member 'Roof_AirConditioner_02_C_ExecuteUbergraph_Roof_AirConditioner_02::K2Node_Event_EffectContext' has a wrong offset!");

// Function Roof_AirConditioner_02.Roof_AirConditioner_02_C.OnDamagePlayEffects
// 0x00BC (0x00BC - 0x0000)
struct Roof_AirConditioner_02_C_OnDamagePlayEffects final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  DamageTags;                                        // 0x0004(0x0018)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FVector                                Momentum;                                          // 0x001C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             HitInfo;                                           // 0x0028(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class AFortPawn*                              InstigatedBy;                                      // 0x00A8(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 DamageCauser;                                      // 0x00AC(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x00B0(0x000C)(Parm)
};
static_assert(alignof(Roof_AirConditioner_02_C_OnDamagePlayEffects) == 0x000004, "Wrong alignment on Roof_AirConditioner_02_C_OnDamagePlayEffects");
static_assert(sizeof(Roof_AirConditioner_02_C_OnDamagePlayEffects) == 0x0000BC, "Wrong size on Roof_AirConditioner_02_C_OnDamagePlayEffects");
static_assert(offsetof(Roof_AirConditioner_02_C_OnDamagePlayEffects, Damage) == 0x000000, "Member 'Roof_AirConditioner_02_C_OnDamagePlayEffects::Damage' has a wrong offset!");
static_assert(offsetof(Roof_AirConditioner_02_C_OnDamagePlayEffects, DamageTags) == 0x000004, "Member 'Roof_AirConditioner_02_C_OnDamagePlayEffects::DamageTags' has a wrong offset!");
static_assert(offsetof(Roof_AirConditioner_02_C_OnDamagePlayEffects, Momentum) == 0x00001C, "Member 'Roof_AirConditioner_02_C_OnDamagePlayEffects::Momentum' has a wrong offset!");
static_assert(offsetof(Roof_AirConditioner_02_C_OnDamagePlayEffects, HitInfo) == 0x000028, "Member 'Roof_AirConditioner_02_C_OnDamagePlayEffects::HitInfo' has a wrong offset!");
static_assert(offsetof(Roof_AirConditioner_02_C_OnDamagePlayEffects, InstigatedBy) == 0x0000A8, "Member 'Roof_AirConditioner_02_C_OnDamagePlayEffects::InstigatedBy' has a wrong offset!");
static_assert(offsetof(Roof_AirConditioner_02_C_OnDamagePlayEffects, DamageCauser) == 0x0000AC, "Member 'Roof_AirConditioner_02_C_OnDamagePlayEffects::DamageCauser' has a wrong offset!");
static_assert(offsetof(Roof_AirConditioner_02_C_OnDamagePlayEffects, EffectContext) == 0x0000B0, "Member 'Roof_AirConditioner_02_C_OnDamagePlayEffects::EffectContext' has a wrong offset!");

}

#pragma pack(pop)
