#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: School_Clock

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass School_Clock.School_CLock_C
// 0x0010 (0x0954 - 0x0944)
class ASchool_CLock_C final : public ABuildingProp
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0944(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   MinuteHandMesh;                                    // 0x0948(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   HourHandMesh;                                      // 0x094C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UBoxComponent*                          Box1;                                              // 0x0950(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)

public:
	void ExecuteUbergraph_School_Clock(int32 EntryPoint);
	void ReceiveBeginPlay();
	void UserConstructionScript();
	void UpdateTime();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"School_CLock_C">();
	}
	static class ASchool_CLock_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASchool_CLock_C>();
	}
};
static_assert(alignof(ASchool_CLock_C) == 0x000004, "Wrong alignment on ASchool_CLock_C");
static_assert(sizeof(ASchool_CLock_C) == 0x000954, "Wrong size on ASchool_CLock_C");
static_assert(offsetof(ASchool_CLock_C, UberGraphFrame) == 0x000944, "Member 'ASchool_CLock_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ASchool_CLock_C, MinuteHandMesh) == 0x000948, "Member 'ASchool_CLock_C::MinuteHandMesh' has a wrong offset!");
static_assert(offsetof(ASchool_CLock_C, HourHandMesh) == 0x00094C, "Member 'ASchool_CLock_C::HourHandMesh' has a wrong offset!");
static_assert(offsetof(ASchool_CLock_C, Box1) == 0x000950, "Member 'ASchool_CLock_C::Box1' has a wrong offset!");

}

#pragma pack(pop)
