#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: School_Clock

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function School_Clock.School_CLock_C.ExecuteUbergraph_School_Clock
// 0x000C (0x000C - 0x0000)
struct School_CLock_C_ExecuteUbergraph_School_Clock final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0004(0x0004)()
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(School_CLock_C_ExecuteUbergraph_School_Clock) == 0x000004, "Wrong alignment on School_CLock_C_ExecuteUbergraph_School_Clock");
static_assert(sizeof(School_CLock_C_ExecuteUbergraph_School_Clock) == 0x00000C, "Wrong size on School_CLock_C_ExecuteUbergraph_School_Clock");
static_assert(offsetof(School_CLock_C_ExecuteUbergraph_School_Clock, EntryPoint) == 0x000000, "Member 'School_CLock_C_ExecuteUbergraph_School_Clock::EntryPoint' has a wrong offset!");
static_assert(offsetof(School_CLock_C_ExecuteUbergraph_School_Clock, CallFunc_K2_SetTimer_ReturnValue) == 0x000004, "Member 'School_CLock_C_ExecuteUbergraph_School_Clock::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(School_CLock_C_ExecuteUbergraph_School_Clock, CallFunc_IsDedicatedServer_ReturnValue) == 0x000008, "Member 'School_CLock_C_ExecuteUbergraph_School_Clock::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");

// Function School_Clock.School_CLock_C.UpdateTime
// 0x0134 (0x0134 - 0x0000)
struct School_CLock_C_UpdateTime final
{
public:
	float                                         CallFunc_GetTimeOfDay_ReturnValue;                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetTimeOfDay_ReturnValue2;                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_FMod_Remainder;                           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_FMod_ReturnValue;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue2;         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue2;                 // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0034(0x0080)(ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult2;   // 0x00B4(0x0080)(ContainsInstancedReference)
};
static_assert(alignof(School_CLock_C_UpdateTime) == 0x000004, "Wrong alignment on School_CLock_C_UpdateTime");
static_assert(sizeof(School_CLock_C_UpdateTime) == 0x000134, "Wrong size on School_CLock_C_UpdateTime");
static_assert(offsetof(School_CLock_C_UpdateTime, CallFunc_GetTimeOfDay_ReturnValue) == 0x000000, "Member 'School_CLock_C_UpdateTime::CallFunc_GetTimeOfDay_ReturnValue' has a wrong offset!");
static_assert(offsetof(School_CLock_C_UpdateTime, CallFunc_GetTimeOfDay_ReturnValue2) == 0x000004, "Member 'School_CLock_C_UpdateTime::CallFunc_GetTimeOfDay_ReturnValue2' has a wrong offset!");
static_assert(offsetof(School_CLock_C_UpdateTime, CallFunc_FMod_Remainder) == 0x000008, "Member 'School_CLock_C_UpdateTime::CallFunc_FMod_Remainder' has a wrong offset!");
static_assert(offsetof(School_CLock_C_UpdateTime, CallFunc_FMod_ReturnValue) == 0x00000C, "Member 'School_CLock_C_UpdateTime::CallFunc_FMod_ReturnValue' has a wrong offset!");
static_assert(offsetof(School_CLock_C_UpdateTime, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000010, "Member 'School_CLock_C_UpdateTime::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(School_CLock_C_UpdateTime, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000014, "Member 'School_CLock_C_UpdateTime::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(School_CLock_C_UpdateTime, CallFunc_Multiply_FloatFloat_ReturnValue2) == 0x000018, "Member 'School_CLock_C_UpdateTime::CallFunc_Multiply_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(School_CLock_C_UpdateTime, CallFunc_MakeRotator_ReturnValue) == 0x00001C, "Member 'School_CLock_C_UpdateTime::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(School_CLock_C_UpdateTime, CallFunc_MakeRotator_ReturnValue2) == 0x000028, "Member 'School_CLock_C_UpdateTime::CallFunc_MakeRotator_ReturnValue2' has a wrong offset!");
static_assert(offsetof(School_CLock_C_UpdateTime, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000034, "Member 'School_CLock_C_UpdateTime::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(School_CLock_C_UpdateTime, CallFunc_K2_SetRelativeRotation_SweepHitResult2) == 0x0000B4, "Member 'School_CLock_C_UpdateTime::CallFunc_K2_SetRelativeRotation_SweepHitResult2' has a wrong offset!");

}

#pragma pack(pop)
