#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SetBlackboardLocation

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function SetBlackboardLocation.SetBlackboardLocation_C.ExecuteUbergraph_SetBlackboardLocation
// 0x0028 (0x0028 - 0x0000)
struct SetBlackboardLocation_C_ExecuteUbergraph_SetBlackboardLocation final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_Event_OwnerActor;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetBlackboardValueAsVector_ReturnValue;   // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_GetBlackboardValueAsActor_ReturnValue;    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SetBlackboardLocation_C_ExecuteUbergraph_SetBlackboardLocation) == 0x000004, "Wrong alignment on SetBlackboardLocation_C_ExecuteUbergraph_SetBlackboardLocation");
static_assert(sizeof(SetBlackboardLocation_C_ExecuteUbergraph_SetBlackboardLocation) == 0x000028, "Wrong size on SetBlackboardLocation_C_ExecuteUbergraph_SetBlackboardLocation");
static_assert(offsetof(SetBlackboardLocation_C_ExecuteUbergraph_SetBlackboardLocation, EntryPoint) == 0x000000, "Member 'SetBlackboardLocation_C_ExecuteUbergraph_SetBlackboardLocation::EntryPoint' has a wrong offset!");
static_assert(offsetof(SetBlackboardLocation_C_ExecuteUbergraph_SetBlackboardLocation, K2Node_Event_OwnerActor) == 0x000004, "Member 'SetBlackboardLocation_C_ExecuteUbergraph_SetBlackboardLocation::K2Node_Event_OwnerActor' has a wrong offset!");
static_assert(offsetof(SetBlackboardLocation_C_ExecuteUbergraph_SetBlackboardLocation, CallFunc_GetBlackboardValueAsVector_ReturnValue) == 0x000008, "Member 'SetBlackboardLocation_C_ExecuteUbergraph_SetBlackboardLocation::CallFunc_GetBlackboardValueAsVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SetBlackboardLocation_C_ExecuteUbergraph_SetBlackboardLocation, CallFunc_GetBlackboardValueAsActor_ReturnValue) == 0x000014, "Member 'SetBlackboardLocation_C_ExecuteUbergraph_SetBlackboardLocation::CallFunc_GetBlackboardValueAsActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(SetBlackboardLocation_C_ExecuteUbergraph_SetBlackboardLocation, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000018, "Member 'SetBlackboardLocation_C_ExecuteUbergraph_SetBlackboardLocation::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(SetBlackboardLocation_C_ExecuteUbergraph_SetBlackboardLocation, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00001C, "Member 'SetBlackboardLocation_C_ExecuteUbergraph_SetBlackboardLocation::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");

// Function SetBlackboardLocation.SetBlackboardLocation_C.ReceiveExecute
// 0x0004 (0x0004 - 0x0000)
struct SetBlackboardLocation_C_ReceiveExecute final
{
public:
	class AActor*                                 OwnerActor;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SetBlackboardLocation_C_ReceiveExecute) == 0x000004, "Wrong alignment on SetBlackboardLocation_C_ReceiveExecute");
static_assert(sizeof(SetBlackboardLocation_C_ReceiveExecute) == 0x000004, "Wrong size on SetBlackboardLocation_C_ReceiveExecute");
static_assert(offsetof(SetBlackboardLocation_C_ReceiveExecute, OwnerActor) == 0x000000, "Member 'SetBlackboardLocation_C_ReceiveExecute::OwnerActor' has a wrong offset!");

}

#pragma pack(pop)
