#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SetBlackboardLocation

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass SetBlackboardLocation.SetBlackboardLocation_C
// 0x0044 (0x00A0 - 0x005C)
class USetBlackboardLocation_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x005C(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	struct FBlackboardKeySelector                 LocationSource;                                    // 0x0060(0x0020)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 LocationKeyToSet;                                  // 0x0080(0x0020)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_SetBlackboardLocation(int32 EntryPoint);
	void ReceiveExecute(class AActor* OwnerActor);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SetBlackboardLocation_C">();
	}
	static class USetBlackboardLocation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USetBlackboardLocation_C>();
	}
};
static_assert(alignof(USetBlackboardLocation_C) == 0x000004, "Wrong alignment on USetBlackboardLocation_C");
static_assert(sizeof(USetBlackboardLocation_C) == 0x0000A0, "Wrong size on USetBlackboardLocation_C");
static_assert(offsetof(USetBlackboardLocation_C, UberGraphFrame) == 0x00005C, "Member 'USetBlackboardLocation_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USetBlackboardLocation_C, LocationSource) == 0x000060, "Member 'USetBlackboardLocation_C::LocationSource' has a wrong offset!");
static_assert(offsetof(USetBlackboardLocation_C, LocationKeyToSet) == 0x000080, "Member 'USetBlackboardLocation_C::LocationKeyToSet' has a wrong offset!");

}

#pragma pack(pop)
