#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SK_AMR_Skeleton_AnimBlueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// AnimBlueprintGeneratedClass SK_AMR_Skeleton_AnimBlueprint.SK_AMR_Skeleton_AnimBlueprint_C
// 0x0258 (0x0568 - 0x0310)
class USK_AMR_Skeleton_AnimBlueprint_C final : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0310(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_F0341E804AF4A1BD213152927EFB4F32; // 0x0314(0x002C)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_313069894CB8680BFE9F5A96D9557986; // 0x0340(0x0058)()
	struct FAnimNode_SpringBone                   AnimGraphNode_SpringBone_0C6D341E436C735FCE90BDB52B7B4485; // 0x0398(0x0098)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_D8FF0D8141FBCE6F9DB253A75CC8395E; // 0x0430(0x002C)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2DBF442044137363E651CB9476E7772E; // 0x045C(0x002C)()
	struct FAnimNode_SpringBone                   AnimGraphNode_SpringBone_008B44BC4E5F2543119A73A01391A978; // 0x0488(0x0098)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_88447E5A40A89A4363700783C3685EFF; // 0x0520(0x0044)()
	float                                         springVal;                                         // 0x0564(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_SK_AMR_Skeleton_AnimBlueprint(int32 EntryPoint);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SK_AMR_Skeleton_AnimBlueprint_AnimGraphNode_SpringBone_008B44BC4E5F2543119A73A01391A978();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SK_AMR_Skeleton_AnimBlueprint_AnimGraphNode_SpringBone_0C6D341E436C735FCE90BDB52B7B4485();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SK_AMR_Skeleton_AnimBlueprint_C">();
	}
	static class USK_AMR_Skeleton_AnimBlueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USK_AMR_Skeleton_AnimBlueprint_C>();
	}
};
static_assert(alignof(USK_AMR_Skeleton_AnimBlueprint_C) == 0x000004, "Wrong alignment on USK_AMR_Skeleton_AnimBlueprint_C");
static_assert(sizeof(USK_AMR_Skeleton_AnimBlueprint_C) == 0x000568, "Wrong size on USK_AMR_Skeleton_AnimBlueprint_C");
static_assert(offsetof(USK_AMR_Skeleton_AnimBlueprint_C, UberGraphFrame) == 0x000310, "Member 'USK_AMR_Skeleton_AnimBlueprint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USK_AMR_Skeleton_AnimBlueprint_C, AnimGraphNode_Root_F0341E804AF4A1BD213152927EFB4F32) == 0x000314, "Member 'USK_AMR_Skeleton_AnimBlueprint_C::AnimGraphNode_Root_F0341E804AF4A1BD213152927EFB4F32' has a wrong offset!");
static_assert(offsetof(USK_AMR_Skeleton_AnimBlueprint_C, AnimGraphNode_SequencePlayer_313069894CB8680BFE9F5A96D9557986) == 0x000340, "Member 'USK_AMR_Skeleton_AnimBlueprint_C::AnimGraphNode_SequencePlayer_313069894CB8680BFE9F5A96D9557986' has a wrong offset!");
static_assert(offsetof(USK_AMR_Skeleton_AnimBlueprint_C, AnimGraphNode_SpringBone_0C6D341E436C735FCE90BDB52B7B4485) == 0x000398, "Member 'USK_AMR_Skeleton_AnimBlueprint_C::AnimGraphNode_SpringBone_0C6D341E436C735FCE90BDB52B7B4485' has a wrong offset!");
static_assert(offsetof(USK_AMR_Skeleton_AnimBlueprint_C, AnimGraphNode_LocalToComponentSpace_D8FF0D8141FBCE6F9DB253A75CC8395E) == 0x000430, "Member 'USK_AMR_Skeleton_AnimBlueprint_C::AnimGraphNode_LocalToComponentSpace_D8FF0D8141FBCE6F9DB253A75CC8395E' has a wrong offset!");
static_assert(offsetof(USK_AMR_Skeleton_AnimBlueprint_C, AnimGraphNode_ComponentToLocalSpace_2DBF442044137363E651CB9476E7772E) == 0x00045C, "Member 'USK_AMR_Skeleton_AnimBlueprint_C::AnimGraphNode_ComponentToLocalSpace_2DBF442044137363E651CB9476E7772E' has a wrong offset!");
static_assert(offsetof(USK_AMR_Skeleton_AnimBlueprint_C, AnimGraphNode_SpringBone_008B44BC4E5F2543119A73A01391A978) == 0x000488, "Member 'USK_AMR_Skeleton_AnimBlueprint_C::AnimGraphNode_SpringBone_008B44BC4E5F2543119A73A01391A978' has a wrong offset!");
static_assert(offsetof(USK_AMR_Skeleton_AnimBlueprint_C, AnimGraphNode_Slot_88447E5A40A89A4363700783C3685EFF) == 0x000520, "Member 'USK_AMR_Skeleton_AnimBlueprint_C::AnimGraphNode_Slot_88447E5A40A89A4363700783C3685EFF' has a wrong offset!");
static_assert(offsetof(USK_AMR_Skeleton_AnimBlueprint_C, springVal) == 0x000564, "Member 'USK_AMR_Skeleton_AnimBlueprint_C::springVal' has a wrong offset!");

}

#pragma pack(pop)
