#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SK_Magnum_Skeleton_AnimBlueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// AnimBlueprintGeneratedClass SK_Magnum_Skeleton_AnimBlueprint.SK_Magnum_Skeleton_AnimBlueprint_C
// 0x00CC (0x03DC - 0x0310)
class USK_Magnum_Skeleton_AnimBlueprint_C final : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0310(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_F586A6804FB20307A25670A7746479C3; // 0x0314(0x002C)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1EBD124B476304C3CB2D51BF9A7BE9B8; // 0x0340(0x0044)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4A7A2F334293CE7E436D43B263D3B0E7; // 0x0384(0x0058)()

public:
	void ExecuteUbergraph_SK_Magnum_Skeleton_AnimBlueprint(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SK_Magnum_Skeleton_AnimBlueprint_C">();
	}
	static class USK_Magnum_Skeleton_AnimBlueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USK_Magnum_Skeleton_AnimBlueprint_C>();
	}
};
static_assert(alignof(USK_Magnum_Skeleton_AnimBlueprint_C) == 0x000004, "Wrong alignment on USK_Magnum_Skeleton_AnimBlueprint_C");
static_assert(sizeof(USK_Magnum_Skeleton_AnimBlueprint_C) == 0x0003DC, "Wrong size on USK_Magnum_Skeleton_AnimBlueprint_C");
static_assert(offsetof(USK_Magnum_Skeleton_AnimBlueprint_C, UberGraphFrame) == 0x000310, "Member 'USK_Magnum_Skeleton_AnimBlueprint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USK_Magnum_Skeleton_AnimBlueprint_C, AnimGraphNode_Root_F586A6804FB20307A25670A7746479C3) == 0x000314, "Member 'USK_Magnum_Skeleton_AnimBlueprint_C::AnimGraphNode_Root_F586A6804FB20307A25670A7746479C3' has a wrong offset!");
static_assert(offsetof(USK_Magnum_Skeleton_AnimBlueprint_C, AnimGraphNode_Slot_1EBD124B476304C3CB2D51BF9A7BE9B8) == 0x000340, "Member 'USK_Magnum_Skeleton_AnimBlueprint_C::AnimGraphNode_Slot_1EBD124B476304C3CB2D51BF9A7BE9B8' has a wrong offset!");
static_assert(offsetof(USK_Magnum_Skeleton_AnimBlueprint_C, AnimGraphNode_SequencePlayer_4A7A2F334293CE7E436D43B263D3B0E7) == 0x000384, "Member 'USK_Magnum_Skeleton_AnimBlueprint_C::AnimGraphNode_SequencePlayer_4A7A2F334293CE7E436D43B263D3B0E7' has a wrong offset!");

}

#pragma pack(pop)
