#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SK_RayGunAuto_01_Skeleton_AnimBlueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// AnimBlueprintGeneratedClass SK_RayGunAuto_01_Skeleton_AnimBlueprint.SK_RayGunAuto_01_Skeleton_AnimBlueprint_C
// 0x0098 (0x03A8 - 0x0310)
class USK_RayGunAuto_01_Skeleton_AnimBlueprint_C final : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0310(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_FFC22B554B588BF7B2403CB85AA4FF1F; // 0x0314(0x002C)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_2D129CCF41686448BBDE15BB710E9665; // 0x0340(0x0044)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_12E3B6C0424D217E845B749ED79F1517; // 0x0384(0x0024)()

public:
	void ExecuteUbergraph_SK_RayGunAuto_01_Skeleton_AnimBlueprint(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SK_RayGunAuto_01_Skeleton_AnimBlueprint_C">();
	}
	static class USK_RayGunAuto_01_Skeleton_AnimBlueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USK_RayGunAuto_01_Skeleton_AnimBlueprint_C>();
	}
};
static_assert(alignof(USK_RayGunAuto_01_Skeleton_AnimBlueprint_C) == 0x000004, "Wrong alignment on USK_RayGunAuto_01_Skeleton_AnimBlueprint_C");
static_assert(sizeof(USK_RayGunAuto_01_Skeleton_AnimBlueprint_C) == 0x0003A8, "Wrong size on USK_RayGunAuto_01_Skeleton_AnimBlueprint_C");
static_assert(offsetof(USK_RayGunAuto_01_Skeleton_AnimBlueprint_C, UberGraphFrame) == 0x000310, "Member 'USK_RayGunAuto_01_Skeleton_AnimBlueprint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USK_RayGunAuto_01_Skeleton_AnimBlueprint_C, AnimGraphNode_Root_FFC22B554B588BF7B2403CB85AA4FF1F) == 0x000314, "Member 'USK_RayGunAuto_01_Skeleton_AnimBlueprint_C::AnimGraphNode_Root_FFC22B554B588BF7B2403CB85AA4FF1F' has a wrong offset!");
static_assert(offsetof(USK_RayGunAuto_01_Skeleton_AnimBlueprint_C, AnimGraphNode_Slot_2D129CCF41686448BBDE15BB710E9665) == 0x000340, "Member 'USK_RayGunAuto_01_Skeleton_AnimBlueprint_C::AnimGraphNode_Slot_2D129CCF41686448BBDE15BB710E9665' has a wrong offset!");
static_assert(offsetof(USK_RayGunAuto_01_Skeleton_AnimBlueprint_C, AnimGraphNode_LocalRefPose_12E3B6C0424D217E845B749ED79F1517) == 0x000384, "Member 'USK_RayGunAuto_01_Skeleton_AnimBlueprint_C::AnimGraphNode_LocalRefPose_12E3B6C0424D217E845B749ED79F1517' has a wrong offset!");

}

#pragma pack(pop)
