#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SmasherVimBlueprint

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function SmasherVimBlueprint.SmasherVimBlueprint_C.ExecuteUbergraph_SmasherVimBlueprint
// 0x0150 (0x0150 - 0x0000)
struct SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortAIPawn*                            K2Node_DynamicCast_AsFort_AIPawn;                  // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortMovementStyle                            CallFunc_GetMovementStyle_ReturnValue;             // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_MakeLiteralFloat_ReturnValue;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetAnimAssetPlayerTimeFromEnd_ReturnValue; // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue2;        // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue2;          // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue3;                  // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue4;                  // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetAnimAssetPlayerTimeFromEnd_ReturnValue2; // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue3;        // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              CallFunc_TryGetFortPawn_ReturnValue;               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue5;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue4;        // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue6;                  // 0x0037(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue3;                 // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue5;        // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue7;                  // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_SelectVector_ReturnValue2;                // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable2;                               // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_56[0x2];                                       // 0x0056(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_SelectVector_ReturnValue3;                // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable3;                               // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_SelectVector_ReturnValue4;                // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_SelectVector_ReturnValue5;                // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_SelectVector_ReturnValue6;                // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable4;                               // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_SelectVector_ReturnValue7;                // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_SelectVector_ReturnValue8;                // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortMovementStyle                            Temp_byte_Variable;                                // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Select_Default;                             // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AA[0x2];                                       // 0x00AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_SelectVector_ReturnValue9;                // 0x00AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_SelectVector_ReturnValue10;               // 0x00B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue4;                 // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue2;             // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortAIPawn*                            K2Node_DynamicCast_AsFort_AIPawn2;                 // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTimeX;                           // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakRotator_Roll;                        // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x00E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X;                            // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Y;                            // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Z;                            // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_MakeLiteralFloat_ReturnValue2;            // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0104(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_VSize2D_ReturnValue;                      // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue;               // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ISmasher_Death_C>      K2Node_DynamicCast_AsSmasher_Death;                // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x3];                                      // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue3;             // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue4;             // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortAIPawn*                            K2Node_DynamicCast_AsFort_AIPawn3;                 // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x3];                                      // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IICharge_C>            K2Node_DynamicCast_AsICharge;                      // 0x0134(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess5;                      // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x013D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13E[0x2];                                      // 0x013E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IICharge_C>            K2Node_DynamicCast_AsICharge2;                     // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess6;                      // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue3;          // 0x014A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue5;                 // 0x014B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue8;                  // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue9;                  // 0x014D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint) == 0x000004, "Wrong alignment on SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint");
static_assert(sizeof(SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint) == 0x000150, "Wrong size on SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint");
static_assert(offsetof(SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint, EntryPoint) == 0x000000, "Member 'SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint::EntryPoint' has a wrong offset!");
static_assert(offsetof(SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000004, "Member 'SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint, K2Node_DynamicCast_AsFort_AIPawn) == 0x000008, "Member 'SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint::K2Node_DynamicCast_AsFort_AIPawn' has a wrong offset!");
static_assert(offsetof(SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint, K2Node_DynamicCast_bSuccess) == 0x00000C, "Member 'SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint, CallFunc_Not_PreBool_ReturnValue) == 0x00000D, "Member 'SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint, CallFunc_GetMovementStyle_ReturnValue) == 0x00000E, "Member 'SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint::CallFunc_GetMovementStyle_ReturnValue' has a wrong offset!");
static_assert(offsetof(SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint, CallFunc_NotEqual_FloatFloat_ReturnValue) == 0x00000F, "Member 'SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint::CallFunc_NotEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000010, "Member 'SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000011, "Member 'SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint, CallFunc_BooleanAND_ReturnValue) == 0x000012, "Member 'SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint, CallFunc_BooleanAND_ReturnValue2) == 0x000013, "Member 'SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");
static_assert(offsetof(SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint, CallFunc_MakeLiteralFloat_ReturnValue) == 0x000014, "Member 'SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint::CallFunc_MakeLiteralFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000018, "Member 'SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint, CallFunc_Not_PreBool_ReturnValue2) == 0x00001C, "Member 'SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint::CallFunc_Not_PreBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint, CallFunc_GetAnimAssetPlayerTimeFromEnd_ReturnValue) == 0x000020, "Member 'SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint::CallFunc_GetAnimAssetPlayerTimeFromEnd_ReturnValue' has a wrong offset!");
static_assert(offsetof(SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint, CallFunc_LessEqual_FloatFloat_ReturnValue2) == 0x000024, "Member 'SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint::CallFunc_LessEqual_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint, CallFunc_Greater_FloatFloat_ReturnValue2) == 0x000025, "Member 'SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint::CallFunc_Greater_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint, CallFunc_BooleanAND_ReturnValue3) == 0x000026, "Member 'SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint::CallFunc_BooleanAND_ReturnValue3' has a wrong offset!");
static_assert(offsetof(SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint, CallFunc_BooleanAND_ReturnValue4) == 0x000027, "Member 'SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint::CallFunc_BooleanAND_ReturnValue4' has a wrong offset!");
static_assert(offsetof(SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint, CallFunc_GetAnimAssetPlayerTimeFromEnd_ReturnValue2) == 0x000028, "Member 'SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint::CallFunc_GetAnimAssetPlayerTimeFromEnd_ReturnValue2' has a wrong offset!");
static_assert(offsetof(SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint, CallFunc_LessEqual_FloatFloat_ReturnValue3) == 0x00002C, "Member 'SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint::CallFunc_LessEqual_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00002D, "Member 'SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint, CallFunc_TryGetFortPawn_ReturnValue) == 0x000030, "Member 'SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint::CallFunc_TryGetFortPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint, CallFunc_BooleanAND_ReturnValue5) == 0x000034, "Member 'SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint::CallFunc_BooleanAND_ReturnValue5' has a wrong offset!");
static_assert(offsetof(SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint, CallFunc_LessEqual_FloatFloat_ReturnValue4) == 0x000035, "Member 'SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint::CallFunc_LessEqual_FloatFloat_ReturnValue4' has a wrong offset!");
static_assert(offsetof(SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000036, "Member 'SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint, CallFunc_BooleanAND_ReturnValue6) == 0x000037, "Member 'SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint::CallFunc_BooleanAND_ReturnValue6' has a wrong offset!");
static_assert(offsetof(SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint, CallFunc_Not_PreBool_ReturnValue3) == 0x000038, "Member 'SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint::CallFunc_Not_PreBool_ReturnValue3' has a wrong offset!");
static_assert(offsetof(SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint, CallFunc_LessEqual_FloatFloat_ReturnValue5) == 0x000039, "Member 'SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint::CallFunc_LessEqual_FloatFloat_ReturnValue5' has a wrong offset!");
static_assert(offsetof(SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint, CallFunc_BooleanAND_ReturnValue7) == 0x00003A, "Member 'SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint::CallFunc_BooleanAND_ReturnValue7' has a wrong offset!");
static_assert(offsetof(SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x00003B, "Member 'SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint, CallFunc_SelectVector_ReturnValue) == 0x00003C, "Member 'SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint, CallFunc_SelectVector_ReturnValue2) == 0x000048, "Member 'SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint::CallFunc_SelectVector_ReturnValue2' has a wrong offset!");
static_assert(offsetof(SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint, Temp_bool_Variable) == 0x000054, "Member 'SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint, Temp_bool_Variable2) == 0x000055, "Member 'SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint, CallFunc_SelectVector_ReturnValue3) == 0x000058, "Member 'SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint::CallFunc_SelectVector_ReturnValue3' has a wrong offset!");
static_assert(offsetof(SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint, Temp_bool_Variable3) == 0x000064, "Member 'SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint, CallFunc_SelectVector_ReturnValue4) == 0x000068, "Member 'SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint::CallFunc_SelectVector_ReturnValue4' has a wrong offset!");
static_assert(offsetof(SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint, CallFunc_SelectVector_ReturnValue5) == 0x000074, "Member 'SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint::CallFunc_SelectVector_ReturnValue5' has a wrong offset!");
static_assert(offsetof(SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint, CallFunc_SelectVector_ReturnValue6) == 0x000080, "Member 'SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint::CallFunc_SelectVector_ReturnValue6' has a wrong offset!");
static_assert(offsetof(SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint, Temp_bool_Variable4) == 0x00008C, "Member 'SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint::Temp_bool_Variable4' has a wrong offset!");
static_assert(offsetof(SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint, CallFunc_SelectVector_ReturnValue7) == 0x000090, "Member 'SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint::CallFunc_SelectVector_ReturnValue7' has a wrong offset!");
static_assert(offsetof(SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint, CallFunc_SelectVector_ReturnValue8) == 0x00009C, "Member 'SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint::CallFunc_SelectVector_ReturnValue8' has a wrong offset!");
static_assert(offsetof(SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint, Temp_byte_Variable) == 0x0000A8, "Member 'SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint, K2Node_Select_Default) == 0x0000A9, "Member 'SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint, CallFunc_SelectVector_ReturnValue9) == 0x0000AC, "Member 'SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint::CallFunc_SelectVector_ReturnValue9' has a wrong offset!");
static_assert(offsetof(SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint, CallFunc_SelectVector_ReturnValue10) == 0x0000B8, "Member 'SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint::CallFunc_SelectVector_ReturnValue10' has a wrong offset!");
static_assert(offsetof(SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint, CallFunc_Not_PreBool_ReturnValue4) == 0x0000C4, "Member 'SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint::CallFunc_Not_PreBool_ReturnValue4' has a wrong offset!");
static_assert(offsetof(SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint, CallFunc_TryGetPawnOwner_ReturnValue2) == 0x0000C8, "Member 'SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint::CallFunc_TryGetPawnOwner_ReturnValue2' has a wrong offset!");
static_assert(offsetof(SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint, K2Node_DynamicCast_AsFort_AIPawn2) == 0x0000CC, "Member 'SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint::K2Node_DynamicCast_AsFort_AIPawn2' has a wrong offset!");
static_assert(offsetof(SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint, K2Node_DynamicCast_bSuccess2) == 0x0000D0, "Member 'SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint, K2Node_Event_DeltaTimeX) == 0x0000D4, "Member 'SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint, CallFunc_Greater_IntInt_ReturnValue) == 0x0000D8, "Member 'SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint, CallFunc_BreakRotator_Roll) == 0x0000DC, "Member 'SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint, CallFunc_BreakRotator_Pitch) == 0x0000E0, "Member 'SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint, CallFunc_BreakRotator_Yaw) == 0x0000E4, "Member 'SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint, CallFunc_GetVelocity_ReturnValue) == 0x0000E8, "Member 'SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint, CallFunc_BreakVector_X) == 0x0000F4, "Member 'SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint, CallFunc_BreakVector_Y) == 0x0000F8, "Member 'SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint, CallFunc_BreakVector_Z) == 0x0000FC, "Member 'SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint, CallFunc_MakeLiteralFloat_ReturnValue2) == 0x000100, "Member 'SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint::CallFunc_MakeLiteralFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint, CallFunc_MakeVector2D_ReturnValue) == 0x000104, "Member 'SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint, CallFunc_VSize2D_ReturnValue) == 0x00010C, "Member 'SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint::CallFunc_VSize2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint, CallFunc_GetOwningActor_ReturnValue) == 0x000110, "Member 'SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint::CallFunc_GetOwningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint, CallFunc_RandomIntegerInRange_ReturnValue) == 0x000114, "Member 'SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint, K2Node_DynamicCast_AsSmasher_Death) == 0x000118, "Member 'SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint::K2Node_DynamicCast_AsSmasher_Death' has a wrong offset!");
static_assert(offsetof(SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint, K2Node_DynamicCast_bSuccess3) == 0x000120, "Member 'SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint, CallFunc_TryGetPawnOwner_ReturnValue3) == 0x000124, "Member 'SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint::CallFunc_TryGetPawnOwner_ReturnValue3' has a wrong offset!");
static_assert(offsetof(SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint, CallFunc_TryGetPawnOwner_ReturnValue4) == 0x000128, "Member 'SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint::CallFunc_TryGetPawnOwner_ReturnValue4' has a wrong offset!");
static_assert(offsetof(SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint, K2Node_DynamicCast_AsFort_AIPawn3) == 0x00012C, "Member 'SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint::K2Node_DynamicCast_AsFort_AIPawn3' has a wrong offset!");
static_assert(offsetof(SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint, K2Node_DynamicCast_bSuccess4) == 0x000130, "Member 'SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint, K2Node_DynamicCast_AsICharge) == 0x000134, "Member 'SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint::K2Node_DynamicCast_AsICharge' has a wrong offset!");
static_assert(offsetof(SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint, K2Node_DynamicCast_bSuccess5) == 0x00013C, "Member 'SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint::K2Node_DynamicCast_bSuccess5' has a wrong offset!");
static_assert(offsetof(SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint, CallFunc_EqualEqual_NameName_ReturnValue) == 0x00013D, "Member 'SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint, K2Node_DynamicCast_AsICharge2) == 0x000140, "Member 'SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint::K2Node_DynamicCast_AsICharge2' has a wrong offset!");
static_assert(offsetof(SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint, K2Node_DynamicCast_bSuccess6) == 0x000148, "Member 'SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint::K2Node_DynamicCast_bSuccess6' has a wrong offset!");
static_assert(offsetof(SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint, K2Node_SwitchEnum_CmpSuccess) == 0x000149, "Member 'SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint, CallFunc_Greater_FloatFloat_ReturnValue3) == 0x00014A, "Member 'SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint::CallFunc_Greater_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint, CallFunc_Not_PreBool_ReturnValue5) == 0x00014B, "Member 'SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint::CallFunc_Not_PreBool_ReturnValue5' has a wrong offset!");
static_assert(offsetof(SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint, CallFunc_BooleanAND_ReturnValue8) == 0x00014C, "Member 'SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint::CallFunc_BooleanAND_ReturnValue8' has a wrong offset!");
static_assert(offsetof(SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint, CallFunc_BooleanAND_ReturnValue9) == 0x00014D, "Member 'SmasherVimBlueprint_C_ExecuteUbergraph_SmasherVimBlueprint::CallFunc_BooleanAND_ReturnValue9' has a wrong offset!");

// Function SmasherVimBlueprint.SmasherVimBlueprint_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct SmasherVimBlueprint_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SmasherVimBlueprint_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on SmasherVimBlueprint_C_BlueprintUpdateAnimation");
static_assert(sizeof(SmasherVimBlueprint_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on SmasherVimBlueprint_C_BlueprintUpdateAnimation");
static_assert(offsetof(SmasherVimBlueprint_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'SmasherVimBlueprint_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

}

#pragma pack(pop)
