#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SmasherVimBlueprint

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// AnimBlueprintGeneratedClass SmasherVimBlueprint.SmasherVimBlueprint_C
// 0x1330 (0x1770 - 0x0440)
class USmasherVimBlueprint_C final : public UFortAnimInstance
{
public:
	uint8                                         Pad_438[0x8];                                      // 0x0438(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0440(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_5450F9C64B26FAA15A7727BF57F8F488; // 0x0444(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_D06D743D425B7D3C8406EFBD08A68E63; // 0x048C(0x002C)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_21758F27442D28543DEC42872EF89A37; // 0x04B8(0x002C)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6FC4F6E34980671B8CA4B4B2CD6FD910; // 0x04E4(0x002C)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_B689746C43A09BADCA561E824233D6DB; // 0x0510(0x002C)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_A2A1332F47C86679A519E9B5F96C38F9; // 0x053C(0x002C)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_854F7DBB41A386B898E3D9B5031F823F; // 0x0568(0x002C)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2409051E470233A11EF7D7990A14F60C; // 0x0594(0x002C)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9CEC73804ACDA2E1261690879C9C187C; // 0x05C0(0x002C)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_2F62B99A4BAA1EF83667A18D506D29F8; // 0x05EC(0x002C)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_FCE49AD64EB4DF949728BFA35B4E5EE3; // 0x0618(0x0058)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_52BFE79F437D30059F178C9E15A5C4CC; // 0x0670(0x002C)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_99C31F56427E8F457E63C2AF44A426B1; // 0x069C(0x002C)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_FE4195FC43F5F9BCAAF69885D08B8652; // 0x06C8(0x0058)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_745C2C5440AF055F81539AB5B7188E58; // 0x0720(0x0094)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_54AF998844A8EEC33A77869D1DEDBC5B; // 0x07B4(0x0058)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_13FCB8264963D347E5912E86DC90A470; // 0x080C(0x002C)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_63828756424DA8DC028F07A616F97354; // 0x0838(0x002C)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_423B60DA43DE550FF0E9D6BD5D6D8DFE; // 0x0864(0x0058)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_AB4FB8F24DB124EAECA4279831DBADD0; // 0x08BC(0x0058)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_819813EE4F1C839E76ADB19765B7B82C; // 0x0914(0x008C)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_0436E42E486247132ACFC5822906F086; // 0x09A0(0x0058)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_C87CEEF34F96245643EBF2BE420575E1; // 0x09F8(0x002C)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_A3E9995B41504C52D176278A7E39A682; // 0x0A24(0x002C)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4FFB048A48B4A76CD9D88EB0B8144EA2; // 0x0A50(0x0058)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_FE11925047A7523852B87280347D5FD0; // 0x0AA8(0x0094)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_9587DA7E45E2B3F31B460E8B58F6B403; // 0x0B3C(0x0044)()
	struct FAnimNode_Root                         AnimGraphNode_Root_D2C6F6F94C255FCE32E7B0861950FE5F; // 0x0B80(0x002C)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_EBED57694E0E2CADB8B9DFAA66CCB510; // 0x0BAC(0x002C)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4543AFF04CB7C29FB19BDC96C2C8A31B; // 0x0BD8(0x002C)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_AB84C774402F1AAAA82ED0AD0A627A88; // 0x0C04(0x002C)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_F6A7347E457F5E8A79D66E830D83EB56; // 0x0C30(0x002C)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6BAF0B754B3DA5623F293DA302822766; // 0x0C5C(0x0058)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_E8E1B8C64DEF0EE7C0C793A69F926F46; // 0x0CB4(0x002C)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_D3394ECC4E8D1352E85F3CA8B8F3EA95; // 0x0CE0(0x0058)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_6867C5AA4074FAD0A935E1B3FFD3AF36; // 0x0D38(0x002C)()
	struct FAnimNode_RefPose                      AnimGraphNode_IdentityPose_37B8B574405B0E647B4B0A91B751A69F; // 0x0D64(0x0024)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_0E237D504BFF9C1203C3258D68121C0A; // 0x0D88(0x002C)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_E91BA3F343A90BBE7C0AE990A1746DB4; // 0x0DB4(0x0094)()
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK_48047F004CB41222F5B4388F9DCC593F; // 0x0E48(0x008C)()
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK_B813041441B0CFB17DFBB4A757025061; // 0x0ED4(0x008C)()
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK_C820F2EB423F7CC747F140B43E22DD3E; // 0x0F60(0x008C)()
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK_2CDDA8BE415F026814E029BBE0EF5B83; // 0x0FEC(0x008C)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_C1D86F134D5174CDF7CFE281E4BE1882; // 0x1078(0x002C)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_4355AED64A7A2B7EDEDCFA9763CB0B7B; // 0x10A4(0x002C)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_D18A859C4B1C5EEC3FA79FB03015083E; // 0x10D0(0x0080)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_0C1A1F654C532DE5E0EE8C8881BC5B0A; // 0x1150(0x0080)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_5D544DED4C4F6C95531C99BB32D2A777; // 0x11D0(0x0080)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_C57A8C154EF13DC5678B73B5220B3CAE; // 0x1250(0x0080)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_EE50F21346C98188970BD395EF1117CE; // 0x12D0(0x0080)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_FE2A59D94F43D50C23255A8C6F3CF506; // 0x1350(0x0080)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_0069016846B3FD93F6EC12A7CFA07428; // 0x13D0(0x0080)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_CF176FD743A66BFD36854CB197A1A3E8; // 0x1450(0x0080)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_57ABC4F840F648B39B363B944C0D8F06; // 0x14D0(0x0080)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_E7D0DA334134373D8546B585A00DAA4B; // 0x1550(0x0080)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_75FFB9E344A3B92DDFDF319778BE789E; // 0x15D0(0x0080)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_B8D252F5447C8D5397D9A18555D2270E; // 0x1650(0x0080)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_A5A8B991460CE2AA2C3B6EB20AE24CFD; // 0x16D0(0x0080)()
	float                                         Speed;                                             // 0x1750(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         MovementDirection;                                 // 0x1754(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         RotationRate;                                      // 0x1758(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Charging;                                          // 0x175C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ShouldRun;                                         // 0x175D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bPlayAdditiveCringe;                               // 0x175E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_175F[0x1];                                     // 0x175F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         whichCringe;                                       // 0x1760(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          BossSmasher;                                       // 0x1764(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1765[0x3];                                     // 0x1765(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortAIPawn*                            FortAIPawnOwner;                                   // 0x1768(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_SmasherVimBlueprint(int32 EntryPoint);
	void AnimNotify_Start_Death_Effect();
	void AnimNotify_ExitedChargeWarningState();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SmasherVimBlueprint_AnimGraphNode_ModifyBone_A5A8B991460CE2AA2C3B6EB20AE24CFD();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SmasherVimBlueprint_AnimGraphNode_ModifyBone_B8D252F5447C8D5397D9A18555D2270E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SmasherVimBlueprint_AnimGraphNode_ModifyBone_75FFB9E344A3B92DDFDF319778BE789E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SmasherVimBlueprint_AnimGraphNode_ModifyBone_E7D0DA334134373D8546B585A00DAA4B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SmasherVimBlueprint_AnimGraphNode_ModifyBone_57ABC4F840F648B39B363B944C0D8F06();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SmasherVimBlueprint_AnimGraphNode_ModifyBone_CF176FD743A66BFD36854CB197A1A3E8();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SmasherVimBlueprint_AnimGraphNode_ModifyBone_0069016846B3FD93F6EC12A7CFA07428();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SmasherVimBlueprint_AnimGraphNode_ModifyBone_FE2A59D94F43D50C23255A8C6F3CF506();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SmasherVimBlueprint_AnimGraphNode_ModifyBone_EE50F21346C98188970BD395EF1117CE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SmasherVimBlueprint_AnimGraphNode_ModifyBone_C57A8C154EF13DC5678B73B5220B3CAE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SmasherVimBlueprint_AnimGraphNode_ModifyBone_5D544DED4C4F6C95531C99BB32D2A777();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SmasherVimBlueprint_AnimGraphNode_ModifyBone_0C1A1F654C532DE5E0EE8C8881BC5B0A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SmasherVimBlueprint_AnimGraphNode_ModifyBone_D18A859C4B1C5EEC3FA79FB03015083E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SmasherVimBlueprint_AnimGraphNode_TransitionResult_F6A7347E457F5E8A79D66E830D83EB56();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SmasherVimBlueprint_AnimGraphNode_TransitionResult_AB84C774402F1AAAA82ED0AD0A627A88();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SmasherVimBlueprint_AnimGraphNode_TransitionResult_4543AFF04CB7C29FB19BDC96C2C8A31B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SmasherVimBlueprint_AnimGraphNode_TransitionResult_EBED57694E0E2CADB8B9DFAA66CCB510();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SmasherVimBlueprint_AnimGraphNode_SequencePlayer_0436E42E486247132ACFC5822906F086();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SmasherVimBlueprint_AnimGraphNode_BlendListByBool_819813EE4F1C839E76ADB19765B7B82C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SmasherVimBlueprint_AnimGraphNode_TransitionResult_9CEC73804ACDA2E1261690879C9C187C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SmasherVimBlueprint_AnimGraphNode_TransitionResult_2409051E470233A11EF7D7990A14F60C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SmasherVimBlueprint_AnimGraphNode_TransitionResult_854F7DBB41A386B898E3D9B5031F823F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SmasherVimBlueprint_AnimGraphNode_TransitionResult_A2A1332F47C86679A519E9B5F96C38F9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SmasherVimBlueprint_AnimGraphNode_TransitionResult_6FC4F6E34980671B8CA4B4B2CD6FD910();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SmasherVimBlueprint_AnimGraphNode_TransitionResult_21758F27442D28543DEC42872EF89A37();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SmasherVimBlueprint_C">();
	}
	static class USmasherVimBlueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USmasherVimBlueprint_C>();
	}
};
static_assert(alignof(USmasherVimBlueprint_C) == 0x000010, "Wrong alignment on USmasherVimBlueprint_C");
static_assert(sizeof(USmasherVimBlueprint_C) == 0x001770, "Wrong size on USmasherVimBlueprint_C");
static_assert(offsetof(USmasherVimBlueprint_C, UberGraphFrame) == 0x000440, "Member 'USmasherVimBlueprint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USmasherVimBlueprint_C, AnimGraphNode_ApplyAdditive_5450F9C64B26FAA15A7727BF57F8F488) == 0x000444, "Member 'USmasherVimBlueprint_C::AnimGraphNode_ApplyAdditive_5450F9C64B26FAA15A7727BF57F8F488' has a wrong offset!");
static_assert(offsetof(USmasherVimBlueprint_C, AnimGraphNode_TransitionResult_D06D743D425B7D3C8406EFBD08A68E63) == 0x00048C, "Member 'USmasherVimBlueprint_C::AnimGraphNode_TransitionResult_D06D743D425B7D3C8406EFBD08A68E63' has a wrong offset!");
static_assert(offsetof(USmasherVimBlueprint_C, AnimGraphNode_TransitionResult_21758F27442D28543DEC42872EF89A37) == 0x0004B8, "Member 'USmasherVimBlueprint_C::AnimGraphNode_TransitionResult_21758F27442D28543DEC42872EF89A37' has a wrong offset!");
static_assert(offsetof(USmasherVimBlueprint_C, AnimGraphNode_TransitionResult_6FC4F6E34980671B8CA4B4B2CD6FD910) == 0x0004E4, "Member 'USmasherVimBlueprint_C::AnimGraphNode_TransitionResult_6FC4F6E34980671B8CA4B4B2CD6FD910' has a wrong offset!");
static_assert(offsetof(USmasherVimBlueprint_C, AnimGraphNode_TransitionResult_B689746C43A09BADCA561E824233D6DB) == 0x000510, "Member 'USmasherVimBlueprint_C::AnimGraphNode_TransitionResult_B689746C43A09BADCA561E824233D6DB' has a wrong offset!");
static_assert(offsetof(USmasherVimBlueprint_C, AnimGraphNode_TransitionResult_A2A1332F47C86679A519E9B5F96C38F9) == 0x00053C, "Member 'USmasherVimBlueprint_C::AnimGraphNode_TransitionResult_A2A1332F47C86679A519E9B5F96C38F9' has a wrong offset!");
static_assert(offsetof(USmasherVimBlueprint_C, AnimGraphNode_TransitionResult_854F7DBB41A386B898E3D9B5031F823F) == 0x000568, "Member 'USmasherVimBlueprint_C::AnimGraphNode_TransitionResult_854F7DBB41A386B898E3D9B5031F823F' has a wrong offset!");
static_assert(offsetof(USmasherVimBlueprint_C, AnimGraphNode_TransitionResult_2409051E470233A11EF7D7990A14F60C) == 0x000594, "Member 'USmasherVimBlueprint_C::AnimGraphNode_TransitionResult_2409051E470233A11EF7D7990A14F60C' has a wrong offset!");
static_assert(offsetof(USmasherVimBlueprint_C, AnimGraphNode_TransitionResult_9CEC73804ACDA2E1261690879C9C187C) == 0x0005C0, "Member 'USmasherVimBlueprint_C::AnimGraphNode_TransitionResult_9CEC73804ACDA2E1261690879C9C187C' has a wrong offset!");
static_assert(offsetof(USmasherVimBlueprint_C, AnimGraphNode_StateResult_2F62B99A4BAA1EF83667A18D506D29F8) == 0x0005EC, "Member 'USmasherVimBlueprint_C::AnimGraphNode_StateResult_2F62B99A4BAA1EF83667A18D506D29F8' has a wrong offset!");
static_assert(offsetof(USmasherVimBlueprint_C, AnimGraphNode_SequencePlayer_FCE49AD64EB4DF949728BFA35B4E5EE3) == 0x000618, "Member 'USmasherVimBlueprint_C::AnimGraphNode_SequencePlayer_FCE49AD64EB4DF949728BFA35B4E5EE3' has a wrong offset!");
static_assert(offsetof(USmasherVimBlueprint_C, AnimGraphNode_StateResult_52BFE79F437D30059F178C9E15A5C4CC) == 0x000670, "Member 'USmasherVimBlueprint_C::AnimGraphNode_StateResult_52BFE79F437D30059F178C9E15A5C4CC' has a wrong offset!");
static_assert(offsetof(USmasherVimBlueprint_C, AnimGraphNode_StateResult_99C31F56427E8F457E63C2AF44A426B1) == 0x00069C, "Member 'USmasherVimBlueprint_C::AnimGraphNode_StateResult_99C31F56427E8F457E63C2AF44A426B1' has a wrong offset!");
static_assert(offsetof(USmasherVimBlueprint_C, AnimGraphNode_SequencePlayer_FE4195FC43F5F9BCAAF69885D08B8652) == 0x0006C8, "Member 'USmasherVimBlueprint_C::AnimGraphNode_SequencePlayer_FE4195FC43F5F9BCAAF69885D08B8652' has a wrong offset!");
static_assert(offsetof(USmasherVimBlueprint_C, AnimGraphNode_StateMachine_745C2C5440AF055F81539AB5B7188E58) == 0x000720, "Member 'USmasherVimBlueprint_C::AnimGraphNode_StateMachine_745C2C5440AF055F81539AB5B7188E58' has a wrong offset!");
static_assert(offsetof(USmasherVimBlueprint_C, AnimGraphNode_SequencePlayer_54AF998844A8EEC33A77869D1DEDBC5B) == 0x0007B4, "Member 'USmasherVimBlueprint_C::AnimGraphNode_SequencePlayer_54AF998844A8EEC33A77869D1DEDBC5B' has a wrong offset!");
static_assert(offsetof(USmasherVimBlueprint_C, AnimGraphNode_StateResult_13FCB8264963D347E5912E86DC90A470) == 0x00080C, "Member 'USmasherVimBlueprint_C::AnimGraphNode_StateResult_13FCB8264963D347E5912E86DC90A470' has a wrong offset!");
static_assert(offsetof(USmasherVimBlueprint_C, AnimGraphNode_StateResult_63828756424DA8DC028F07A616F97354) == 0x000838, "Member 'USmasherVimBlueprint_C::AnimGraphNode_StateResult_63828756424DA8DC028F07A616F97354' has a wrong offset!");
static_assert(offsetof(USmasherVimBlueprint_C, AnimGraphNode_SequencePlayer_423B60DA43DE550FF0E9D6BD5D6D8DFE) == 0x000864, "Member 'USmasherVimBlueprint_C::AnimGraphNode_SequencePlayer_423B60DA43DE550FF0E9D6BD5D6D8DFE' has a wrong offset!");
static_assert(offsetof(USmasherVimBlueprint_C, AnimGraphNode_SequencePlayer_AB4FB8F24DB124EAECA4279831DBADD0) == 0x0008BC, "Member 'USmasherVimBlueprint_C::AnimGraphNode_SequencePlayer_AB4FB8F24DB124EAECA4279831DBADD0' has a wrong offset!");
static_assert(offsetof(USmasherVimBlueprint_C, AnimGraphNode_BlendListByBool_819813EE4F1C839E76ADB19765B7B82C) == 0x000914, "Member 'USmasherVimBlueprint_C::AnimGraphNode_BlendListByBool_819813EE4F1C839E76ADB19765B7B82C' has a wrong offset!");
static_assert(offsetof(USmasherVimBlueprint_C, AnimGraphNode_SequencePlayer_0436E42E486247132ACFC5822906F086) == 0x0009A0, "Member 'USmasherVimBlueprint_C::AnimGraphNode_SequencePlayer_0436E42E486247132ACFC5822906F086' has a wrong offset!");
static_assert(offsetof(USmasherVimBlueprint_C, AnimGraphNode_StateResult_C87CEEF34F96245643EBF2BE420575E1) == 0x0009F8, "Member 'USmasherVimBlueprint_C::AnimGraphNode_StateResult_C87CEEF34F96245643EBF2BE420575E1' has a wrong offset!");
static_assert(offsetof(USmasherVimBlueprint_C, AnimGraphNode_StateResult_A3E9995B41504C52D176278A7E39A682) == 0x000A24, "Member 'USmasherVimBlueprint_C::AnimGraphNode_StateResult_A3E9995B41504C52D176278A7E39A682' has a wrong offset!");
static_assert(offsetof(USmasherVimBlueprint_C, AnimGraphNode_SequencePlayer_4FFB048A48B4A76CD9D88EB0B8144EA2) == 0x000A50, "Member 'USmasherVimBlueprint_C::AnimGraphNode_SequencePlayer_4FFB048A48B4A76CD9D88EB0B8144EA2' has a wrong offset!");
static_assert(offsetof(USmasherVimBlueprint_C, AnimGraphNode_StateMachine_FE11925047A7523852B87280347D5FD0) == 0x000AA8, "Member 'USmasherVimBlueprint_C::AnimGraphNode_StateMachine_FE11925047A7523852B87280347D5FD0' has a wrong offset!");
static_assert(offsetof(USmasherVimBlueprint_C, AnimGraphNode_Slot_9587DA7E45E2B3F31B460E8B58F6B403) == 0x000B3C, "Member 'USmasherVimBlueprint_C::AnimGraphNode_Slot_9587DA7E45E2B3F31B460E8B58F6B403' has a wrong offset!");
static_assert(offsetof(USmasherVimBlueprint_C, AnimGraphNode_Root_D2C6F6F94C255FCE32E7B0861950FE5F) == 0x000B80, "Member 'USmasherVimBlueprint_C::AnimGraphNode_Root_D2C6F6F94C255FCE32E7B0861950FE5F' has a wrong offset!");
static_assert(offsetof(USmasherVimBlueprint_C, AnimGraphNode_TransitionResult_EBED57694E0E2CADB8B9DFAA66CCB510) == 0x000BAC, "Member 'USmasherVimBlueprint_C::AnimGraphNode_TransitionResult_EBED57694E0E2CADB8B9DFAA66CCB510' has a wrong offset!");
static_assert(offsetof(USmasherVimBlueprint_C, AnimGraphNode_TransitionResult_4543AFF04CB7C29FB19BDC96C2C8A31B) == 0x000BD8, "Member 'USmasherVimBlueprint_C::AnimGraphNode_TransitionResult_4543AFF04CB7C29FB19BDC96C2C8A31B' has a wrong offset!");
static_assert(offsetof(USmasherVimBlueprint_C, AnimGraphNode_TransitionResult_AB84C774402F1AAAA82ED0AD0A627A88) == 0x000C04, "Member 'USmasherVimBlueprint_C::AnimGraphNode_TransitionResult_AB84C774402F1AAAA82ED0AD0A627A88' has a wrong offset!");
static_assert(offsetof(USmasherVimBlueprint_C, AnimGraphNode_TransitionResult_F6A7347E457F5E8A79D66E830D83EB56) == 0x000C30, "Member 'USmasherVimBlueprint_C::AnimGraphNode_TransitionResult_F6A7347E457F5E8A79D66E830D83EB56' has a wrong offset!");
static_assert(offsetof(USmasherVimBlueprint_C, AnimGraphNode_SequencePlayer_6BAF0B754B3DA5623F293DA302822766) == 0x000C5C, "Member 'USmasherVimBlueprint_C::AnimGraphNode_SequencePlayer_6BAF0B754B3DA5623F293DA302822766' has a wrong offset!");
static_assert(offsetof(USmasherVimBlueprint_C, AnimGraphNode_StateResult_E8E1B8C64DEF0EE7C0C793A69F926F46) == 0x000CB4, "Member 'USmasherVimBlueprint_C::AnimGraphNode_StateResult_E8E1B8C64DEF0EE7C0C793A69F926F46' has a wrong offset!");
static_assert(offsetof(USmasherVimBlueprint_C, AnimGraphNode_SequencePlayer_D3394ECC4E8D1352E85F3CA8B8F3EA95) == 0x000CE0, "Member 'USmasherVimBlueprint_C::AnimGraphNode_SequencePlayer_D3394ECC4E8D1352E85F3CA8B8F3EA95' has a wrong offset!");
static_assert(offsetof(USmasherVimBlueprint_C, AnimGraphNode_StateResult_6867C5AA4074FAD0A935E1B3FFD3AF36) == 0x000D38, "Member 'USmasherVimBlueprint_C::AnimGraphNode_StateResult_6867C5AA4074FAD0A935E1B3FFD3AF36' has a wrong offset!");
static_assert(offsetof(USmasherVimBlueprint_C, AnimGraphNode_IdentityPose_37B8B574405B0E647B4B0A91B751A69F) == 0x000D64, "Member 'USmasherVimBlueprint_C::AnimGraphNode_IdentityPose_37B8B574405B0E647B4B0A91B751A69F' has a wrong offset!");
static_assert(offsetof(USmasherVimBlueprint_C, AnimGraphNode_StateResult_0E237D504BFF9C1203C3258D68121C0A) == 0x000D88, "Member 'USmasherVimBlueprint_C::AnimGraphNode_StateResult_0E237D504BFF9C1203C3258D68121C0A' has a wrong offset!");
static_assert(offsetof(USmasherVimBlueprint_C, AnimGraphNode_StateMachine_E91BA3F343A90BBE7C0AE990A1746DB4) == 0x000DB4, "Member 'USmasherVimBlueprint_C::AnimGraphNode_StateMachine_E91BA3F343A90BBE7C0AE990A1746DB4' has a wrong offset!");
static_assert(offsetof(USmasherVimBlueprint_C, AnimGraphNode_TwoBoneIK_48047F004CB41222F5B4388F9DCC593F) == 0x000E48, "Member 'USmasherVimBlueprint_C::AnimGraphNode_TwoBoneIK_48047F004CB41222F5B4388F9DCC593F' has a wrong offset!");
static_assert(offsetof(USmasherVimBlueprint_C, AnimGraphNode_TwoBoneIK_B813041441B0CFB17DFBB4A757025061) == 0x000ED4, "Member 'USmasherVimBlueprint_C::AnimGraphNode_TwoBoneIK_B813041441B0CFB17DFBB4A757025061' has a wrong offset!");
static_assert(offsetof(USmasherVimBlueprint_C, AnimGraphNode_TwoBoneIK_C820F2EB423F7CC747F140B43E22DD3E) == 0x000F60, "Member 'USmasherVimBlueprint_C::AnimGraphNode_TwoBoneIK_C820F2EB423F7CC747F140B43E22DD3E' has a wrong offset!");
static_assert(offsetof(USmasherVimBlueprint_C, AnimGraphNode_TwoBoneIK_2CDDA8BE415F026814E029BBE0EF5B83) == 0x000FEC, "Member 'USmasherVimBlueprint_C::AnimGraphNode_TwoBoneIK_2CDDA8BE415F026814E029BBE0EF5B83' has a wrong offset!");
static_assert(offsetof(USmasherVimBlueprint_C, AnimGraphNode_LocalToComponentSpace_C1D86F134D5174CDF7CFE281E4BE1882) == 0x001078, "Member 'USmasherVimBlueprint_C::AnimGraphNode_LocalToComponentSpace_C1D86F134D5174CDF7CFE281E4BE1882' has a wrong offset!");
static_assert(offsetof(USmasherVimBlueprint_C, AnimGraphNode_ComponentToLocalSpace_4355AED64A7A2B7EDEDCFA9763CB0B7B) == 0x0010A4, "Member 'USmasherVimBlueprint_C::AnimGraphNode_ComponentToLocalSpace_4355AED64A7A2B7EDEDCFA9763CB0B7B' has a wrong offset!");
static_assert(offsetof(USmasherVimBlueprint_C, AnimGraphNode_ModifyBone_D18A859C4B1C5EEC3FA79FB03015083E) == 0x0010D0, "Member 'USmasherVimBlueprint_C::AnimGraphNode_ModifyBone_D18A859C4B1C5EEC3FA79FB03015083E' has a wrong offset!");
static_assert(offsetof(USmasherVimBlueprint_C, AnimGraphNode_ModifyBone_0C1A1F654C532DE5E0EE8C8881BC5B0A) == 0x001150, "Member 'USmasherVimBlueprint_C::AnimGraphNode_ModifyBone_0C1A1F654C532DE5E0EE8C8881BC5B0A' has a wrong offset!");
static_assert(offsetof(USmasherVimBlueprint_C, AnimGraphNode_ModifyBone_5D544DED4C4F6C95531C99BB32D2A777) == 0x0011D0, "Member 'USmasherVimBlueprint_C::AnimGraphNode_ModifyBone_5D544DED4C4F6C95531C99BB32D2A777' has a wrong offset!");
static_assert(offsetof(USmasherVimBlueprint_C, AnimGraphNode_ModifyBone_C57A8C154EF13DC5678B73B5220B3CAE) == 0x001250, "Member 'USmasherVimBlueprint_C::AnimGraphNode_ModifyBone_C57A8C154EF13DC5678B73B5220B3CAE' has a wrong offset!");
static_assert(offsetof(USmasherVimBlueprint_C, AnimGraphNode_ModifyBone_EE50F21346C98188970BD395EF1117CE) == 0x0012D0, "Member 'USmasherVimBlueprint_C::AnimGraphNode_ModifyBone_EE50F21346C98188970BD395EF1117CE' has a wrong offset!");
static_assert(offsetof(USmasherVimBlueprint_C, AnimGraphNode_ModifyBone_FE2A59D94F43D50C23255A8C6F3CF506) == 0x001350, "Member 'USmasherVimBlueprint_C::AnimGraphNode_ModifyBone_FE2A59D94F43D50C23255A8C6F3CF506' has a wrong offset!");
static_assert(offsetof(USmasherVimBlueprint_C, AnimGraphNode_ModifyBone_0069016846B3FD93F6EC12A7CFA07428) == 0x0013D0, "Member 'USmasherVimBlueprint_C::AnimGraphNode_ModifyBone_0069016846B3FD93F6EC12A7CFA07428' has a wrong offset!");
static_assert(offsetof(USmasherVimBlueprint_C, AnimGraphNode_ModifyBone_CF176FD743A66BFD36854CB197A1A3E8) == 0x001450, "Member 'USmasherVimBlueprint_C::AnimGraphNode_ModifyBone_CF176FD743A66BFD36854CB197A1A3E8' has a wrong offset!");
static_assert(offsetof(USmasherVimBlueprint_C, AnimGraphNode_ModifyBone_57ABC4F840F648B39B363B944C0D8F06) == 0x0014D0, "Member 'USmasherVimBlueprint_C::AnimGraphNode_ModifyBone_57ABC4F840F648B39B363B944C0D8F06' has a wrong offset!");
static_assert(offsetof(USmasherVimBlueprint_C, AnimGraphNode_ModifyBone_E7D0DA334134373D8546B585A00DAA4B) == 0x001550, "Member 'USmasherVimBlueprint_C::AnimGraphNode_ModifyBone_E7D0DA334134373D8546B585A00DAA4B' has a wrong offset!");
static_assert(offsetof(USmasherVimBlueprint_C, AnimGraphNode_ModifyBone_75FFB9E344A3B92DDFDF319778BE789E) == 0x0015D0, "Member 'USmasherVimBlueprint_C::AnimGraphNode_ModifyBone_75FFB9E344A3B92DDFDF319778BE789E' has a wrong offset!");
static_assert(offsetof(USmasherVimBlueprint_C, AnimGraphNode_ModifyBone_B8D252F5447C8D5397D9A18555D2270E) == 0x001650, "Member 'USmasherVimBlueprint_C::AnimGraphNode_ModifyBone_B8D252F5447C8D5397D9A18555D2270E' has a wrong offset!");
static_assert(offsetof(USmasherVimBlueprint_C, AnimGraphNode_ModifyBone_A5A8B991460CE2AA2C3B6EB20AE24CFD) == 0x0016D0, "Member 'USmasherVimBlueprint_C::AnimGraphNode_ModifyBone_A5A8B991460CE2AA2C3B6EB20AE24CFD' has a wrong offset!");
static_assert(offsetof(USmasherVimBlueprint_C, Speed) == 0x001750, "Member 'USmasherVimBlueprint_C::Speed' has a wrong offset!");
static_assert(offsetof(USmasherVimBlueprint_C, MovementDirection) == 0x001754, "Member 'USmasherVimBlueprint_C::MovementDirection' has a wrong offset!");
static_assert(offsetof(USmasherVimBlueprint_C, RotationRate) == 0x001758, "Member 'USmasherVimBlueprint_C::RotationRate' has a wrong offset!");
static_assert(offsetof(USmasherVimBlueprint_C, Charging) == 0x00175C, "Member 'USmasherVimBlueprint_C::Charging' has a wrong offset!");
static_assert(offsetof(USmasherVimBlueprint_C, ShouldRun) == 0x00175D, "Member 'USmasherVimBlueprint_C::ShouldRun' has a wrong offset!");
static_assert(offsetof(USmasherVimBlueprint_C, bPlayAdditiveCringe) == 0x00175E, "Member 'USmasherVimBlueprint_C::bPlayAdditiveCringe' has a wrong offset!");
static_assert(offsetof(USmasherVimBlueprint_C, whichCringe) == 0x001760, "Member 'USmasherVimBlueprint_C::whichCringe' has a wrong offset!");
static_assert(offsetof(USmasherVimBlueprint_C, BossSmasher) == 0x001764, "Member 'USmasherVimBlueprint_C::BossSmasher' has a wrong offset!");
static_assert(offsetof(USmasherVimBlueprint_C, FortAIPawnOwner) == 0x001768, "Member 'USmasherVimBlueprint_C::FortAIPawnOwner' has a wrong offset!");

}

#pragma pack(pop)
