#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SmasherPawn_BossRampage

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "SmasherPawn_classes.hpp"
#include "FortniteGame_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass SmasherPawn_BossRampage.SmasherPawn_BossRampage_C
// 0x0050 (0x10C0 - 0x1070)
class ASmasherPawn_BossRampage_C final : public ASmasherPawn_C
{
public:
	uint8                                         Pad_1069[0x3];                                     // 0x1069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_SmasherPawn_BossRampage_C;          // 0x106C(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SM_SpikeBall;                                      // 0x1070(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UParticleSystemComponent*               PowerEffect;                                       // 0x1074(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class USphereComponent*                       RadialMeleeRadius;                                 // 0x1078(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UParticleSystemComponent*               EyeR;                                              // 0x107C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UParticleSystemComponent*               EyeL;                                              // 0x1080(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class AActor*                                 Goal;                                              // 0x1084(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	int32                                         CurrentWave;                                       // 0x1088(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  TiredTag;                                          // 0x108C(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class AActor*>                         OverlappingEnemies;                                // 0x10A4(0x000C)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance)
	bool                                          ReachedGoal;                                       // 0x10B0(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	uint8                                         Pad_10B1[0x3];                                     // 0x10B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         StrengthLevel;                                     // 0x10B4(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	class UMaterialInstanceDynamic*               SpikeMaterial;                                     // 0x10B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          NoPowerup;                                         // 0x10BC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_SmasherPawn_BossRampage(int32 EntryPoint);
	void ForceRoarAbility();
	void OnDeathPlayEffects(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void PowerUpFX(const struct FVector& Power_location);
	void SpecialMoveImpact();
	void BndEvt__RadialMeleeRadius_K2Node_ComponentBoundEvent_212_ComponentEndOverlapSignature__DelegateSignature(class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void BndEvt__RadialMeleeRadius_K2Node_ComponentBoundEvent_210_ComponentBeginOverlapSignature__DelegateSignature(class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void RampageRoarComplete(class AActor* RoarTarget);
	void SetBossStats(int32 CurrentWave_0, int32 BossStrength, int32 Boss_speed);
	void WarpOut();
	void OnDamageServer(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AController* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void ReceiveBeginPlay();
	void UserConstructionScript();
	void OnRep_ReachedGoal();
	void OnRep_StrengthLevel();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SmasherPawn_BossRampage_C">();
	}
	static class ASmasherPawn_BossRampage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASmasherPawn_BossRampage_C>();
	}
};
static_assert(alignof(ASmasherPawn_BossRampage_C) == 0x000010, "Wrong alignment on ASmasherPawn_BossRampage_C");
static_assert(sizeof(ASmasherPawn_BossRampage_C) == 0x0010C0, "Wrong size on ASmasherPawn_BossRampage_C");
static_assert(offsetof(ASmasherPawn_BossRampage_C, UberGraphFrame_SmasherPawn_BossRampage_C) == 0x00106C, "Member 'ASmasherPawn_BossRampage_C::UberGraphFrame_SmasherPawn_BossRampage_C' has a wrong offset!");
static_assert(offsetof(ASmasherPawn_BossRampage_C, SM_SpikeBall) == 0x001070, "Member 'ASmasherPawn_BossRampage_C::SM_SpikeBall' has a wrong offset!");
static_assert(offsetof(ASmasherPawn_BossRampage_C, PowerEffect) == 0x001074, "Member 'ASmasherPawn_BossRampage_C::PowerEffect' has a wrong offset!");
static_assert(offsetof(ASmasherPawn_BossRampage_C, RadialMeleeRadius) == 0x001078, "Member 'ASmasherPawn_BossRampage_C::RadialMeleeRadius' has a wrong offset!");
static_assert(offsetof(ASmasherPawn_BossRampage_C, EyeR) == 0x00107C, "Member 'ASmasherPawn_BossRampage_C::EyeR' has a wrong offset!");
static_assert(offsetof(ASmasherPawn_BossRampage_C, EyeL) == 0x001080, "Member 'ASmasherPawn_BossRampage_C::EyeL' has a wrong offset!");
static_assert(offsetof(ASmasherPawn_BossRampage_C, Goal) == 0x001084, "Member 'ASmasherPawn_BossRampage_C::Goal' has a wrong offset!");
static_assert(offsetof(ASmasherPawn_BossRampage_C, CurrentWave) == 0x001088, "Member 'ASmasherPawn_BossRampage_C::CurrentWave' has a wrong offset!");
static_assert(offsetof(ASmasherPawn_BossRampage_C, TiredTag) == 0x00108C, "Member 'ASmasherPawn_BossRampage_C::TiredTag' has a wrong offset!");
static_assert(offsetof(ASmasherPawn_BossRampage_C, OverlappingEnemies) == 0x0010A4, "Member 'ASmasherPawn_BossRampage_C::OverlappingEnemies' has a wrong offset!");
static_assert(offsetof(ASmasherPawn_BossRampage_C, ReachedGoal) == 0x0010B0, "Member 'ASmasherPawn_BossRampage_C::ReachedGoal' has a wrong offset!");
static_assert(offsetof(ASmasherPawn_BossRampage_C, StrengthLevel) == 0x0010B4, "Member 'ASmasherPawn_BossRampage_C::StrengthLevel' has a wrong offset!");
static_assert(offsetof(ASmasherPawn_BossRampage_C, SpikeMaterial) == 0x0010B8, "Member 'ASmasherPawn_BossRampage_C::SpikeMaterial' has a wrong offset!");
static_assert(offsetof(ASmasherPawn_BossRampage_C, NoPowerup) == 0x0010BC, "Member 'ASmasherPawn_BossRampage_C::NoPowerup' has a wrong offset!");

}

#pragma pack(pop)
