#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SpawnBase_01

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass SpawnBase_01.SpawnBase_01_C
// 0x000C (0x056C - 0x0560)
class ASpawnBase_01_C final : public AStrategicBuildingActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0560(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0564(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UMaterialInstanceDynamic*               TeamColorDynamic;                                  // 0x0568(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_SpawnBase_01(int32 EntryPoint);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SpawnBase_01_C">();
	}
	static class ASpawnBase_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASpawnBase_01_C>();
	}
};
static_assert(alignof(ASpawnBase_01_C) == 0x000004, "Wrong alignment on ASpawnBase_01_C");
static_assert(sizeof(ASpawnBase_01_C) == 0x00056C, "Wrong size on ASpawnBase_01_C");
static_assert(offsetof(ASpawnBase_01_C, UberGraphFrame) == 0x000560, "Member 'ASpawnBase_01_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ASpawnBase_01_C, StaticMesh) == 0x000564, "Member 'ASpawnBase_01_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ASpawnBase_01_C, TeamColorDynamic) == 0x000568, "Member 'ASpawnBase_01_C::TeamColorDynamic' has a wrong offset!");

}

#pragma pack(pop)
