#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SpawnBase_01

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function SpawnBase_01.SpawnBase_01_C.ExecuteUbergraph_SpawnBase_01
// 0x0018 (0x0018 - 0x0000)
struct SpawnBase_01_C_ExecuteUbergraph_SpawnBase_01 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<class AFortPlayerController*>          CallFunc_GetLocalFortPlayerControllers_ReturnValue; // 0x0004(0x000C)(ZeroConstructor, ReferenceParm)
	class AFortPlayerController*                  CallFunc_Array_Get_Item;                           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortTeamAffiliation                          CallFunc_GetTeamAffiliation_ReturnValue;           // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SpawnBase_01_C_ExecuteUbergraph_SpawnBase_01) == 0x000004, "Wrong alignment on SpawnBase_01_C_ExecuteUbergraph_SpawnBase_01");
static_assert(sizeof(SpawnBase_01_C_ExecuteUbergraph_SpawnBase_01) == 0x000018, "Wrong size on SpawnBase_01_C_ExecuteUbergraph_SpawnBase_01");
static_assert(offsetof(SpawnBase_01_C_ExecuteUbergraph_SpawnBase_01, EntryPoint) == 0x000000, "Member 'SpawnBase_01_C_ExecuteUbergraph_SpawnBase_01::EntryPoint' has a wrong offset!");
static_assert(offsetof(SpawnBase_01_C_ExecuteUbergraph_SpawnBase_01, CallFunc_GetLocalFortPlayerControllers_ReturnValue) == 0x000004, "Member 'SpawnBase_01_C_ExecuteUbergraph_SpawnBase_01::CallFunc_GetLocalFortPlayerControllers_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpawnBase_01_C_ExecuteUbergraph_SpawnBase_01, CallFunc_Array_Get_Item) == 0x000010, "Member 'SpawnBase_01_C_ExecuteUbergraph_SpawnBase_01::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SpawnBase_01_C_ExecuteUbergraph_SpawnBase_01, CallFunc_GetTeamAffiliation_ReturnValue) == 0x000014, "Member 'SpawnBase_01_C_ExecuteUbergraph_SpawnBase_01::CallFunc_GetTeamAffiliation_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpawnBase_01_C_ExecuteUbergraph_SpawnBase_01, K2Node_SwitchEnum_CmpSuccess) == 0x000015, "Member 'SpawnBase_01_C_ExecuteUbergraph_SpawnBase_01::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function SpawnBase_01.SpawnBase_01_C.UserConstructionScript
// 0x0004 (0x0004 - 0x0000)
struct SpawnBase_01_C_UserConstructionScript final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SpawnBase_01_C_UserConstructionScript) == 0x000004, "Wrong alignment on SpawnBase_01_C_UserConstructionScript");
static_assert(sizeof(SpawnBase_01_C_UserConstructionScript) == 0x000004, "Wrong size on SpawnBase_01_C_UserConstructionScript");
static_assert(offsetof(SpawnBase_01_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000000, "Member 'SpawnBase_01_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

}

#pragma pack(pop)
