#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ThreatManager

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ThreatCloudSpawns_structs.hpp"
#include "FortniteGame_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass ThreatManager.ThreatManager_C
// 0x003C (0x0338 - 0x02FC)
class AThreatManager_C final : public AFortThreatVisualsManager
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02FC(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0300(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UFortSpline*                            Spline;                                            // 0x0304(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	TArray<class AActor*>                         Currently_available_correct_clouds;                // 0x0308(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<struct FThreatCloudSpawns>             Clouds_to_spawn;                                   // 0x0314(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class FString                                 NewVar1;                                           // 0x0320(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FThreatCloudSpawns>             NewVar;                                            // 0x032C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)

public:
	void ExecuteUbergraph_ThreatManager(int32 EntryPoint);
	void OnBeginThreatVisualsPrecursor(class AActor* SourceActor, const struct FVector& EndLocation);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ThreatManager_C">();
	}
	static class AThreatManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AThreatManager_C>();
	}
};
static_assert(alignof(AThreatManager_C) == 0x000004, "Wrong alignment on AThreatManager_C");
static_assert(sizeof(AThreatManager_C) == 0x000338, "Wrong size on AThreatManager_C");
static_assert(offsetof(AThreatManager_C, UberGraphFrame) == 0x0002FC, "Member 'AThreatManager_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AThreatManager_C, DefaultSceneRoot) == 0x000300, "Member 'AThreatManager_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AThreatManager_C, Spline) == 0x000304, "Member 'AThreatManager_C::Spline' has a wrong offset!");
static_assert(offsetof(AThreatManager_C, Currently_available_correct_clouds) == 0x000308, "Member 'AThreatManager_C::Currently_available_correct_clouds' has a wrong offset!");
static_assert(offsetof(AThreatManager_C, Clouds_to_spawn) == 0x000314, "Member 'AThreatManager_C::Clouds_to_spawn' has a wrong offset!");
static_assert(offsetof(AThreatManager_C, NewVar1) == 0x000320, "Member 'AThreatManager_C::NewVar1' has a wrong offset!");
static_assert(offsetof(AThreatManager_C, NewVar) == 0x00032C, "Member 'AThreatManager_C::NewVar' has a wrong offset!");

}

#pragma pack(pop)
