#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Tracer_Shotgun

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function Tracer_Shotgun.Tracer_Shotgun_C.ExecuteUbergraph_Tracer_Shotgun
// 0x0004 (0x0004 - 0x0000)
struct Tracer_Shotgun_C_ExecuteUbergraph_Tracer_Shotgun final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Tracer_Shotgun_C_ExecuteUbergraph_Tracer_Shotgun) == 0x000004, "Wrong alignment on Tracer_Shotgun_C_ExecuteUbergraph_Tracer_Shotgun");
static_assert(sizeof(Tracer_Shotgun_C_ExecuteUbergraph_Tracer_Shotgun) == 0x000004, "Wrong size on Tracer_Shotgun_C_ExecuteUbergraph_Tracer_Shotgun");
static_assert(offsetof(Tracer_Shotgun_C_ExecuteUbergraph_Tracer_Shotgun, EntryPoint) == 0x000000, "Member 'Tracer_Shotgun_C_ExecuteUbergraph_Tracer_Shotgun::EntryPoint' has a wrong offset!");

// Function Tracer_Shotgun.Tracer_Shotgun_C.UserConstructionScript
// 0x0094 (0x0094 - 0x0000)
struct Tracer_Shotgun_C_UserConstructionScript final
{
public:
	float                                         CallFunc_RandomFloat_ReturnValue;                  // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0014(0x0080)(ContainsInstancedReference)
};
static_assert(alignof(Tracer_Shotgun_C_UserConstructionScript) == 0x000004, "Wrong alignment on Tracer_Shotgun_C_UserConstructionScript");
static_assert(sizeof(Tracer_Shotgun_C_UserConstructionScript) == 0x000094, "Wrong size on Tracer_Shotgun_C_UserConstructionScript");
static_assert(offsetof(Tracer_Shotgun_C_UserConstructionScript, CallFunc_RandomFloat_ReturnValue) == 0x000000, "Member 'Tracer_Shotgun_C_UserConstructionScript::CallFunc_RandomFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tracer_Shotgun_C_UserConstructionScript, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000004, "Member 'Tracer_Shotgun_C_UserConstructionScript::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tracer_Shotgun_C_UserConstructionScript, CallFunc_MakeRotator_ReturnValue) == 0x000008, "Member 'Tracer_Shotgun_C_UserConstructionScript::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tracer_Shotgun_C_UserConstructionScript, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000014, "Member 'Tracer_Shotgun_C_UserConstructionScript::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");

}

#pragma pack(pop)
