#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Trap_Floor_Wires_JT

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass Trap_Floor_Wires_JT.Trap_Floor_Wires_JT_C
// 0x0160 (0x0B50 - 0x09F0)
class ATrap_Floor_Wires_JT_C final : public ABuildingTrapFloor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x09F0(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               NotConnectedParticleSystem;                        // 0x09F4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   Hub;                                               // 0x09F8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   Four_Connection_Wire;                              // 0x09FC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   Three_Connection_Wire;                             // 0x0A00(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   Two_Connection_WIre_Corner;                        // 0x0A04(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   Two_Connection_Wire;                               // 0x0A08(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UBoxComponent*                          Collision;                                         // 0x0A0C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class USceneComponent*                        NodeOriginMarker;                                  // 0x0A10(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UParticleSystemComponent*               ConnectedParticleSystem;                           // 0x0A14(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class USceneComponent*                        Root;                                              // 0x0A18(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	float                                         SpikeUP;                                           // 0x0A1C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         Glow_Amount;                                       // 0x0A20(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UMaterialInstanceDynamic*               Cool_Down_Material;                                // 0x0A24(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class USoundCue*                              Place_Trap_Sound;                                  // 0x0A28(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class USoundCue*                              Trap_Active_Sound;                                 // 0x0A2C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class USoundCue*                              Trap_Fire_Sound;                                   // 0x0A30(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class USoundCue*                              Reload_Sound;                                      // 0x0A34(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class USoundCue*                              Trap_Explode_Sound;                                // 0x0A38(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          NodeisActive;                                      // 0x0A3C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A3D[0x3];                                      // 0x0A3D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABuildingSMActor*>               OutputNodes;                                       // 0x0A40(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance)
	struct FVector                                NodeOrigin;                                        // 0x0A4C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	TArray<class ABuildingSMActor*>               InputNodes;                                        // 0x0A58(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance)
	int32                                         CurrentMagnitude;                                  // 0x0A64(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	int32                                         SeperationFromSource;                              // 0x0A68(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	int32                                         OldTotalNumberOfOutputNodes;                       // 0x0A6C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	int32                                         OldTotalNumberOfInputNodes;                        // 0x0A70(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bNodeArraysHaveChanged;                            // 0x0A74(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ActiveCurrent_UC;                                  // 0x0A75(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A76[0x2];                                      // 0x0A76(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CurrentMagintude_UC;                               // 0x0A78(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class ABuildingSMActor*                       InstigatorNode_UC;                                 // 0x0A7C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	int32                                         InstigatorSeperationFromSource_UC;                 // 0x0A80(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class AActor*                                 TempActor;                                         // 0x0A84(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class ABuildingSMActor*                       Instigator_DN;                                     // 0x0A88(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	int32                                         LowestNewSeperationFromSource_USFS;                // 0x0A8C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	TArray<class ABuildingSMActor*>               NeigboringNodes;                                   // 0x0A90(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance)
	int32                                         LowestSeperationFromSource_FUNC;                   // 0x0A9C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class ABuildingSMActor*                       TempBuildingSM;                                    // 0x0AA0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class ABuildingSMActor*                       DestroyedNode_UDN;                                 // 0x0AA4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class ABuildingSMActor*                       Temp;                                              // 0x0AA8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	TArray<class ABuildingSMActor*>               AdjacentNodes;                                     // 0x0AAC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance)
	class ABuildingSMActor*                       ConnectionNorth;                                   // 0x0AB8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class ABuildingSMActor*                       ConnectionEast;                                    // 0x0ABC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class ABuildingSMActor*                       ConnectionSouth;                                   // 0x0AC0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class ABuildingSMActor*                       ConnectionWest;                                    // 0x0AC4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class ABuildingSMActor*                       TempActor_FNN;                                     // 0x0AC8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          NorthConnected;                                    // 0x0ACC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          EastConnected;                                     // 0x0ACD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          SouthConnected;                                    // 0x0ACE(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          WestConnected;                                     // 0x0ACF(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	TArray<class ABuildingSMActor*>               IrregularNodes;                                    // 0x0AD0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance)
	bool                                          bIsIrregularNode_FNN;                              // 0x0ADC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ADD[0x3];                                      // 0x0ADD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingSMActor*                       TempActor_CTIN;                                    // 0x0AE0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                Vector1_CTIN;                                      // 0x0AE4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                Vector2_CTIN;                                      // 0x0AF0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                Vector3_CTIN;                                      // 0x0AFC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                Vector4_CTIN;                                      // 0x0B08(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UStaticMeshComponent*                   StaticMeshComp_North;                              // 0x0B14(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UStaticMeshComponent*                   StaticMeshComp_East;                               // 0x0B18(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UStaticMeshComponent*                   StaricMeshComp_West;                               // 0x0B1C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UStaticMeshComponent*                   StaticMeshComp_South;                              // 0x0B20(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UStaticMeshComponent*                   StaticMeshComp_West;                               // 0x0B24(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UStaticMeshComponent*                   StaticMeshComp_Temp;                               // 0x0B28(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	TArray<EObjectTypeQuery>                      dummy;                                             // 0x0B2C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<int32>                                 Dummy1;                                            // 0x0B38(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<bool>                                  Dummy2;                                            // 0x0B44(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)

public:
	void ExecuteUbergraph_Trap_Floor_Wires_JT(int32 EntryPoint);
	void UpdateDestroyedNode(class ABuildingSMActor* DestroyedNode);
	void UpdateInputOutput();
	void UpdateSeperationFromSource();
	void UpdateIsActive();
	void UpdateNeigboringNodes();
	void OnFinishedBuilding();
	void OnDestroy();
	void CarrierNode_UpdateAll(float UpdateID);
	void UserConstructionScript();
	void CompareNodeArrays(bool* bNodeArrayHaveChanged);
	void FindNeigboringNodes();
	void DetermineIsActive();
	void DetermineSeperationFromSource();
	void UpdateConnectedGraphic();
	void DetermineInputOutput();
	void DetermineWireBranches();
	void ConnectToIrregularNodes();
	void GetSeperationFromSource(int32* SeperationFromSource_0, int32* InputArrayLength, bool* IsActive);
	void GetIsActive(bool* bIsActive, bool* bIsSharingConnection);
	void CarrierNode_GetUpdateID(float* UpdateID);
	void CarrierNode_GetResourceToSeekerOptimalPathSum(TArray<int32>* OptimalPathSum);
	void CarrierNode_GetProximityToSeekers(TArray<int32>* ProximityToSeeker);
	void CarrierNode_GetResourcesSought(TArray<bool>* ResourcesSought);
	void CarrierNode_GetProximityToResources(TArray<int32>* ProximityToResourcesArray);
	void CarrierNode_GetLinkedDirections(bool* bNorthLinked, bool* bEastLinked, bool* bSouthLinked, bool* bWestLinked, bool* bUpLinked, bool* bDownLinked);
	void GetIsCarrierNode(bool* bIsCarrierNode, struct FVector* NodeOrigin_0, bool* bDestroyed_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Trap_Floor_Wires_JT_C">();
	}
	static class ATrap_Floor_Wires_JT_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATrap_Floor_Wires_JT_C>();
	}
};
static_assert(alignof(ATrap_Floor_Wires_JT_C) == 0x000004, "Wrong alignment on ATrap_Floor_Wires_JT_C");
static_assert(sizeof(ATrap_Floor_Wires_JT_C) == 0x000B50, "Wrong size on ATrap_Floor_Wires_JT_C");
static_assert(offsetof(ATrap_Floor_Wires_JT_C, UberGraphFrame) == 0x0009F0, "Member 'ATrap_Floor_Wires_JT_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Wires_JT_C, NotConnectedParticleSystem) == 0x0009F4, "Member 'ATrap_Floor_Wires_JT_C::NotConnectedParticleSystem' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Wires_JT_C, Hub) == 0x0009F8, "Member 'ATrap_Floor_Wires_JT_C::Hub' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Wires_JT_C, Four_Connection_Wire) == 0x0009FC, "Member 'ATrap_Floor_Wires_JT_C::Four_Connection_Wire' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Wires_JT_C, Three_Connection_Wire) == 0x000A00, "Member 'ATrap_Floor_Wires_JT_C::Three_Connection_Wire' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Wires_JT_C, Two_Connection_WIre_Corner) == 0x000A04, "Member 'ATrap_Floor_Wires_JT_C::Two_Connection_WIre_Corner' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Wires_JT_C, Two_Connection_Wire) == 0x000A08, "Member 'ATrap_Floor_Wires_JT_C::Two_Connection_Wire' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Wires_JT_C, Collision) == 0x000A0C, "Member 'ATrap_Floor_Wires_JT_C::Collision' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Wires_JT_C, NodeOriginMarker) == 0x000A10, "Member 'ATrap_Floor_Wires_JT_C::NodeOriginMarker' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Wires_JT_C, ConnectedParticleSystem) == 0x000A14, "Member 'ATrap_Floor_Wires_JT_C::ConnectedParticleSystem' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Wires_JT_C, Root) == 0x000A18, "Member 'ATrap_Floor_Wires_JT_C::Root' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Wires_JT_C, SpikeUP) == 0x000A1C, "Member 'ATrap_Floor_Wires_JT_C::SpikeUP' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Wires_JT_C, Glow_Amount) == 0x000A20, "Member 'ATrap_Floor_Wires_JT_C::Glow_Amount' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Wires_JT_C, Cool_Down_Material) == 0x000A24, "Member 'ATrap_Floor_Wires_JT_C::Cool_Down_Material' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Wires_JT_C, Place_Trap_Sound) == 0x000A28, "Member 'ATrap_Floor_Wires_JT_C::Place_Trap_Sound' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Wires_JT_C, Trap_Active_Sound) == 0x000A2C, "Member 'ATrap_Floor_Wires_JT_C::Trap_Active_Sound' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Wires_JT_C, Trap_Fire_Sound) == 0x000A30, "Member 'ATrap_Floor_Wires_JT_C::Trap_Fire_Sound' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Wires_JT_C, Reload_Sound) == 0x000A34, "Member 'ATrap_Floor_Wires_JT_C::Reload_Sound' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Wires_JT_C, Trap_Explode_Sound) == 0x000A38, "Member 'ATrap_Floor_Wires_JT_C::Trap_Explode_Sound' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Wires_JT_C, NodeisActive) == 0x000A3C, "Member 'ATrap_Floor_Wires_JT_C::NodeisActive' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Wires_JT_C, OutputNodes) == 0x000A40, "Member 'ATrap_Floor_Wires_JT_C::OutputNodes' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Wires_JT_C, NodeOrigin) == 0x000A4C, "Member 'ATrap_Floor_Wires_JT_C::NodeOrigin' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Wires_JT_C, InputNodes) == 0x000A58, "Member 'ATrap_Floor_Wires_JT_C::InputNodes' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Wires_JT_C, CurrentMagnitude) == 0x000A64, "Member 'ATrap_Floor_Wires_JT_C::CurrentMagnitude' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Wires_JT_C, SeperationFromSource) == 0x000A68, "Member 'ATrap_Floor_Wires_JT_C::SeperationFromSource' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Wires_JT_C, OldTotalNumberOfOutputNodes) == 0x000A6C, "Member 'ATrap_Floor_Wires_JT_C::OldTotalNumberOfOutputNodes' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Wires_JT_C, OldTotalNumberOfInputNodes) == 0x000A70, "Member 'ATrap_Floor_Wires_JT_C::OldTotalNumberOfInputNodes' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Wires_JT_C, bNodeArraysHaveChanged) == 0x000A74, "Member 'ATrap_Floor_Wires_JT_C::bNodeArraysHaveChanged' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Wires_JT_C, ActiveCurrent_UC) == 0x000A75, "Member 'ATrap_Floor_Wires_JT_C::ActiveCurrent_UC' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Wires_JT_C, CurrentMagintude_UC) == 0x000A78, "Member 'ATrap_Floor_Wires_JT_C::CurrentMagintude_UC' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Wires_JT_C, InstigatorNode_UC) == 0x000A7C, "Member 'ATrap_Floor_Wires_JT_C::InstigatorNode_UC' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Wires_JT_C, InstigatorSeperationFromSource_UC) == 0x000A80, "Member 'ATrap_Floor_Wires_JT_C::InstigatorSeperationFromSource_UC' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Wires_JT_C, TempActor) == 0x000A84, "Member 'ATrap_Floor_Wires_JT_C::TempActor' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Wires_JT_C, Instigator_DN) == 0x000A88, "Member 'ATrap_Floor_Wires_JT_C::Instigator_DN' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Wires_JT_C, LowestNewSeperationFromSource_USFS) == 0x000A8C, "Member 'ATrap_Floor_Wires_JT_C::LowestNewSeperationFromSource_USFS' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Wires_JT_C, NeigboringNodes) == 0x000A90, "Member 'ATrap_Floor_Wires_JT_C::NeigboringNodes' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Wires_JT_C, LowestSeperationFromSource_FUNC) == 0x000A9C, "Member 'ATrap_Floor_Wires_JT_C::LowestSeperationFromSource_FUNC' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Wires_JT_C, TempBuildingSM) == 0x000AA0, "Member 'ATrap_Floor_Wires_JT_C::TempBuildingSM' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Wires_JT_C, DestroyedNode_UDN) == 0x000AA4, "Member 'ATrap_Floor_Wires_JT_C::DestroyedNode_UDN' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Wires_JT_C, Temp) == 0x000AA8, "Member 'ATrap_Floor_Wires_JT_C::Temp' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Wires_JT_C, AdjacentNodes) == 0x000AAC, "Member 'ATrap_Floor_Wires_JT_C::AdjacentNodes' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Wires_JT_C, ConnectionNorth) == 0x000AB8, "Member 'ATrap_Floor_Wires_JT_C::ConnectionNorth' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Wires_JT_C, ConnectionEast) == 0x000ABC, "Member 'ATrap_Floor_Wires_JT_C::ConnectionEast' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Wires_JT_C, ConnectionSouth) == 0x000AC0, "Member 'ATrap_Floor_Wires_JT_C::ConnectionSouth' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Wires_JT_C, ConnectionWest) == 0x000AC4, "Member 'ATrap_Floor_Wires_JT_C::ConnectionWest' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Wires_JT_C, TempActor_FNN) == 0x000AC8, "Member 'ATrap_Floor_Wires_JT_C::TempActor_FNN' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Wires_JT_C, NorthConnected) == 0x000ACC, "Member 'ATrap_Floor_Wires_JT_C::NorthConnected' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Wires_JT_C, EastConnected) == 0x000ACD, "Member 'ATrap_Floor_Wires_JT_C::EastConnected' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Wires_JT_C, SouthConnected) == 0x000ACE, "Member 'ATrap_Floor_Wires_JT_C::SouthConnected' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Wires_JT_C, WestConnected) == 0x000ACF, "Member 'ATrap_Floor_Wires_JT_C::WestConnected' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Wires_JT_C, IrregularNodes) == 0x000AD0, "Member 'ATrap_Floor_Wires_JT_C::IrregularNodes' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Wires_JT_C, bIsIrregularNode_FNN) == 0x000ADC, "Member 'ATrap_Floor_Wires_JT_C::bIsIrregularNode_FNN' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Wires_JT_C, TempActor_CTIN) == 0x000AE0, "Member 'ATrap_Floor_Wires_JT_C::TempActor_CTIN' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Wires_JT_C, Vector1_CTIN) == 0x000AE4, "Member 'ATrap_Floor_Wires_JT_C::Vector1_CTIN' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Wires_JT_C, Vector2_CTIN) == 0x000AF0, "Member 'ATrap_Floor_Wires_JT_C::Vector2_CTIN' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Wires_JT_C, Vector3_CTIN) == 0x000AFC, "Member 'ATrap_Floor_Wires_JT_C::Vector3_CTIN' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Wires_JT_C, Vector4_CTIN) == 0x000B08, "Member 'ATrap_Floor_Wires_JT_C::Vector4_CTIN' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Wires_JT_C, StaticMeshComp_North) == 0x000B14, "Member 'ATrap_Floor_Wires_JT_C::StaticMeshComp_North' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Wires_JT_C, StaticMeshComp_East) == 0x000B18, "Member 'ATrap_Floor_Wires_JT_C::StaticMeshComp_East' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Wires_JT_C, StaricMeshComp_West) == 0x000B1C, "Member 'ATrap_Floor_Wires_JT_C::StaricMeshComp_West' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Wires_JT_C, StaticMeshComp_South) == 0x000B20, "Member 'ATrap_Floor_Wires_JT_C::StaticMeshComp_South' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Wires_JT_C, StaticMeshComp_West) == 0x000B24, "Member 'ATrap_Floor_Wires_JT_C::StaticMeshComp_West' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Wires_JT_C, StaticMeshComp_Temp) == 0x000B28, "Member 'ATrap_Floor_Wires_JT_C::StaticMeshComp_Temp' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Wires_JT_C, dummy) == 0x000B2C, "Member 'ATrap_Floor_Wires_JT_C::dummy' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Wires_JT_C, Dummy1) == 0x000B38, "Member 'ATrap_Floor_Wires_JT_C::Dummy1' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Wires_JT_C, Dummy2) == 0x000B44, "Member 'ATrap_Floor_Wires_JT_C::Dummy2' has a wrong offset!");

}

#pragma pack(pop)
