#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Trap_Floor_Spikes_Tigger

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function Trap_Floor_Spikes_Tigger.Trap_Floor_Spikes_Tigger_C.ExecuteUbergraph_Trap_Floor_Spikes_Tigger
// 0x0110 (0x0110 - 0x0000)
struct Trap_Floor_Spikes_Tigger_C_ExecuteUbergraph_Trap_Floor_Spikes_Tigger final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetTimelineLength_ReturnValue;            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetReloadTime_ReturnValue;                // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue2;         // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue3;         // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue4;         // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue5;         // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetCenter_ReturnValue;                    // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue6;         // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue2;      // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EGameplayCueEvent                             K2Node_GameplayCueEvent_EventType;                 // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 K2Node_GameplayCueEvent_Parameters;                // 0x0088(0x0084)()
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Trap_Floor_Spikes_Tigger_C_ExecuteUbergraph_Trap_Floor_Spikes_Tigger) == 0x000004, "Wrong alignment on Trap_Floor_Spikes_Tigger_C_ExecuteUbergraph_Trap_Floor_Spikes_Tigger");
static_assert(sizeof(Trap_Floor_Spikes_Tigger_C_ExecuteUbergraph_Trap_Floor_Spikes_Tigger) == 0x000110, "Wrong size on Trap_Floor_Spikes_Tigger_C_ExecuteUbergraph_Trap_Floor_Spikes_Tigger");
static_assert(offsetof(Trap_Floor_Spikes_Tigger_C_ExecuteUbergraph_Trap_Floor_Spikes_Tigger, EntryPoint) == 0x000000, "Member 'Trap_Floor_Spikes_Tigger_C_ExecuteUbergraph_Trap_Floor_Spikes_Tigger::EntryPoint' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Spikes_Tigger_C_ExecuteUbergraph_Trap_Floor_Spikes_Tigger, CallFunc_GetTimelineLength_ReturnValue) == 0x000004, "Member 'Trap_Floor_Spikes_Tigger_C_ExecuteUbergraph_Trap_Floor_Spikes_Tigger::CallFunc_GetTimelineLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Spikes_Tigger_C_ExecuteUbergraph_Trap_Floor_Spikes_Tigger, Temp_bool_IsClosed_Variable) == 0x000008, "Member 'Trap_Floor_Spikes_Tigger_C_ExecuteUbergraph_Trap_Floor_Spikes_Tigger::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Spikes_Tigger_C_ExecuteUbergraph_Trap_Floor_Spikes_Tigger, Temp_bool_Has_Been_Initd_Variable) == 0x000009, "Member 'Trap_Floor_Spikes_Tigger_C_ExecuteUbergraph_Trap_Floor_Spikes_Tigger::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Spikes_Tigger_C_ExecuteUbergraph_Trap_Floor_Spikes_Tigger, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00000C, "Member 'Trap_Floor_Spikes_Tigger_C_ExecuteUbergraph_Trap_Floor_Spikes_Tigger::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Spikes_Tigger_C_ExecuteUbergraph_Trap_Floor_Spikes_Tigger, CallFunc_GetReloadTime_ReturnValue) == 0x000018, "Member 'Trap_Floor_Spikes_Tigger_C_ExecuteUbergraph_Trap_Floor_Spikes_Tigger::CallFunc_GetReloadTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Spikes_Tigger_C_ExecuteUbergraph_Trap_Floor_Spikes_Tigger, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00001C, "Member 'Trap_Floor_Spikes_Tigger_C_ExecuteUbergraph_Trap_Floor_Spikes_Tigger::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Spikes_Tigger_C_ExecuteUbergraph_Trap_Floor_Spikes_Tigger, CallFunc_K2_GetActorLocation_ReturnValue2) == 0x000020, "Member 'Trap_Floor_Spikes_Tigger_C_ExecuteUbergraph_Trap_Floor_Spikes_Tigger::CallFunc_K2_GetActorLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Spikes_Tigger_C_ExecuteUbergraph_Trap_Floor_Spikes_Tigger, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00002C, "Member 'Trap_Floor_Spikes_Tigger_C_ExecuteUbergraph_Trap_Floor_Spikes_Tigger::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Spikes_Tigger_C_ExecuteUbergraph_Trap_Floor_Spikes_Tigger, CallFunc_K2_GetActorLocation_ReturnValue3) == 0x000030, "Member 'Trap_Floor_Spikes_Tigger_C_ExecuteUbergraph_Trap_Floor_Spikes_Tigger::CallFunc_K2_GetActorLocation_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Spikes_Tigger_C_ExecuteUbergraph_Trap_Floor_Spikes_Tigger, CallFunc_K2_GetActorLocation_ReturnValue4) == 0x00003C, "Member 'Trap_Floor_Spikes_Tigger_C_ExecuteUbergraph_Trap_Floor_Spikes_Tigger::CallFunc_K2_GetActorLocation_ReturnValue4' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Spikes_Tigger_C_ExecuteUbergraph_Trap_Floor_Spikes_Tigger, CallFunc_K2_GetActorLocation_ReturnValue5) == 0x000048, "Member 'Trap_Floor_Spikes_Tigger_C_ExecuteUbergraph_Trap_Floor_Spikes_Tigger::CallFunc_K2_GetActorLocation_ReturnValue5' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Spikes_Tigger_C_ExecuteUbergraph_Trap_Floor_Spikes_Tigger, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000054, "Member 'Trap_Floor_Spikes_Tigger_C_ExecuteUbergraph_Trap_Floor_Spikes_Tigger::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Spikes_Tigger_C_ExecuteUbergraph_Trap_Floor_Spikes_Tigger, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000058, "Member 'Trap_Floor_Spikes_Tigger_C_ExecuteUbergraph_Trap_Floor_Spikes_Tigger::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Spikes_Tigger_C_ExecuteUbergraph_Trap_Floor_Spikes_Tigger, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000064, "Member 'Trap_Floor_Spikes_Tigger_C_ExecuteUbergraph_Trap_Floor_Spikes_Tigger::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Spikes_Tigger_C_ExecuteUbergraph_Trap_Floor_Spikes_Tigger, CallFunc_GetCenter_ReturnValue) == 0x000068, "Member 'Trap_Floor_Spikes_Tigger_C_ExecuteUbergraph_Trap_Floor_Spikes_Tigger::CallFunc_GetCenter_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Spikes_Tigger_C_ExecuteUbergraph_Trap_Floor_Spikes_Tigger, CallFunc_K2_GetActorLocation_ReturnValue6) == 0x000074, "Member 'Trap_Floor_Spikes_Tigger_C_ExecuteUbergraph_Trap_Floor_Spikes_Tigger::CallFunc_K2_GetActorLocation_ReturnValue6' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Spikes_Tigger_C_ExecuteUbergraph_Trap_Floor_Spikes_Tigger, CallFunc_SpawnEmitterAtLocation_ReturnValue2) == 0x000080, "Member 'Trap_Floor_Spikes_Tigger_C_ExecuteUbergraph_Trap_Floor_Spikes_Tigger::CallFunc_SpawnEmitterAtLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Spikes_Tigger_C_ExecuteUbergraph_Trap_Floor_Spikes_Tigger, K2Node_GameplayCueEvent_EventType) == 0x000084, "Member 'Trap_Floor_Spikes_Tigger_C_ExecuteUbergraph_Trap_Floor_Spikes_Tigger::K2Node_GameplayCueEvent_EventType' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Spikes_Tigger_C_ExecuteUbergraph_Trap_Floor_Spikes_Tigger, K2Node_GameplayCueEvent_Parameters) == 0x000088, "Member 'Trap_Floor_Spikes_Tigger_C_ExecuteUbergraph_Trap_Floor_Spikes_Tigger::K2Node_GameplayCueEvent_Parameters' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Spikes_Tigger_C_ExecuteUbergraph_Trap_Floor_Spikes_Tigger, K2Node_SwitchEnum_CmpSuccess) == 0x00010C, "Member 'Trap_Floor_Spikes_Tigger_C_ExecuteUbergraph_Trap_Floor_Spikes_Tigger::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function Trap_Floor_Spikes_Tigger.Trap_Floor_Spikes_Tigger_C.GameplayCue.Abilities.Activation.Traps.ActivateTrap
// 0x0088 (0x0088 - 0x0000)
struct Trap_Floor_Spikes_Tigger_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap final
{
public:
	EGameplayCueEvent                             EventType;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 Parameters;                                        // 0x0004(0x0084)(Parm)
};
static_assert(alignof(Trap_Floor_Spikes_Tigger_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap) == 0x000004, "Wrong alignment on Trap_Floor_Spikes_Tigger_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap");
static_assert(sizeof(Trap_Floor_Spikes_Tigger_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap) == 0x000088, "Wrong size on Trap_Floor_Spikes_Tigger_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap");
static_assert(offsetof(Trap_Floor_Spikes_Tigger_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap, EventType) == 0x000000, "Member 'Trap_Floor_Spikes_Tigger_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap::EventType' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Spikes_Tigger_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap, Parameters) == 0x000004, "Member 'Trap_Floor_Spikes_Tigger_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap::Parameters' has a wrong offset!");

// Function Trap_Floor_Spikes_Tigger.Trap_Floor_Spikes_Tigger_C.SetSpikePosition
// 0x0010 (0x0010 - 0x0000)
struct Trap_Floor_Spikes_Tigger_C_SetSpikePosition final
{
public:
	float                                         NewSpikePosition;                                  // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Trap_Floor_Spikes_Tigger_C_SetSpikePosition) == 0x000004, "Wrong alignment on Trap_Floor_Spikes_Tigger_C_SetSpikePosition");
static_assert(sizeof(Trap_Floor_Spikes_Tigger_C_SetSpikePosition) == 0x000010, "Wrong size on Trap_Floor_Spikes_Tigger_C_SetSpikePosition");
static_assert(offsetof(Trap_Floor_Spikes_Tigger_C_SetSpikePosition, NewSpikePosition) == 0x000000, "Member 'Trap_Floor_Spikes_Tigger_C_SetSpikePosition::NewSpikePosition' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Spikes_Tigger_C_SetSpikePosition, CallFunc_MakeVector_ReturnValue) == 0x000004, "Member 'Trap_Floor_Spikes_Tigger_C_SetSpikePosition::CallFunc_MakeVector_ReturnValue' has a wrong offset!");

}

#pragma pack(pop)
