#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Trap_Wall_Launcher

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function Trap_Wall_Launcher.Trap_Wall_Launcher_C.ExecuteUbergraph_Trap_Wall_Launcher
// 0x00FC (0x00FC - 0x0000)
struct Trap_Wall_Launcher_C_ExecuteUbergraph_Trap_Wall_Launcher final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue2;         // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue3;         // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue4;         // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue5;         // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetCenter_ReturnValue;                    // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue6;         // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue2;      // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EGameplayCueEvent                             K2Node_GameplayCueEvent_EventType;                 // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 K2Node_GameplayCueEvent_Parameters;                // 0x0074(0x0084)()
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Trap_Wall_Launcher_C_ExecuteUbergraph_Trap_Wall_Launcher) == 0x000004, "Wrong alignment on Trap_Wall_Launcher_C_ExecuteUbergraph_Trap_Wall_Launcher");
static_assert(sizeof(Trap_Wall_Launcher_C_ExecuteUbergraph_Trap_Wall_Launcher) == 0x0000FC, "Wrong size on Trap_Wall_Launcher_C_ExecuteUbergraph_Trap_Wall_Launcher");
static_assert(offsetof(Trap_Wall_Launcher_C_ExecuteUbergraph_Trap_Wall_Launcher, EntryPoint) == 0x000000, "Member 'Trap_Wall_Launcher_C_ExecuteUbergraph_Trap_Wall_Launcher::EntryPoint' has a wrong offset!");
static_assert(offsetof(Trap_Wall_Launcher_C_ExecuteUbergraph_Trap_Wall_Launcher, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000004, "Member 'Trap_Wall_Launcher_C_ExecuteUbergraph_Trap_Wall_Launcher::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Wall_Launcher_C_ExecuteUbergraph_Trap_Wall_Launcher, CallFunc_K2_GetActorLocation_ReturnValue2) == 0x000010, "Member 'Trap_Wall_Launcher_C_ExecuteUbergraph_Trap_Wall_Launcher::CallFunc_K2_GetActorLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Trap_Wall_Launcher_C_ExecuteUbergraph_Trap_Wall_Launcher, CallFunc_K2_GetActorLocation_ReturnValue3) == 0x00001C, "Member 'Trap_Wall_Launcher_C_ExecuteUbergraph_Trap_Wall_Launcher::CallFunc_K2_GetActorLocation_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Trap_Wall_Launcher_C_ExecuteUbergraph_Trap_Wall_Launcher, CallFunc_K2_GetActorLocation_ReturnValue4) == 0x000028, "Member 'Trap_Wall_Launcher_C_ExecuteUbergraph_Trap_Wall_Launcher::CallFunc_K2_GetActorLocation_ReturnValue4' has a wrong offset!");
static_assert(offsetof(Trap_Wall_Launcher_C_ExecuteUbergraph_Trap_Wall_Launcher, CallFunc_K2_GetActorLocation_ReturnValue5) == 0x000034, "Member 'Trap_Wall_Launcher_C_ExecuteUbergraph_Trap_Wall_Launcher::CallFunc_K2_GetActorLocation_ReturnValue5' has a wrong offset!");
static_assert(offsetof(Trap_Wall_Launcher_C_ExecuteUbergraph_Trap_Wall_Launcher, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000040, "Member 'Trap_Wall_Launcher_C_ExecuteUbergraph_Trap_Wall_Launcher::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Wall_Launcher_C_ExecuteUbergraph_Trap_Wall_Launcher, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000044, "Member 'Trap_Wall_Launcher_C_ExecuteUbergraph_Trap_Wall_Launcher::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Wall_Launcher_C_ExecuteUbergraph_Trap_Wall_Launcher, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000050, "Member 'Trap_Wall_Launcher_C_ExecuteUbergraph_Trap_Wall_Launcher::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Wall_Launcher_C_ExecuteUbergraph_Trap_Wall_Launcher, CallFunc_GetCenter_ReturnValue) == 0x000054, "Member 'Trap_Wall_Launcher_C_ExecuteUbergraph_Trap_Wall_Launcher::CallFunc_GetCenter_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Wall_Launcher_C_ExecuteUbergraph_Trap_Wall_Launcher, CallFunc_K2_GetActorLocation_ReturnValue6) == 0x000060, "Member 'Trap_Wall_Launcher_C_ExecuteUbergraph_Trap_Wall_Launcher::CallFunc_K2_GetActorLocation_ReturnValue6' has a wrong offset!");
static_assert(offsetof(Trap_Wall_Launcher_C_ExecuteUbergraph_Trap_Wall_Launcher, CallFunc_SpawnEmitterAtLocation_ReturnValue2) == 0x00006C, "Member 'Trap_Wall_Launcher_C_ExecuteUbergraph_Trap_Wall_Launcher::CallFunc_SpawnEmitterAtLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Trap_Wall_Launcher_C_ExecuteUbergraph_Trap_Wall_Launcher, K2Node_GameplayCueEvent_EventType) == 0x000070, "Member 'Trap_Wall_Launcher_C_ExecuteUbergraph_Trap_Wall_Launcher::K2Node_GameplayCueEvent_EventType' has a wrong offset!");
static_assert(offsetof(Trap_Wall_Launcher_C_ExecuteUbergraph_Trap_Wall_Launcher, K2Node_GameplayCueEvent_Parameters) == 0x000074, "Member 'Trap_Wall_Launcher_C_ExecuteUbergraph_Trap_Wall_Launcher::K2Node_GameplayCueEvent_Parameters' has a wrong offset!");
static_assert(offsetof(Trap_Wall_Launcher_C_ExecuteUbergraph_Trap_Wall_Launcher, K2Node_SwitchEnum_CmpSuccess) == 0x0000F8, "Member 'Trap_Wall_Launcher_C_ExecuteUbergraph_Trap_Wall_Launcher::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function Trap_Wall_Launcher.Trap_Wall_Launcher_C.GameplayCue.Abilities.Activation.Traps.ActivateTrap
// 0x0088 (0x0088 - 0x0000)
struct Trap_Wall_Launcher_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap final
{
public:
	EGameplayCueEvent                             EventType;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 Parameters;                                        // 0x0004(0x0084)(Parm)
};
static_assert(alignof(Trap_Wall_Launcher_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap) == 0x000004, "Wrong alignment on Trap_Wall_Launcher_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap");
static_assert(sizeof(Trap_Wall_Launcher_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap) == 0x000088, "Wrong size on Trap_Wall_Launcher_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap");
static_assert(offsetof(Trap_Wall_Launcher_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap, EventType) == 0x000000, "Member 'Trap_Wall_Launcher_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap::EventType' has a wrong offset!");
static_assert(offsetof(Trap_Wall_Launcher_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap, Parameters) == 0x000004, "Member 'Trap_Wall_Launcher_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap::Parameters' has a wrong offset!");

// Function Trap_Wall_Launcher.Trap_Wall_Launcher_C.SetFloorPosition
// 0x0004 (0x0004 - 0x0000)
struct Trap_Wall_Launcher_C_SetFloorPosition final
{
public:
	float                                         NewFloorPosition;                                  // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Trap_Wall_Launcher_C_SetFloorPosition) == 0x000004, "Wrong alignment on Trap_Wall_Launcher_C_SetFloorPosition");
static_assert(sizeof(Trap_Wall_Launcher_C_SetFloorPosition) == 0x000004, "Wrong size on Trap_Wall_Launcher_C_SetFloorPosition");
static_assert(offsetof(Trap_Wall_Launcher_C_SetFloorPosition, NewFloorPosition) == 0x000000, "Member 'Trap_Wall_Launcher_C_SetFloorPosition::NewFloorPosition' has a wrong offset!");

}

#pragma pack(pop)
