#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Trap_Floor_Stamina

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function Trap_Floor_Stamina.Trap_Floor_Stamina_C.ExecuteUbergraph_Trap_Floor_Stamina
// 0x017C (0x017C - 0x0000)
struct Trap_Floor_Stamina_C_ExecuteUbergraph_Trap_Floor_Stamina final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue2;         // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue3;         // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue4;         // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue5;         // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue6;         // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EGameplayCueEvent                             K2Node_GameplayCueEvent_EventType2;                // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 K2Node_GameplayCueEvent_Parameters2;               // 0x0064(0x0084)()
	EGameplayCueEvent                             K2Node_GameplayCueEvent_EventType;                 // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 K2Node_GameplayCueEvent_Parameters;                // 0x00EC(0x0084)()
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_172[0x2];                                      // 0x0172(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Trap_Floor_Stamina_C_ExecuteUbergraph_Trap_Floor_Stamina) == 0x000004, "Wrong alignment on Trap_Floor_Stamina_C_ExecuteUbergraph_Trap_Floor_Stamina");
static_assert(sizeof(Trap_Floor_Stamina_C_ExecuteUbergraph_Trap_Floor_Stamina) == 0x00017C, "Wrong size on Trap_Floor_Stamina_C_ExecuteUbergraph_Trap_Floor_Stamina");
static_assert(offsetof(Trap_Floor_Stamina_C_ExecuteUbergraph_Trap_Floor_Stamina, EntryPoint) == 0x000000, "Member 'Trap_Floor_Stamina_C_ExecuteUbergraph_Trap_Floor_Stamina::EntryPoint' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Stamina_C_ExecuteUbergraph_Trap_Floor_Stamina, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000004, "Member 'Trap_Floor_Stamina_C_ExecuteUbergraph_Trap_Floor_Stamina::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Stamina_C_ExecuteUbergraph_Trap_Floor_Stamina, CallFunc_K2_GetActorLocation_ReturnValue2) == 0x000010, "Member 'Trap_Floor_Stamina_C_ExecuteUbergraph_Trap_Floor_Stamina::CallFunc_K2_GetActorLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Stamina_C_ExecuteUbergraph_Trap_Floor_Stamina, CallFunc_K2_GetActorLocation_ReturnValue3) == 0x00001C, "Member 'Trap_Floor_Stamina_C_ExecuteUbergraph_Trap_Floor_Stamina::CallFunc_K2_GetActorLocation_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Stamina_C_ExecuteUbergraph_Trap_Floor_Stamina, CallFunc_K2_GetActorLocation_ReturnValue4) == 0x000028, "Member 'Trap_Floor_Stamina_C_ExecuteUbergraph_Trap_Floor_Stamina::CallFunc_K2_GetActorLocation_ReturnValue4' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Stamina_C_ExecuteUbergraph_Trap_Floor_Stamina, CallFunc_K2_GetActorLocation_ReturnValue5) == 0x000034, "Member 'Trap_Floor_Stamina_C_ExecuteUbergraph_Trap_Floor_Stamina::CallFunc_K2_GetActorLocation_ReturnValue5' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Stamina_C_ExecuteUbergraph_Trap_Floor_Stamina, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000040, "Member 'Trap_Floor_Stamina_C_ExecuteUbergraph_Trap_Floor_Stamina::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Stamina_C_ExecuteUbergraph_Trap_Floor_Stamina, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000044, "Member 'Trap_Floor_Stamina_C_ExecuteUbergraph_Trap_Floor_Stamina::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Stamina_C_ExecuteUbergraph_Trap_Floor_Stamina, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000050, "Member 'Trap_Floor_Stamina_C_ExecuteUbergraph_Trap_Floor_Stamina::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Stamina_C_ExecuteUbergraph_Trap_Floor_Stamina, CallFunc_K2_GetActorLocation_ReturnValue6) == 0x000054, "Member 'Trap_Floor_Stamina_C_ExecuteUbergraph_Trap_Floor_Stamina::CallFunc_K2_GetActorLocation_ReturnValue6' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Stamina_C_ExecuteUbergraph_Trap_Floor_Stamina, K2Node_GameplayCueEvent_EventType2) == 0x000060, "Member 'Trap_Floor_Stamina_C_ExecuteUbergraph_Trap_Floor_Stamina::K2Node_GameplayCueEvent_EventType2' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Stamina_C_ExecuteUbergraph_Trap_Floor_Stamina, K2Node_GameplayCueEvent_Parameters2) == 0x000064, "Member 'Trap_Floor_Stamina_C_ExecuteUbergraph_Trap_Floor_Stamina::K2Node_GameplayCueEvent_Parameters2' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Stamina_C_ExecuteUbergraph_Trap_Floor_Stamina, K2Node_GameplayCueEvent_EventType) == 0x0000E8, "Member 'Trap_Floor_Stamina_C_ExecuteUbergraph_Trap_Floor_Stamina::K2Node_GameplayCueEvent_EventType' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Stamina_C_ExecuteUbergraph_Trap_Floor_Stamina, K2Node_GameplayCueEvent_Parameters) == 0x0000EC, "Member 'Trap_Floor_Stamina_C_ExecuteUbergraph_Trap_Floor_Stamina::K2Node_GameplayCueEvent_Parameters' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Stamina_C_ExecuteUbergraph_Trap_Floor_Stamina, K2Node_SwitchEnum_CmpSuccess) == 0x000170, "Member 'Trap_Floor_Stamina_C_ExecuteUbergraph_Trap_Floor_Stamina::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Stamina_C_ExecuteUbergraph_Trap_Floor_Stamina, K2Node_SwitchEnum2_CmpSuccess) == 0x000171, "Member 'Trap_Floor_Stamina_C_ExecuteUbergraph_Trap_Floor_Stamina::K2Node_SwitchEnum2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Stamina_C_ExecuteUbergraph_Trap_Floor_Stamina, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000174, "Member 'Trap_Floor_Stamina_C_ExecuteUbergraph_Trap_Floor_Stamina::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Stamina_C_ExecuteUbergraph_Trap_Floor_Stamina, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000178, "Member 'Trap_Floor_Stamina_C_ExecuteUbergraph_Trap_Floor_Stamina::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");

// Function Trap_Floor_Stamina.Trap_Floor_Stamina_C.GameplayCue.Abilities.Activation.Traps.ActivateTrap
// 0x0088 (0x0088 - 0x0000)
struct Trap_Floor_Stamina_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap final
{
public:
	EGameplayCueEvent                             EventType;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 Parameters;                                        // 0x0004(0x0084)(Parm)
};
static_assert(alignof(Trap_Floor_Stamina_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap) == 0x000004, "Wrong alignment on Trap_Floor_Stamina_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap");
static_assert(sizeof(Trap_Floor_Stamina_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap) == 0x000088, "Wrong size on Trap_Floor_Stamina_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap");
static_assert(offsetof(Trap_Floor_Stamina_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap, EventType) == 0x000000, "Member 'Trap_Floor_Stamina_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap::EventType' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Stamina_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap, Parameters) == 0x000004, "Member 'Trap_Floor_Stamina_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap::Parameters' has a wrong offset!");

// Function Trap_Floor_Stamina.Trap_Floor_Stamina_C.GameplayCue.Abilities.Activation.Traps.ReloadBegin
// 0x0088 (0x0088 - 0x0000)
struct Trap_Floor_Stamina_C_GameplayCue_Abilities_Activation_Traps_ReloadBegin final
{
public:
	EGameplayCueEvent                             EventType;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 Parameters;                                        // 0x0004(0x0084)(Parm)
};
static_assert(alignof(Trap_Floor_Stamina_C_GameplayCue_Abilities_Activation_Traps_ReloadBegin) == 0x000004, "Wrong alignment on Trap_Floor_Stamina_C_GameplayCue_Abilities_Activation_Traps_ReloadBegin");
static_assert(sizeof(Trap_Floor_Stamina_C_GameplayCue_Abilities_Activation_Traps_ReloadBegin) == 0x000088, "Wrong size on Trap_Floor_Stamina_C_GameplayCue_Abilities_Activation_Traps_ReloadBegin");
static_assert(offsetof(Trap_Floor_Stamina_C_GameplayCue_Abilities_Activation_Traps_ReloadBegin, EventType) == 0x000000, "Member 'Trap_Floor_Stamina_C_GameplayCue_Abilities_Activation_Traps_ReloadBegin::EventType' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Stamina_C_GameplayCue_Abilities_Activation_Traps_ReloadBegin, Parameters) == 0x000004, "Member 'Trap_Floor_Stamina_C_GameplayCue_Abilities_Activation_Traps_ReloadBegin::Parameters' has a wrong offset!");

// Function Trap_Floor_Stamina.Trap_Floor_Stamina_C.Active_FX
// 0x0001 (0x0001 - 0x0000)
struct Trap_Floor_Stamina_C_Active_FX final
{
public:
	bool                                          Active;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Trap_Floor_Stamina_C_Active_FX) == 0x000001, "Wrong alignment on Trap_Floor_Stamina_C_Active_FX");
static_assert(sizeof(Trap_Floor_Stamina_C_Active_FX) == 0x000001, "Wrong size on Trap_Floor_Stamina_C_Active_FX");
static_assert(offsetof(Trap_Floor_Stamina_C_Active_FX, Active) == 0x000000, "Member 'Trap_Floor_Stamina_C_Active_FX::Active' has a wrong offset!");

}

#pragma pack(pop)
