#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Trap_Ward_Master

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function Trap_Ward_Master.Trap_Ward_Master_C.ExecuteUbergraph_Trap_Ward_Master
// 0x002C (0x002C - 0x0000)
struct Trap_Ward_Master_C_ExecuteUbergraph_Trap_Ward_Master final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortAIDirector*                        CallFunc_GetAIDirector_ReturnValue;                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortAIDirector*                        CallFunc_GetAIDirector_ReturnValue2;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IFortPatrolWardInterface> CallFunc_RegisterPatrolWard_PatrolWard_CastInput;  // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IFortPatrolWardInterface> CallFunc_UnregisterPatrolWard_PatrolWard_CastInput; // 0x0014(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Trap_Ward_Master_C_ExecuteUbergraph_Trap_Ward_Master) == 0x000004, "Wrong alignment on Trap_Ward_Master_C_ExecuteUbergraph_Trap_Ward_Master");
static_assert(sizeof(Trap_Ward_Master_C_ExecuteUbergraph_Trap_Ward_Master) == 0x00002C, "Wrong size on Trap_Ward_Master_C_ExecuteUbergraph_Trap_Ward_Master");
static_assert(offsetof(Trap_Ward_Master_C_ExecuteUbergraph_Trap_Ward_Master, EntryPoint) == 0x000000, "Member 'Trap_Ward_Master_C_ExecuteUbergraph_Trap_Ward_Master::EntryPoint' has a wrong offset!");
static_assert(offsetof(Trap_Ward_Master_C_ExecuteUbergraph_Trap_Ward_Master, CallFunc_GetAIDirector_ReturnValue) == 0x000004, "Member 'Trap_Ward_Master_C_ExecuteUbergraph_Trap_Ward_Master::CallFunc_GetAIDirector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Ward_Master_C_ExecuteUbergraph_Trap_Ward_Master, CallFunc_GetAIDirector_ReturnValue2) == 0x000008, "Member 'Trap_Ward_Master_C_ExecuteUbergraph_Trap_Ward_Master::CallFunc_GetAIDirector_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Trap_Ward_Master_C_ExecuteUbergraph_Trap_Ward_Master, CallFunc_RegisterPatrolWard_PatrolWard_CastInput) == 0x00000C, "Member 'Trap_Ward_Master_C_ExecuteUbergraph_Trap_Ward_Master::CallFunc_RegisterPatrolWard_PatrolWard_CastInput' has a wrong offset!");
static_assert(offsetof(Trap_Ward_Master_C_ExecuteUbergraph_Trap_Ward_Master, CallFunc_UnregisterPatrolWard_PatrolWard_CastInput) == 0x000014, "Member 'Trap_Ward_Master_C_ExecuteUbergraph_Trap_Ward_Master::CallFunc_UnregisterPatrolWard_PatrolWard_CastInput' has a wrong offset!");
static_assert(offsetof(Trap_Ward_Master_C_ExecuteUbergraph_Trap_Ward_Master, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00001C, "Member 'Trap_Ward_Master_C_ExecuteUbergraph_Trap_Ward_Master::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Ward_Master_C_ExecuteUbergraph_Trap_Ward_Master, CallFunc_MakeVector_ReturnValue) == 0x000020, "Member 'Trap_Ward_Master_C_ExecuteUbergraph_Trap_Ward_Master::CallFunc_MakeVector_ReturnValue' has a wrong offset!");

// Function Trap_Ward_Master.Trap_Ward_Master_C.GetAffectingType
// 0x0001 (0x0001 - 0x0000)
struct Trap_Ward_Master_C_GetAffectingType final
{
public:
	EWardAffectType                               ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Trap_Ward_Master_C_GetAffectingType) == 0x000001, "Wrong alignment on Trap_Ward_Master_C_GetAffectingType");
static_assert(sizeof(Trap_Ward_Master_C_GetAffectingType) == 0x000001, "Wrong size on Trap_Ward_Master_C_GetAffectingType");
static_assert(offsetof(Trap_Ward_Master_C_GetAffectingType, ReturnValue) == 0x000000, "Member 'Trap_Ward_Master_C_GetAffectingType::ReturnValue' has a wrong offset!");

// Function Trap_Ward_Master.Trap_Ward_Master_C.GetAffectingDistance
// 0x0004 (0x0004 - 0x0000)
struct Trap_Ward_Master_C_GetAffectingDistance final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Trap_Ward_Master_C_GetAffectingDistance) == 0x000004, "Wrong alignment on Trap_Ward_Master_C_GetAffectingDistance");
static_assert(sizeof(Trap_Ward_Master_C_GetAffectingDistance) == 0x000004, "Wrong size on Trap_Ward_Master_C_GetAffectingDistance");
static_assert(offsetof(Trap_Ward_Master_C_GetAffectingDistance, ReturnValue) == 0x000000, "Member 'Trap_Ward_Master_C_GetAffectingDistance::ReturnValue' has a wrong offset!");

}

#pragma pack(pop)
