#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Trap_Ward_Master

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass Trap_Ward_Master.Trap_Ward_Master_C
// 0x001C (0x0A0C - 0x09F0)
class ATrap_Ward_Master_C final : public ABuildingTrapFloor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x09F0(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               P_Ward_Active;                                     // 0x09F4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UAudioComponent*                        Loop_Audio;                                        // 0x09F8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UAudioComponent*                        Place_Audio;                                       // 0x09FC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UParticleSystemComponent*               P_Ward_Radius;                                     // 0x0A00(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	float                                         DurationOfWard;                                    // 0x0A04(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         Ward_Radius;                                       // 0x0A08(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_Trap_Ward_Master(int32 EntryPoint);
	void ReceiveDestroyed();
	void ReceiveBeginPlay();
	void UserConstructionScript();

	EWardAffectType GetAffectingType() const;
	float GetAffectingDistance() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Trap_Ward_Master_C">();
	}
	static class ATrap_Ward_Master_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATrap_Ward_Master_C>();
	}
};
static_assert(alignof(ATrap_Ward_Master_C) == 0x000004, "Wrong alignment on ATrap_Ward_Master_C");
static_assert(sizeof(ATrap_Ward_Master_C) == 0x000A0C, "Wrong size on ATrap_Ward_Master_C");
static_assert(offsetof(ATrap_Ward_Master_C, UberGraphFrame) == 0x0009F0, "Member 'ATrap_Ward_Master_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ATrap_Ward_Master_C, P_Ward_Active) == 0x0009F4, "Member 'ATrap_Ward_Master_C::P_Ward_Active' has a wrong offset!");
static_assert(offsetof(ATrap_Ward_Master_C, Loop_Audio) == 0x0009F8, "Member 'ATrap_Ward_Master_C::Loop_Audio' has a wrong offset!");
static_assert(offsetof(ATrap_Ward_Master_C, Place_Audio) == 0x0009FC, "Member 'ATrap_Ward_Master_C::Place_Audio' has a wrong offset!");
static_assert(offsetof(ATrap_Ward_Master_C, P_Ward_Radius) == 0x000A00, "Member 'ATrap_Ward_Master_C::P_Ward_Radius' has a wrong offset!");
static_assert(offsetof(ATrap_Ward_Master_C, DurationOfWard) == 0x000A04, "Member 'ATrap_Ward_Master_C::DurationOfWard' has a wrong offset!");
static_assert(offsetof(ATrap_Ward_Master_C, Ward_Radius) == 0x000A08, "Member 'ATrap_Ward_Master_C::Ward_Radius' has a wrong offset!");

}

#pragma pack(pop)
