#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Trap_Floor_Wires_JT

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function Trap_Floor_Wires_JT.Trap_Floor_Wires_JT_C.ExecuteUbergraph_Trap_Floor_Wires_JT
// 0x017C (0x017C - 0x0000)
struct Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable2;                                // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable2;                               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable3;                                // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue3;                  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable4;                                // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue4;                  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable3;                               // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue3;                 // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable4;                               // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue4;                 // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Variable5;                                // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue5;                  // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable5;                               // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue5;                 // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E[0x2];                                       // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable6;                                // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue6;                  // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable6;                               // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable7;                                // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue7;                  // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue6;                 // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable7;                               // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_56[0x2];                                       // 0x0056(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable8;                                // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue8;                  // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue7;                 // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable9;                                // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue9;                  // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable8;                               // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue8;                 // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E[0x2];                                       // 0x006E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_UpdateID;                             // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ABuildingSMActor*                       CallFunc_Array_Get_Item;                           // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7E[0x2];                                       // 0x007E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IConnectivity_CarrierNode_Interface_C> K2Node_DynamicCast_AsConnectivity_Carrier_Node_Interface; // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IConnectivity_CarrierNode_Interface_C> K2Node_DynamicCast_AsConnectivity_Carrier_Node_Interface2; // 0x008C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IConnectivity_CarrierNode_Interface_C> K2Node_DynamicCast_AsConnectivity_Carrier_Node_Interface3; // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_LastIndex_ReturnValue2;             // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ABuildingSMActor*                       CallFunc_Array_Get_Item2;                          // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue2;            // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IConnectivity_CarrierNode_Interface_C> K2Node_DynamicCast_AsConnectivity_Carrier_Node_Interface4; // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_LastIndex_ReturnValue3;             // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue3;            // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingSMActor*                       CallFunc_Array_Get_Item3;                          // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IConnectivity_CarrierNode_Interface_C> K2Node_DynamicCast_AsConnectivity_Carrier_Node_Interface5; // 0x00CC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess5;                      // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingSMActor*                       CallFunc_Array_Get_Item4;                          // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_LastIndex_ReturnValue4;             // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IConnectivity_CarrierNode_Interface_C> K2Node_DynamicCast_AsConnectivity_Carrier_Node_Interface6; // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess6;                      // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue4;            // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue3;                  // 0x00EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_EB[0x1];                                       // 0x00EB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IConnectivity_CarrierNode_Interface_C> K2Node_DynamicCast_AsConnectivity_Carrier_Node_Interface7; // 0x00EC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess7;                      // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F5[0x3];                                       // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingSMActor*                       K2Node_Event_DestroyedNode;                        // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_LastIndex_ReturnValue5;             // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue5;            // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingSMActor*                       CallFunc_Array_Get_Item5;                          // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue4;                  // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingSMActor*                       CallFunc_Array_Get_Item6;                          // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_LastIndex_ReturnValue6;             // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue6;            // 0x0115(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue5;                  // 0x0116(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_117[0x1];                                      // 0x0117(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_LastIndex_ReturnValue7;             // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue7;            // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11D[0x3];                                      // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingSMActor*                       CallFunc_Array_Get_Item7;                          // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue6;                  // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0125(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue2;            // 0x0126(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue2;     // 0x0127(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue3;     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x3];                                      // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_LastIndex_ReturnValue8;             // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue8;            // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x3];                                      // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingSMActor*                       CallFunc_Array_Get_Item8;                          // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue7;                  // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x3];                                      // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IConnectivity_CarrierNode_Interface_C> K2Node_DynamicCast_AsConnectivity_Carrier_Node_Interface8; // 0x013C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess8;                      // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_145[0x3];                                      // 0x0145(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IConnectivity_CarrierNode_Interface_C> K2Node_DynamicCast_AsConnectivity_Carrier_Node_Interface9; // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess9;                      // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_151[0x3];                                      // 0x0151(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IConnectivity_CarrierNode_Interface_C> K2Node_DynamicCast_AsConnectivity_Carrier_Node_Interface10; // 0x0154(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess10;                     // 0x015C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15D[0x3];                                      // 0x015D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IConnectivity_CarrierNode_Interface_C> K2Node_DynamicCast_AsConnectivity_Carrier_Node_Interface11; // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess11;                     // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue3;            // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable9;                               // 0x016A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue9;                 // 0x016B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_LastIndex_ReturnValue9;             // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue8;                  // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue9;            // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue9;                  // 0x0172(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_173[0x1];                                      // 0x0173(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingSMActor*                       CallFunc_Array_Get_Item9;                          // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue4;     // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue4;            // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT) == 0x000004, "Wrong alignment on Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT");
static_assert(sizeof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT) == 0x00017C, "Wrong size on Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, EntryPoint) == 0x000000, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::EntryPoint' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, Temp_int_Variable) == 0x000004, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, Temp_bool_Variable) == 0x00000C, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, CallFunc_Not_PreBool_ReturnValue) == 0x00000D, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, Temp_int_Variable2) == 0x000010, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::Temp_int_Variable2' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, CallFunc_Add_IntInt_ReturnValue2) == 0x000014, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, Temp_bool_Variable2) == 0x000018, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, Temp_int_Variable3) == 0x00001C, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::Temp_int_Variable3' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, CallFunc_Add_IntInt_ReturnValue3) == 0x000020, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::CallFunc_Add_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, CallFunc_Not_PreBool_ReturnValue2) == 0x000024, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::CallFunc_Not_PreBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, Temp_int_Variable4) == 0x000028, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::Temp_int_Variable4' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, CallFunc_Add_IntInt_ReturnValue4) == 0x00002C, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::CallFunc_Add_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, Temp_bool_Variable3) == 0x000030, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, CallFunc_Not_PreBool_ReturnValue3) == 0x000031, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::CallFunc_Not_PreBool_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, Temp_bool_Variable4) == 0x000032, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::Temp_bool_Variable4' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, CallFunc_Not_PreBool_ReturnValue4) == 0x000033, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::CallFunc_Not_PreBool_ReturnValue4' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, Temp_int_Variable5) == 0x000034, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::Temp_int_Variable5' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, CallFunc_Add_IntInt_ReturnValue5) == 0x000038, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::CallFunc_Add_IntInt_ReturnValue5' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, Temp_bool_Variable5) == 0x00003C, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::Temp_bool_Variable5' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, CallFunc_Not_PreBool_ReturnValue5) == 0x00003D, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::CallFunc_Not_PreBool_ReturnValue5' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, Temp_int_Variable6) == 0x000040, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::Temp_int_Variable6' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, CallFunc_Add_IntInt_ReturnValue6) == 0x000044, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::CallFunc_Add_IntInt_ReturnValue6' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, Temp_bool_Variable6) == 0x000048, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::Temp_bool_Variable6' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, Temp_int_Variable7) == 0x00004C, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::Temp_int_Variable7' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, CallFunc_Add_IntInt_ReturnValue7) == 0x000050, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::CallFunc_Add_IntInt_ReturnValue7' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, CallFunc_Not_PreBool_ReturnValue6) == 0x000054, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::CallFunc_Not_PreBool_ReturnValue6' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, Temp_bool_Variable7) == 0x000055, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::Temp_bool_Variable7' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, Temp_int_Variable8) == 0x000058, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::Temp_int_Variable8' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, CallFunc_Add_IntInt_ReturnValue8) == 0x00005C, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::CallFunc_Add_IntInt_ReturnValue8' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, CallFunc_Not_PreBool_ReturnValue7) == 0x000060, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::CallFunc_Not_PreBool_ReturnValue7' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, Temp_int_Variable9) == 0x000064, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::Temp_int_Variable9' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, CallFunc_Add_IntInt_ReturnValue9) == 0x000068, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::CallFunc_Add_IntInt_ReturnValue9' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, Temp_bool_Variable8) == 0x00006C, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::Temp_bool_Variable8' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, CallFunc_Not_PreBool_ReturnValue8) == 0x00006D, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::CallFunc_Not_PreBool_ReturnValue8' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, K2Node_Event_UpdateID) == 0x000070, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::K2Node_Event_UpdateID' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, CallFunc_Array_Get_Item) == 0x000074, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, CallFunc_Array_LastIndex_ReturnValue) == 0x000078, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00007C, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, CallFunc_BooleanAND_ReturnValue) == 0x00007D, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, K2Node_DynamicCast_AsConnectivity_Carrier_Node_Interface) == 0x000080, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::K2Node_DynamicCast_AsConnectivity_Carrier_Node_Interface' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, K2Node_DynamicCast_bSuccess) == 0x000088, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, K2Node_DynamicCast_AsConnectivity_Carrier_Node_Interface2) == 0x00008C, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::K2Node_DynamicCast_AsConnectivity_Carrier_Node_Interface2' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, K2Node_DynamicCast_bSuccess2) == 0x000094, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, K2Node_DynamicCast_AsConnectivity_Carrier_Node_Interface3) == 0x000098, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::K2Node_DynamicCast_AsConnectivity_Carrier_Node_Interface3' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, K2Node_DynamicCast_bSuccess3) == 0x0000A0, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, CallFunc_Array_LastIndex_ReturnValue2) == 0x0000A4, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::CallFunc_Array_LastIndex_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, CallFunc_Array_Get_Item2) == 0x0000A8, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, CallFunc_LessEqual_IntInt_ReturnValue2) == 0x0000AC, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::CallFunc_LessEqual_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, K2Node_DynamicCast_AsConnectivity_Carrier_Node_Interface4) == 0x0000B0, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::K2Node_DynamicCast_AsConnectivity_Carrier_Node_Interface4' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, K2Node_DynamicCast_bSuccess4) == 0x0000B8, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, CallFunc_Array_LastIndex_ReturnValue3) == 0x0000BC, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::CallFunc_Array_LastIndex_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, CallFunc_LessEqual_IntInt_ReturnValue3) == 0x0000C0, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::CallFunc_LessEqual_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, CallFunc_Array_Get_Item3) == 0x0000C4, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::CallFunc_Array_Get_Item3' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, CallFunc_BooleanAND_ReturnValue2) == 0x0000C8, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, K2Node_DynamicCast_AsConnectivity_Carrier_Node_Interface5) == 0x0000CC, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::K2Node_DynamicCast_AsConnectivity_Carrier_Node_Interface5' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, K2Node_DynamicCast_bSuccess5) == 0x0000D4, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::K2Node_DynamicCast_bSuccess5' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, CallFunc_Array_Get_Item4) == 0x0000D8, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::CallFunc_Array_Get_Item4' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, CallFunc_Array_LastIndex_ReturnValue4) == 0x0000DC, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::CallFunc_Array_LastIndex_ReturnValue4' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, K2Node_DynamicCast_AsConnectivity_Carrier_Node_Interface6) == 0x0000E0, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::K2Node_DynamicCast_AsConnectivity_Carrier_Node_Interface6' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, K2Node_DynamicCast_bSuccess6) == 0x0000E8, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::K2Node_DynamicCast_bSuccess6' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, CallFunc_LessEqual_IntInt_ReturnValue4) == 0x0000E9, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::CallFunc_LessEqual_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, CallFunc_BooleanAND_ReturnValue3) == 0x0000EA, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::CallFunc_BooleanAND_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, K2Node_DynamicCast_AsConnectivity_Carrier_Node_Interface7) == 0x0000EC, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::K2Node_DynamicCast_AsConnectivity_Carrier_Node_Interface7' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, K2Node_DynamicCast_bSuccess7) == 0x0000F4, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::K2Node_DynamicCast_bSuccess7' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, K2Node_Event_DestroyedNode) == 0x0000F8, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::K2Node_Event_DestroyedNode' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, CallFunc_Array_LastIndex_ReturnValue5) == 0x0000FC, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::CallFunc_Array_LastIndex_ReturnValue5' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, CallFunc_LessEqual_IntInt_ReturnValue5) == 0x000100, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::CallFunc_LessEqual_IntInt_ReturnValue5' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, CallFunc_Array_Get_Item5) == 0x000104, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::CallFunc_Array_Get_Item5' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, CallFunc_BooleanAND_ReturnValue4) == 0x000108, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::CallFunc_BooleanAND_ReturnValue4' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, CallFunc_Array_Get_Item6) == 0x00010C, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::CallFunc_Array_Get_Item6' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, CallFunc_Array_LastIndex_ReturnValue6) == 0x000110, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::CallFunc_Array_LastIndex_ReturnValue6' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, CallFunc_Array_RemoveItem_ReturnValue) == 0x000114, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, CallFunc_LessEqual_IntInt_ReturnValue6) == 0x000115, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::CallFunc_LessEqual_IntInt_ReturnValue6' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, CallFunc_BooleanAND_ReturnValue5) == 0x000116, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::CallFunc_BooleanAND_ReturnValue5' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, CallFunc_Array_LastIndex_ReturnValue7) == 0x000118, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::CallFunc_Array_LastIndex_ReturnValue7' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, CallFunc_LessEqual_IntInt_ReturnValue7) == 0x00011C, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::CallFunc_LessEqual_IntInt_ReturnValue7' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, CallFunc_Array_Get_Item7) == 0x000120, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::CallFunc_Array_Get_Item7' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, CallFunc_BooleanAND_ReturnValue6) == 0x000124, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::CallFunc_BooleanAND_ReturnValue6' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000125, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, CallFunc_Array_RemoveItem_ReturnValue2) == 0x000126, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::CallFunc_Array_RemoveItem_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, CallFunc_EqualEqual_ObjectObject_ReturnValue2) == 0x000127, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::CallFunc_EqualEqual_ObjectObject_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, CallFunc_EqualEqual_ObjectObject_ReturnValue3) == 0x000128, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::CallFunc_EqualEqual_ObjectObject_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, CallFunc_Array_LastIndex_ReturnValue8) == 0x00012C, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::CallFunc_Array_LastIndex_ReturnValue8' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, CallFunc_LessEqual_IntInt_ReturnValue8) == 0x000130, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::CallFunc_LessEqual_IntInt_ReturnValue8' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, CallFunc_Array_Get_Item8) == 0x000134, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::CallFunc_Array_Get_Item8' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, CallFunc_BooleanAND_ReturnValue7) == 0x000138, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::CallFunc_BooleanAND_ReturnValue7' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, K2Node_DynamicCast_AsConnectivity_Carrier_Node_Interface8) == 0x00013C, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::K2Node_DynamicCast_AsConnectivity_Carrier_Node_Interface8' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, K2Node_DynamicCast_bSuccess8) == 0x000144, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::K2Node_DynamicCast_bSuccess8' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, K2Node_DynamicCast_AsConnectivity_Carrier_Node_Interface9) == 0x000148, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::K2Node_DynamicCast_AsConnectivity_Carrier_Node_Interface9' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, K2Node_DynamicCast_bSuccess9) == 0x000150, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::K2Node_DynamicCast_bSuccess9' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, K2Node_DynamicCast_AsConnectivity_Carrier_Node_Interface10) == 0x000154, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::K2Node_DynamicCast_AsConnectivity_Carrier_Node_Interface10' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, K2Node_DynamicCast_bSuccess10) == 0x00015C, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::K2Node_DynamicCast_bSuccess10' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, K2Node_DynamicCast_AsConnectivity_Carrier_Node_Interface11) == 0x000160, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::K2Node_DynamicCast_AsConnectivity_Carrier_Node_Interface11' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, K2Node_DynamicCast_bSuccess11) == 0x000168, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::K2Node_DynamicCast_bSuccess11' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, CallFunc_Array_RemoveItem_ReturnValue3) == 0x000169, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::CallFunc_Array_RemoveItem_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, Temp_bool_Variable9) == 0x00016A, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::Temp_bool_Variable9' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, CallFunc_Not_PreBool_ReturnValue9) == 0x00016B, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::CallFunc_Not_PreBool_ReturnValue9' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, CallFunc_Array_LastIndex_ReturnValue9) == 0x00016C, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::CallFunc_Array_LastIndex_ReturnValue9' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, CallFunc_BooleanAND_ReturnValue8) == 0x000170, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::CallFunc_BooleanAND_ReturnValue8' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, CallFunc_LessEqual_IntInt_ReturnValue9) == 0x000171, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::CallFunc_LessEqual_IntInt_ReturnValue9' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, CallFunc_BooleanAND_ReturnValue9) == 0x000172, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::CallFunc_BooleanAND_ReturnValue9' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, CallFunc_Array_Get_Item9) == 0x000174, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::CallFunc_Array_Get_Item9' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, CallFunc_EqualEqual_ObjectObject_ReturnValue4) == 0x000178, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::CallFunc_EqualEqual_ObjectObject_ReturnValue4' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT, CallFunc_Array_RemoveItem_ReturnValue4) == 0x000179, "Member 'Trap_Floor_Wires_JT_C_ExecuteUbergraph_Trap_Floor_Wires_JT::CallFunc_Array_RemoveItem_ReturnValue4' has a wrong offset!");

// Function Trap_Floor_Wires_JT.Trap_Floor_Wires_JT_C.UpdateDestroyedNode
// 0x0004 (0x0004 - 0x0000)
struct Trap_Floor_Wires_JT_C_UpdateDestroyedNode final
{
public:
	class ABuildingSMActor*                       DestroyedNode;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Trap_Floor_Wires_JT_C_UpdateDestroyedNode) == 0x000004, "Wrong alignment on Trap_Floor_Wires_JT_C_UpdateDestroyedNode");
static_assert(sizeof(Trap_Floor_Wires_JT_C_UpdateDestroyedNode) == 0x000004, "Wrong size on Trap_Floor_Wires_JT_C_UpdateDestroyedNode");
static_assert(offsetof(Trap_Floor_Wires_JT_C_UpdateDestroyedNode, DestroyedNode) == 0x000000, "Member 'Trap_Floor_Wires_JT_C_UpdateDestroyedNode::DestroyedNode' has a wrong offset!");

// Function Trap_Floor_Wires_JT.Trap_Floor_Wires_JT_C.CarrierNode_UpdateAll
// 0x0004 (0x0004 - 0x0000)
struct Trap_Floor_Wires_JT_C_CarrierNode_UpdateAll final
{
public:
	float                                         UpdateID;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Trap_Floor_Wires_JT_C_CarrierNode_UpdateAll) == 0x000004, "Wrong alignment on Trap_Floor_Wires_JT_C_CarrierNode_UpdateAll");
static_assert(sizeof(Trap_Floor_Wires_JT_C_CarrierNode_UpdateAll) == 0x000004, "Wrong size on Trap_Floor_Wires_JT_C_CarrierNode_UpdateAll");
static_assert(offsetof(Trap_Floor_Wires_JT_C_CarrierNode_UpdateAll, UpdateID) == 0x000000, "Member 'Trap_Floor_Wires_JT_C_CarrierNode_UpdateAll::UpdateID' has a wrong offset!");

// Function Trap_Floor_Wires_JT.Trap_Floor_Wires_JT_C.UserConstructionScript
// 0x0004 (0x0004 - 0x0000)
struct Trap_Floor_Wires_JT_C_UserConstructionScript final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Trap_Floor_Wires_JT_C_UserConstructionScript) == 0x000004, "Wrong alignment on Trap_Floor_Wires_JT_C_UserConstructionScript");
static_assert(sizeof(Trap_Floor_Wires_JT_C_UserConstructionScript) == 0x000004, "Wrong size on Trap_Floor_Wires_JT_C_UserConstructionScript");
static_assert(offsetof(Trap_Floor_Wires_JT_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000000, "Member 'Trap_Floor_Wires_JT_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

// Function Trap_Floor_Wires_JT.Trap_Floor_Wires_JT_C.CompareNodeArrays
// 0x0014 (0x0014 - 0x0000)
struct Trap_Floor_Wires_JT_C_CompareNodeArrays final
{
public:
	bool                                          bNodeArrayHaveChanged;                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue2;              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Trap_Floor_Wires_JT_C_CompareNodeArrays) == 0x000004, "Wrong alignment on Trap_Floor_Wires_JT_C_CompareNodeArrays");
static_assert(sizeof(Trap_Floor_Wires_JT_C_CompareNodeArrays) == 0x000014, "Wrong size on Trap_Floor_Wires_JT_C_CompareNodeArrays");
static_assert(offsetof(Trap_Floor_Wires_JT_C_CompareNodeArrays, bNodeArrayHaveChanged) == 0x000000, "Member 'Trap_Floor_Wires_JT_C_CompareNodeArrays::bNodeArrayHaveChanged' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_CompareNodeArrays, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'Trap_Floor_Wires_JT_C_CompareNodeArrays::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_CompareNodeArrays, CallFunc_Greater_IntInt_ReturnValue) == 0x000008, "Member 'Trap_Floor_Wires_JT_C_CompareNodeArrays::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_CompareNodeArrays, CallFunc_Less_IntInt_ReturnValue) == 0x000009, "Member 'Trap_Floor_Wires_JT_C_CompareNodeArrays::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_CompareNodeArrays, CallFunc_Array_Length_ReturnValue2) == 0x00000C, "Member 'Trap_Floor_Wires_JT_C_CompareNodeArrays::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_CompareNodeArrays, CallFunc_Less_IntInt_ReturnValue2) == 0x000010, "Member 'Trap_Floor_Wires_JT_C_CompareNodeArrays::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Wires_JT_C_CompareNodeArrays, CallFunc_Greater_IntInt_ReturnValue2) == 0x000011, "Member 'Trap_Floor_Wires_JT_C_CompareNodeArrays::CallFunc_Greater_IntInt_ReturnValue2' has a wrong offset!");

// Function Trap_Floor_Wires_JT.Trap_Floor_Wires_JT_C.FindNeigboringNodes
// 0x00F4 (0x00F4 - 0x0000)
struct Trap_Floor_Wires_JT_C_FindNeigboringNodes final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0008(0x000C)(ConstParm, ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue2;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue3;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<class AActor*>                         CallFunc_BoxOverlapActors_NEW_OutActors;           // 0x0038(0x000C)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_BoxOverlapActors_NEW_ReturnValue;         // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IConnectivity_CarrierNode_Interface_C> K2Node_DynamicCast_AsConnectivity_Carrier_Node_Interface; // 0x0054(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetIsCarrierNode_bIsCarrierNode;          // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E[0x2];                                       // 0x005E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetIsCarrierNode_NodeOrigin;              // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetIsCarrierNode_bDestroyed;              // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingSMActor*                       K2Node_DynamicCast_AsBuilding_SMActor;             // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
