#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Trap_Wall_HeavyMetal

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function Trap_Wall_HeavyMetal.Trap_Wall_HeavyMetal_C.ExecuteUbergraph_Trap_Wall_HeavyMetal
// 0x0288 (0x0288 - 0x0000)
struct Trap_Wall_HeavyMetal_C_ExecuteUbergraph_Trap_Wall_HeavyMetal final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable2;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable2;                // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue2;                 // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue2;         // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue3;         // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue4;         // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UMaterialInstanceDynamic*               CallFunc_GetAnimatingMID_ReturnValue;              // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UStaticMeshComponent*                   CallFunc_GetBuildingMeshComponent_ReturnValue;     // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UStaticMeshComponent*                   CallFunc_GetBuildingMeshComponent_ReturnValue2;    // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_AddLocalRotation_SweepHitResult;       // 0x0074(0x0080)(ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_AddLocalRotation_SweepHitResult2;      // 0x00F4(0x0080)(ContainsInstancedReference)
	EGameplayCueEvent                             K2Node_GameplayCueEvent_EventType2;                // 0x0174(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_175[0x3];                                      // 0x0175(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 K2Node_GameplayCueEvent_Parameters2;               // 0x0178(0x0084)()
	EGameplayCueEvent                             K2Node_GameplayCueEvent_EventType;                 // 0x01FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FD[0x3];                                      // 0x01FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 K2Node_GameplayCueEvent_Parameters;                // 0x0200(0x0084)()
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0284(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x0285(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Trap_Wall_HeavyMetal_C_ExecuteUbergraph_Trap_Wall_HeavyMetal) == 0x000004, "Wrong alignment on Trap_Wall_HeavyMetal_C_ExecuteUbergraph_Trap_Wall_HeavyMetal");
static_assert(sizeof(Trap_Wall_HeavyMetal_C_ExecuteUbergraph_Trap_Wall_HeavyMetal) == 0x000288, "Wrong size on Trap_Wall_HeavyMetal_C_ExecuteUbergraph_Trap_Wall_HeavyMetal");
static_assert(offsetof(Trap_Wall_HeavyMetal_C_ExecuteUbergraph_Trap_Wall_HeavyMetal, EntryPoint) == 0x000000, "Member 'Trap_Wall_HeavyMetal_C_ExecuteUbergraph_Trap_Wall_HeavyMetal::EntryPoint' has a wrong offset!");
static_assert(offsetof(Trap_Wall_HeavyMetal_C_ExecuteUbergraph_Trap_Wall_HeavyMetal, Temp_bool_IsClosed_Variable) == 0x000004, "Member 'Trap_Wall_HeavyMetal_C_ExecuteUbergraph_Trap_Wall_HeavyMetal::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Trap_Wall_HeavyMetal_C_ExecuteUbergraph_Trap_Wall_HeavyMetal, Temp_bool_Has_Been_Initd_Variable) == 0x000005, "Member 'Trap_Wall_HeavyMetal_C_ExecuteUbergraph_Trap_Wall_HeavyMetal::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Trap_Wall_HeavyMetal_C_ExecuteUbergraph_Trap_Wall_HeavyMetal, CallFunc_MakeRotator_ReturnValue) == 0x000008, "Member 'Trap_Wall_HeavyMetal_C_ExecuteUbergraph_Trap_Wall_HeavyMetal::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Wall_HeavyMetal_C_ExecuteUbergraph_Trap_Wall_HeavyMetal, Temp_bool_IsClosed_Variable2) == 0x000014, "Member 'Trap_Wall_HeavyMetal_C_ExecuteUbergraph_Trap_Wall_HeavyMetal::Temp_bool_IsClosed_Variable2' has a wrong offset!");
static_assert(offsetof(Trap_Wall_HeavyMetal_C_ExecuteUbergraph_Trap_Wall_HeavyMetal, Temp_bool_Has_Been_Initd_Variable2) == 0x000015, "Member 'Trap_Wall_HeavyMetal_C_ExecuteUbergraph_Trap_Wall_HeavyMetal::Temp_bool_Has_Been_Initd_Variable2' has a wrong offset!");
static_assert(offsetof(Trap_Wall_HeavyMetal_C_ExecuteUbergraph_Trap_Wall_HeavyMetal, CallFunc_MakeRotator_ReturnValue2) == 0x000018, "Member 'Trap_Wall_HeavyMetal_C_ExecuteUbergraph_Trap_Wall_HeavyMetal::CallFunc_MakeRotator_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Trap_Wall_HeavyMetal_C_ExecuteUbergraph_Trap_Wall_HeavyMetal, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000024, "Member 'Trap_Wall_HeavyMetal_C_ExecuteUbergraph_Trap_Wall_HeavyMetal::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Wall_HeavyMetal_C_ExecuteUbergraph_Trap_Wall_HeavyMetal, CallFunc_K2_GetActorLocation_ReturnValue2) == 0x000030, "Member 'Trap_Wall_HeavyMetal_C_ExecuteUbergraph_Trap_Wall_HeavyMetal::CallFunc_K2_GetActorLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Trap_Wall_HeavyMetal_C_ExecuteUbergraph_Trap_Wall_HeavyMetal, CallFunc_K2_GetActorLocation_ReturnValue3) == 0x00003C, "Member 'Trap_Wall_HeavyMetal_C_ExecuteUbergraph_Trap_Wall_HeavyMetal::CallFunc_K2_GetActorLocation_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Trap_Wall_HeavyMetal_C_ExecuteUbergraph_Trap_Wall_HeavyMetal, CallFunc_K2_GetActorLocation_ReturnValue4) == 0x000048, "Member 'Trap_Wall_HeavyMetal_C_ExecuteUbergraph_Trap_Wall_HeavyMetal::CallFunc_K2_GetActorLocation_ReturnValue4' has a wrong offset!");
static_assert(offsetof(Trap_Wall_HeavyMetal_C_ExecuteUbergraph_Trap_Wall_HeavyMetal, CallFunc_GetAnimatingMID_ReturnValue) == 0x000054, "Member 'Trap_Wall_HeavyMetal_C_ExecuteUbergraph_Trap_Wall_HeavyMetal::CallFunc_GetAnimatingMID_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Wall_HeavyMetal_C_ExecuteUbergraph_Trap_Wall_HeavyMetal, CallFunc_GetBuildingMeshComponent_ReturnValue) == 0x000058, "Member 'Trap_Wall_HeavyMetal_C_ExecuteUbergraph_Trap_Wall_HeavyMetal::CallFunc_GetBuildingMeshComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Wall_HeavyMetal_C_ExecuteUbergraph_Trap_Wall_HeavyMetal, CallFunc_GetBuildingMeshComponent_ReturnValue2) == 0x00005C, "Member 'Trap_Wall_HeavyMetal_C_ExecuteUbergraph_Trap_Wall_HeavyMetal::CallFunc_GetBuildingMeshComponent_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Trap_Wall_HeavyMetal_C_ExecuteUbergraph_Trap_Wall_HeavyMetal, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x000060, "Member 'Trap_Wall_HeavyMetal_C_ExecuteUbergraph_Trap_Wall_HeavyMetal::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Wall_HeavyMetal_C_ExecuteUbergraph_Trap_Wall_HeavyMetal, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000064, "Member 'Trap_Wall_HeavyMetal_C_ExecuteUbergraph_Trap_Wall_HeavyMetal::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Wall_HeavyMetal_C_ExecuteUbergraph_Trap_Wall_HeavyMetal, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000070, "Member 'Trap_Wall_HeavyMetal_C_ExecuteUbergraph_Trap_Wall_HeavyMetal::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Wall_HeavyMetal_C_ExecuteUbergraph_Trap_Wall_HeavyMetal, CallFunc_K2_AddLocalRotation_SweepHitResult) == 0x000074, "Member 'Trap_Wall_HeavyMetal_C_ExecuteUbergraph_Trap_Wall_HeavyMetal::CallFunc_K2_AddLocalRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Trap_Wall_HeavyMetal_C_ExecuteUbergraph_Trap_Wall_HeavyMetal, CallFunc_K2_AddLocalRotation_SweepHitResult2) == 0x0000F4, "Member 'Trap_Wall_HeavyMetal_C_ExecuteUbergraph_Trap_Wall_HeavyMetal::CallFunc_K2_AddLocalRotation_SweepHitResult2' has a wrong offset!");
static_assert(offsetof(Trap_Wall_HeavyMetal_C_ExecuteUbergraph_Trap_Wall_HeavyMetal, K2Node_GameplayCueEvent_EventType2) == 0x000174, "Member 'Trap_Wall_HeavyMetal_C_ExecuteUbergraph_Trap_Wall_HeavyMetal::K2Node_GameplayCueEvent_EventType2' has a wrong offset!");
static_assert(offsetof(Trap_Wall_HeavyMetal_C_ExecuteUbergraph_Trap_Wall_HeavyMetal, K2Node_GameplayCueEvent_Parameters2) == 0x000178, "Member 'Trap_Wall_HeavyMetal_C_ExecuteUbergraph_Trap_Wall_HeavyMetal::K2Node_GameplayCueEvent_Parameters2' has a wrong offset!");
static_assert(offsetof(Trap_Wall_HeavyMetal_C_ExecuteUbergraph_Trap_Wall_HeavyMetal, K2Node_GameplayCueEvent_EventType) == 0x0001FC, "Member 'Trap_Wall_HeavyMetal_C_ExecuteUbergraph_Trap_Wall_HeavyMetal::K2Node_GameplayCueEvent_EventType' has a wrong offset!");
static_assert(offsetof(Trap_Wall_HeavyMetal_C_ExecuteUbergraph_Trap_Wall_HeavyMetal, K2Node_GameplayCueEvent_Parameters) == 0x000200, "Member 'Trap_Wall_HeavyMetal_C_ExecuteUbergraph_Trap_Wall_HeavyMetal::K2Node_GameplayCueEvent_Parameters' has a wrong offset!");
static_assert(offsetof(Trap_Wall_HeavyMetal_C_ExecuteUbergraph_Trap_Wall_HeavyMetal, K2Node_SwitchEnum_CmpSuccess) == 0x000284, "Member 'Trap_Wall_HeavyMetal_C_ExecuteUbergraph_Trap_Wall_HeavyMetal::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Trap_Wall_HeavyMetal_C_ExecuteUbergraph_Trap_Wall_HeavyMetal, K2Node_SwitchEnum2_CmpSuccess) == 0x000285, "Member 'Trap_Wall_HeavyMetal_C_ExecuteUbergraph_Trap_Wall_HeavyMetal::K2Node_SwitchEnum2_CmpSuccess' has a wrong offset!");

// Function Trap_Wall_HeavyMetal.Trap_Wall_HeavyMetal_C.GameplayCue.Abilities.Activation.Traps.ReloadBegin
// 0x0088 (0x0088 - 0x0000)
struct Trap_Wall_HeavyMetal_C_GameplayCue_Abilities_Activation_Traps_ReloadBegin final
{
public:
	EGameplayCueEvent                             EventType;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 Parameters;                                        // 0x0004(0x0084)(Parm)
};
static_assert(alignof(Trap_Wall_HeavyMetal_C_GameplayCue_Abilities_Activation_Traps_ReloadBegin) == 0x000004, "Wrong alignment on Trap_Wall_HeavyMetal_C_GameplayCue_Abilities_Activation_Traps_ReloadBegin");
static_assert(sizeof(Trap_Wall_HeavyMetal_C_GameplayCue_Abilities_Activation_Traps_ReloadBegin) == 0x000088, "Wrong size on Trap_Wall_HeavyMetal_C_GameplayCue_Abilities_Activation_Traps_ReloadBegin");
static_assert(offsetof(Trap_Wall_HeavyMetal_C_GameplayCue_Abilities_Activation_Traps_ReloadBegin, EventType) == 0x000000, "Member 'Trap_Wall_HeavyMetal_C_GameplayCue_Abilities_Activation_Traps_ReloadBegin::EventType' has a wrong offset!");
static_assert(offsetof(Trap_Wall_HeavyMetal_C_GameplayCue_Abilities_Activation_Traps_ReloadBegin, Parameters) == 0x000004, "Member 'Trap_Wall_HeavyMetal_C_GameplayCue_Abilities_Activation_Traps_ReloadBegin::Parameters' has a wrong offset!");

// Function Trap_Wall_HeavyMetal.Trap_Wall_HeavyMetal_C.GameplayCue.Abilities.Activation.Traps.ActivateTrap
// 0x0088 (0x0088 - 0x0000)
struct Trap_Wall_HeavyMetal_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap final
{
public:
	EGameplayCueEvent                             EventType;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 Parameters;                                        // 0x0004(0x0084)(Parm)
};
static_assert(alignof(Trap_Wall_HeavyMetal_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap) == 0x000004, "Wrong alignment on Trap_Wall_HeavyMetal_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap");
static_assert(sizeof(Trap_Wall_HeavyMetal_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap) == 0x000088, "Wrong size on Trap_Wall_HeavyMetal_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap");
static_assert(offsetof(Trap_Wall_HeavyMetal_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap, EventType) == 0x000000, "Member 'Trap_Wall_HeavyMetal_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap::EventType' has a wrong offset!");
static_assert(offsetof(Trap_Wall_HeavyMetal_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap, Parameters) == 0x000004, "Member 'Trap_Wall_HeavyMetal_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap::Parameters' has a wrong offset!");

}

#pragma pack(pop)
