#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Trap_Wall_HeavyMetal

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "GameplayAbilities_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass Trap_Wall_HeavyMetal.Trap_Wall_HeavyMetal_C
// 0x008C (0x0A7C - 0x09F0)
class ATrap_Wall_HeavyMetal_C final : public ABuildingTrapWall
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x09F0(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Electric_2;                                        // 0x09F4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   Electric_1;                                        // 0x09F8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   Pipes;                                             // 0x09FC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class USkeletalMeshComponent*                 Guitar;                                            // 0x0A00(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   Unicorn;                                           // 0x0A04(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   PowerBox;                                          // 0x0A08(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   RazorWire;                                         // 0x0A0C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   Speakers;                                          // 0x0A10(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UAudioComponent*                        MetalHitSound;                                     // 0x0A14(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UPointLightComponent*                   Point_Light;                                       // 0x0A18(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UBoxComponent*                          TriggerComponent;                                  // 0x0A1C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class USceneComponent*                        Root;                                              // 0x0A20(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	float                                         Timeline_4_NewTrack_3_F88A4E3445BA71DAAB1ABA923728FEB1; // 0x0A24(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ETimelineDirection                            Timeline_4__Direction_F88A4E3445BA71DAAB1ABA923728FEB1; // 0x0A28(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A29[0x3];                                      // 0x0A29(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_4;                                        // 0x0A2C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         Timeline_2_NewTrack_3_992ADD614A1F33F23BD393A426C9FEFB; // 0x0A30(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ETimelineDirection                            Timeline_2__Direction_992ADD614A1F33F23BD393A426C9FEFB; // 0x0A34(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A35[0x3];                                      // 0x0A35(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_2;                                        // 0x0A38(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         Timeline_1_Brightness_785C5030459D9FB53F0B2BBF5A6BDA36; // 0x0A3C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ETimelineDirection                            Timeline_1__Direction_785C5030459D9FB53F0B2BBF5A6BDA36; // 0x0A40(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A41[0x3];                                      // 0x0A41(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_1;                                        // 0x0A44(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         Timeline_0_Light_Brightness_8CC35F6445A6E8BD14727E81F5E3AF63; // 0x0A48(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ETimelineDirection                            Timeline_0__Direction_8CC35F6445A6E8BD14727E81F5E3AF63; // 0x0A4C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A4D[0x3];                                      // 0x0A4D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0A50(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         Active_Glow;                                       // 0x0A54(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	int32                                         TrapMesh;                                          // 0x0A58(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class USoundCue*                              Activate_Sound_Cue;                                // 0x0A5C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class USoundCue*                              Placed_Sound_Cue;                                  // 0x0A60(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class USoundCue*                              Explode_Sound_Cue;                                 // 0x0A64(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class USoundCue*                              Trap_Fire_Sound_Cue;                               // 0x0A68(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UMaterialInstanceDynamic*               Material_Light_Brightness;                         // 0x0A6C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         Light_Glow;                                        // 0x0A70(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UMaterialInstanceDynamic*               Material_glow;                                     // 0x0A74(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UMaterialInstanceDynamic*               Animating_MID;                                     // 0x0A78(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_Trap_Wall_HeavyMetal(int32 EntryPoint);
	void OnOutOfDurability();
	void GameplayCue_Abilities_Activation_Traps_ReloadBegin(EGameplayCueEvent EventType, const struct FGameplayCueParameters& Parameters);
	void GameplayCue_Abilities_Activation_Traps_ActivateTrap(EGameplayCueEvent EventType, const struct FGameplayCueParameters& Parameters);
	void OnReloadEnd();
	void OnFinishedBuilding();
	void OnPlaced();
	void Timeline_4__UpdateFunc();
	void Timeline_4__FinishedFunc();
	void Timeline_2__UpdateFunc();
	void Timeline_2__FinishedFunc();
	void Timeline_1__UpdateFunc();
	void Timeline_1__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Trap_Wall_HeavyMetal_C">();
	}
	static class ATrap_Wall_HeavyMetal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATrap_Wall_HeavyMetal_C>();
	}
};
static_assert(alignof(ATrap_Wall_HeavyMetal_C) == 0x000004, "Wrong alignment on ATrap_Wall_HeavyMetal_C");
static_assert(sizeof(ATrap_Wall_HeavyMetal_C) == 0x000A7C, "Wrong size on ATrap_Wall_HeavyMetal_C");
static_assert(offsetof(ATrap_Wall_HeavyMetal_C, UberGraphFrame) == 0x0009F0, "Member 'ATrap_Wall_HeavyMetal_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ATrap_Wall_HeavyMetal_C, Electric_2) == 0x0009F4, "Member 'ATrap_Wall_HeavyMetal_C::Electric_2' has a wrong offset!");
static_assert(offsetof(ATrap_Wall_HeavyMetal_C, Electric_1) == 0x0009F8, "Member 'ATrap_Wall_HeavyMetal_C::Electric_1' has a wrong offset!");
static_assert(offsetof(ATrap_Wall_HeavyMetal_C, Pipes) == 0x0009FC, "Member 'ATrap_Wall_HeavyMetal_C::Pipes' has a wrong offset!");
static_assert(offsetof(ATrap_Wall_HeavyMetal_C, Guitar) == 0x000A00, "Member 'ATrap_Wall_HeavyMetal_C::Guitar' has a wrong offset!");
static_assert(offsetof(ATrap_Wall_HeavyMetal_C, Unicorn) == 0x000A04, "Member 'ATrap_Wall_HeavyMetal_C::Unicorn' has a wrong offset!");
static_assert(offsetof(ATrap_Wall_HeavyMetal_C, PowerBox) == 0x000A08, "Member 'ATrap_Wall_HeavyMetal_C::PowerBox' has a wrong offset!");
static_assert(offsetof(ATrap_Wall_HeavyMetal_C, RazorWire) == 0x000A0C, "Member 'ATrap_Wall_HeavyMetal_C::RazorWire' has a wrong offset!");
static_assert(offsetof(ATrap_Wall_HeavyMetal_C, Speakers) == 0x000A10, "Member 'ATrap_Wall_HeavyMetal_C::Speakers' has a wrong offset!");
static_assert(offsetof(ATrap_Wall_HeavyMetal_C, MetalHitSound) == 0x000A14, "Member 'ATrap_Wall_HeavyMetal_C::MetalHitSound' has a wrong offset!");
static_assert(offsetof(ATrap_Wall_HeavyMetal_C, Point_Light) == 0x000A18, "Member 'ATrap_Wall_HeavyMetal_C::Point_Light' has a wrong offset!");
static_assert(offsetof(ATrap_Wall_HeavyMetal_C, TriggerComponent) == 0x000A1C, "Member 'ATrap_Wall_HeavyMetal_C::TriggerComponent' has a wrong offset!");
static_assert(offsetof(ATrap_Wall_HeavyMetal_C, Root) == 0x000A20, "Member 'ATrap_Wall_HeavyMetal_C::Root' has a wrong offset!");
static_assert(offsetof(ATrap_Wall_HeavyMetal_C, Timeline_4_NewTrack_3_F88A4E3445BA71DAAB1ABA923728FEB1) == 0x000A24, "Member 'ATrap_Wall_HeavyMetal_C::Timeline_4_NewTrack_3_F88A4E3445BA71DAAB1ABA923728FEB1' has a wrong offset!");
static_assert(offsetof(ATrap_Wall_HeavyMetal_C, Timeline_4__Direction_F88A4E3445BA71DAAB1ABA923728FEB1) == 0x000A28, "Member 'ATrap_Wall_HeavyMetal_C::Timeline_4__Direction_F88A4E3445BA71DAAB1ABA923728FEB1' has a wrong offset!");
static_assert(offsetof(ATrap_Wall_HeavyMetal_C, Timeline_4) == 0x000A2C, "Member 'ATrap_Wall_HeavyMetal_C::Timeline_4' has a wrong offset!");
static_assert(offsetof(ATrap_Wall_HeavyMetal_C, Timeline_2_NewTrack_3_992ADD614A1F33F23BD393A426C9FEFB) == 0x000A30, "Member 'ATrap_Wall_HeavyMetal_C::Timeline_2_NewTrack_3_992ADD614A1F33F23BD393A426C9FEFB' has a wrong offset!");
static_assert(offsetof(ATrap_Wall_HeavyMetal_C, Timeline_2__Direction_992ADD614A1F33F23BD393A426C9FEFB) == 0x000A34, "Member 'ATrap_Wall_HeavyMetal_C::Timeline_2__Direction_992ADD614A1F33F23BD393A426C9FEFB' has a wrong offset!");
static_assert(offsetof(ATrap_Wall_HeavyMetal_C, Timeline_2) == 0x000A38, "Member 'ATrap_Wall_HeavyMetal_C::Timeline_2' has a wrong offset!");
static_assert(offsetof(ATrap_Wall_HeavyMetal_C, Timeline_1_Brightness_785C5030459D9FB53F0B2BBF5A6BDA36) == 0x000A3C, "Member 'ATrap_Wall_HeavyMetal_C::Timeline_1_Brightness_785C5030459D9FB53F0B2BBF5A6BDA36' has a wrong offset!");
static_assert(offsetof(ATrap_Wall_HeavyMetal_C, Timeline_1__Direction_785C5030459D9FB53F0B2BBF5A6BDA36) == 0x000A40, "Member 'ATrap_Wall_HeavyMetal_C::Timeline_1__Direction_785C5030459D9FB53F0B2BBF5A6BDA36' has a wrong offset!");
static_assert(offsetof(ATrap_Wall_HeavyMetal_C, Timeline_1) == 0x000A44, "Member 'ATrap_Wall_HeavyMetal_C::Timeline_1' has a wrong offset!");
static_assert(offsetof(ATrap_Wall_HeavyMetal_C, Timeline_0_Light_Brightness_8CC35F6445A6E8BD14727E81F5E3AF63) == 0x000A48, "Member 'ATrap_Wall_HeavyMetal_C::Timeline_0_Light_Brightness_8CC35F6445A6E8BD14727E81F5E3AF63' has a wrong offset!");
static_assert(offsetof(ATrap_Wall_HeavyMetal_C, Timeline_0__Direction_8CC35F6445A6E8BD14727E81F5E3AF63) == 0x000A4C, "Member 'ATrap_Wall_HeavyMetal_C::Timeline_0__Direction_8CC35F6445A6E8BD14727E81F5E3AF63' has a wrong offset!");
static_assert(offsetof(ATrap_Wall_HeavyMetal_C, Timeline_0) == 0x000A50, "Member 'ATrap_Wall_HeavyMetal_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ATrap_Wall_HeavyMetal_C, Active_Glow) == 0x000A54, "Member 'ATrap_Wall_HeavyMetal_C::Active_Glow' has a wrong offset!");
static_assert(offsetof(ATrap_Wall_HeavyMetal_C, TrapMesh) == 0x000A58, "Member 'ATrap_Wall_HeavyMetal_C::TrapMesh' has a wrong offset!");
static_assert(offsetof(ATrap_Wall_HeavyMetal_C, Activate_Sound_Cue) == 0x000A5C, "Member 'ATrap_Wall_HeavyMetal_C::Activate_Sound_Cue' has a wrong offset!");
static_assert(offsetof(ATrap_Wall_HeavyMetal_C, Placed_Sound_Cue) == 0x000A60, "Member 'ATrap_Wall_HeavyMetal_C::Placed_Sound_Cue' has a wrong offset!");
static_assert(offsetof(ATrap_Wall_HeavyMetal_C, Explode_Sound_Cue) == 0x000A64, "Member 'ATrap_Wall_HeavyMetal_C::Explode_Sound_Cue' has a wrong offset!");
static_assert(offsetof(ATrap_Wall_HeavyMetal_C, Trap_Fire_Sound_Cue) == 0x000A68, "Member 'ATrap_Wall_HeavyMetal_C::Trap_Fire_Sound_Cue' has a wrong offset!");
static_assert(offsetof(ATrap_Wall_HeavyMetal_C, Material_Light_Brightness) == 0x000A6C, "Member 'ATrap_Wall_HeavyMetal_C::Material_Light_Brightness' has a wrong offset!");
static_assert(offsetof(ATrap_Wall_HeavyMetal_C, Light_Glow) == 0x000A70, "Member 'ATrap_Wall_HeavyMetal_C::Light_Glow' has a wrong offset!");
static_assert(offsetof(ATrap_Wall_HeavyMetal_C, Material_glow) == 0x000A74, "Member 'ATrap_Wall_HeavyMetal_C::Material_glow' has a wrong offset!");
static_assert(offsetof(ATrap_Wall_HeavyMetal_C, Animating_MID) == 0x000A78, "Member 'ATrap_Wall_HeavyMetal_C::Animating_MID' has a wrong offset!");

}

#pragma pack(pop)
