#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Trap_Wall_Electric

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "GameplayAbilities_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass Trap_Wall_Electric.Trap_Wall_Electric_C
// 0x0020 (0x0A10 - 0x09F0)
class ATrap_Wall_Electric_C final : public ABuildingTrapWall
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x09F0(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               Effect_Charge;                                     // 0x09F4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UBoxComponent*                          TriggerComponent;                                  // 0x09F8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class USceneComponent*                        Root;                                              // 0x09FC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class USoundCue*                              Activate_Sound_Cue;                                // 0x0A00(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class USoundCue*                              Placed_Sound_Cue;                                  // 0x0A04(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class USoundCue*                              Explode_Sound_Cue;                                 // 0x0A08(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class USoundCue*                              Trap_Fire_Sound_Cue;                               // 0x0A0C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_Trap_Wall_Electric(int32 EntryPoint);
	void OnOutOfDurability();
	void GameplayCue_Abilities_Activation_Traps_ActivateTrap(EGameplayCueEvent EventType, const struct FGameplayCueParameters& Parameters);
	void OnReloadEnd();
	void OnFinishedBuilding();
	void OnPlaced();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Trap_Wall_Electric_C">();
	}
	static class ATrap_Wall_Electric_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATrap_Wall_Electric_C>();
	}
};
static_assert(alignof(ATrap_Wall_Electric_C) == 0x000004, "Wrong alignment on ATrap_Wall_Electric_C");
static_assert(sizeof(ATrap_Wall_Electric_C) == 0x000A10, "Wrong size on ATrap_Wall_Electric_C");
static_assert(offsetof(ATrap_Wall_Electric_C, UberGraphFrame) == 0x0009F0, "Member 'ATrap_Wall_Electric_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ATrap_Wall_Electric_C, Effect_Charge) == 0x0009F4, "Member 'ATrap_Wall_Electric_C::Effect_Charge' has a wrong offset!");
static_assert(offsetof(ATrap_Wall_Electric_C, TriggerComponent) == 0x0009F8, "Member 'ATrap_Wall_Electric_C::TriggerComponent' has a wrong offset!");
static_assert(offsetof(ATrap_Wall_Electric_C, Root) == 0x0009FC, "Member 'ATrap_Wall_Electric_C::Root' has a wrong offset!");
static_assert(offsetof(ATrap_Wall_Electric_C, Activate_Sound_Cue) == 0x000A00, "Member 'ATrap_Wall_Electric_C::Activate_Sound_Cue' has a wrong offset!");
static_assert(offsetof(ATrap_Wall_Electric_C, Placed_Sound_Cue) == 0x000A04, "Member 'ATrap_Wall_Electric_C::Placed_Sound_Cue' has a wrong offset!");
static_assert(offsetof(ATrap_Wall_Electric_C, Explode_Sound_Cue) == 0x000A08, "Member 'ATrap_Wall_Electric_C::Explode_Sound_Cue' has a wrong offset!");
static_assert(offsetof(ATrap_Wall_Electric_C, Trap_Fire_Sound_Cue) == 0x000A0C, "Member 'ATrap_Wall_Electric_C::Trap_Fire_Sound_Cue' has a wrong offset!");

}

#pragma pack(pop)
