#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Trap_Floor_Stamina

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "GameplayAbilities_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass Trap_Floor_Stamina.Trap_Floor_Stamina_C
// 0x0034 (0x0A24 - 0x09F0)
class ATrap_Floor_Stamina_C final : public ABuildingTrapFloor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x09F0(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               P_Floor_Heal_Active;                               // 0x09F4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UPointLightComponent*                   PointLight;                                        // 0x09F8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UParticleSystemComponent*               Trigger_Effect;                                    // 0x09FC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UBoxComponent*                          Trigger;                                           // 0x0A00(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class USceneComponent*                        Scene1;                                            // 0x0A04(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class USoundCue*                              Trap_Placed_Sound;                                 // 0x0A08(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class USoundCue*                              Trap_Active_Sound;                                 // 0x0A0C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class USoundCue*                              Trap_Fire_Sound;                                   // 0x0A10(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class USoundCue*                              Trap_Reload_Sound;                                 // 0x0A14(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class USoundCue*                              Trap_Explode_Sound;                                // 0x0A18(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UMaterialInstanceDynamic*               Glow_mat;                                          // 0x0A1C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         Charge_Value;                                      // 0x0A20(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)

public:
	void ExecuteUbergraph_Trap_Floor_Stamina(int32 EntryPoint);
	void OnOutOfDurability();
	void GameplayCue_Abilities_Activation_Traps_ActivateTrap(EGameplayCueEvent EventType, const struct FGameplayCueParameters& Parameters);
	void GameplayCue_Abilities_Activation_Traps_ReloadBegin(EGameplayCueEvent EventType, const struct FGameplayCueParameters& Parameters);
	void OnFinishedBuilding();
	void OnPlaced();
	void OnReloadEnd();
	void UserConstructionScript();
	void OnRep_Charge_Value();
	void Active_FX(bool Active);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Trap_Floor_Stamina_C">();
	}
	static class ATrap_Floor_Stamina_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATrap_Floor_Stamina_C>();
	}
};
static_assert(alignof(ATrap_Floor_Stamina_C) == 0x000004, "Wrong alignment on ATrap_Floor_Stamina_C");
static_assert(sizeof(ATrap_Floor_Stamina_C) == 0x000A24, "Wrong size on ATrap_Floor_Stamina_C");
static_assert(offsetof(ATrap_Floor_Stamina_C, UberGraphFrame) == 0x0009F0, "Member 'ATrap_Floor_Stamina_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Stamina_C, P_Floor_Heal_Active) == 0x0009F4, "Member 'ATrap_Floor_Stamina_C::P_Floor_Heal_Active' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Stamina_C, PointLight) == 0x0009F8, "Member 'ATrap_Floor_Stamina_C::PointLight' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Stamina_C, Trigger_Effect) == 0x0009FC, "Member 'ATrap_Floor_Stamina_C::Trigger_Effect' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Stamina_C, Trigger) == 0x000A00, "Member 'ATrap_Floor_Stamina_C::Trigger' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Stamina_C, Scene1) == 0x000A04, "Member 'ATrap_Floor_Stamina_C::Scene1' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Stamina_C, Trap_Placed_Sound) == 0x000A08, "Member 'ATrap_Floor_Stamina_C::Trap_Placed_Sound' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Stamina_C, Trap_Active_Sound) == 0x000A0C, "Member 'ATrap_Floor_Stamina_C::Trap_Active_Sound' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Stamina_C, Trap_Fire_Sound) == 0x000A10, "Member 'ATrap_Floor_Stamina_C::Trap_Fire_Sound' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Stamina_C, Trap_Reload_Sound) == 0x000A14, "Member 'ATrap_Floor_Stamina_C::Trap_Reload_Sound' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Stamina_C, Trap_Explode_Sound) == 0x000A18, "Member 'ATrap_Floor_Stamina_C::Trap_Explode_Sound' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Stamina_C, Glow_mat) == 0x000A1C, "Member 'ATrap_Floor_Stamina_C::Glow_mat' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Stamina_C, Charge_Value) == 0x000A20, "Member 'ATrap_Floor_Stamina_C::Charge_Value' has a wrong offset!");

}

#pragma pack(pop)
