#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Utility_TrashBag_01

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass Utility_TrashBag_01.Utility_TrashBag_01_C
// 0x0020 (0x0A9C - 0x0A7C)
class AUtility_TrashBag_01_C final : public ABuildingContainer
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0A7C(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               Effect_Flies_On_Player;                            // 0x0A80(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UParticleSystemComponent*               Effect_Flies;                                      // 0x0A84(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UBoxComponent*                          Touch_Box;                                         // 0x0A88(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	bool                                          Flies_Can_Attach;                                  // 0x0A8C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A8D[0x3];                                      // 0x0A8D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      ObjectTypeArray;                                   // 0x0A90(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)

public:
	void ExecuteUbergraph_Utility_TrashBag_01(int32 EntryPoint);
	void OnDeathPlayEffects(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void OnDamagePlayEffects(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void OnBeginSearch();
	void OnLootRepeat();
	void OnLoot();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Utility_TrashBag_01_C">();
	}
	static class AUtility_TrashBag_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUtility_TrashBag_01_C>();
	}
};
static_assert(alignof(AUtility_TrashBag_01_C) == 0x000004, "Wrong alignment on AUtility_TrashBag_01_C");
static_assert(sizeof(AUtility_TrashBag_01_C) == 0x000A9C, "Wrong size on AUtility_TrashBag_01_C");
static_assert(offsetof(AUtility_TrashBag_01_C, UberGraphFrame) == 0x000A7C, "Member 'AUtility_TrashBag_01_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AUtility_TrashBag_01_C, Effect_Flies_On_Player) == 0x000A80, "Member 'AUtility_TrashBag_01_C::Effect_Flies_On_Player' has a wrong offset!");
static_assert(offsetof(AUtility_TrashBag_01_C, Effect_Flies) == 0x000A84, "Member 'AUtility_TrashBag_01_C::Effect_Flies' has a wrong offset!");
static_assert(offsetof(AUtility_TrashBag_01_C, Touch_Box) == 0x000A88, "Member 'AUtility_TrashBag_01_C::Touch_Box' has a wrong offset!");
static_assert(offsetof(AUtility_TrashBag_01_C, Flies_Can_Attach) == 0x000A8C, "Member 'AUtility_TrashBag_01_C::Flies_Can_Attach' has a wrong offset!");
static_assert(offsetof(AUtility_TrashBag_01_C, ObjectTypeArray) == 0x000A90, "Member 'AUtility_TrashBag_01_C::ObjectTypeArray' has a wrong offset!");

}

#pragma pack(pop)
