#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Utility_TrashBag_01

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function Utility_TrashBag_01.Utility_TrashBag_01_C.ExecuteUbergraph_Utility_TrashBag_01
// 0x01E0 (0x01E0 - 0x0000)
struct Utility_TrashBag_01_C_ExecuteUbergraph_Utility_TrashBag_01 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0014(0x000C)(ConstParm, ZeroConstructor, ReferenceParm)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<class AActor*>                         CallFunc_BoxOverlapActors_NEW_OutActors;           // 0x002C(0x000C)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_BoxOverlapActors_NEW_ReturnValue;         // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue2;         // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_66[0x2];                                       // 0x0066(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Damage2;                              // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  K2Node_Event_DamageTags2;                          // 0x006C(0x0018)(ConstParm)
	struct FVector                                K2Node_Event_Momentum2;                            // 0x0084(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             K2Node_Event_HitInfo2;                             // 0x0090(0x0080)(ConstParm, ContainsInstancedReference)
	class AFortPawn*                              K2Node_Event_InstigatedBy2;                        // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_Event_DamageCauser2;                        // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext2;                       // 0x0118(0x000C)()
	float                                         K2Node_Event_Damage;                               // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  K2Node_Event_DamageTags;                           // 0x0128(0x0018)(ConstParm)
	struct FVector                                K2Node_Event_Momentum;                             // 0x0140(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             K2Node_Event_HitInfo;                              // 0x014C(0x0080)(ConstParm, ContainsInstancedReference)
	class AFortPawn*                              K2Node_Event_InstigatedBy;                         // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext;                        // 0x01D4(0x000C)()
};
static_assert(alignof(Utility_TrashBag_01_C_ExecuteUbergraph_Utility_TrashBag_01) == 0x000004, "Wrong alignment on Utility_TrashBag_01_C_ExecuteUbergraph_Utility_TrashBag_01");
static_assert(sizeof(Utility_TrashBag_01_C_ExecuteUbergraph_Utility_TrashBag_01) == 0x0001E0, "Wrong size on Utility_TrashBag_01_C_ExecuteUbergraph_Utility_TrashBag_01");
static_assert(offsetof(Utility_TrashBag_01_C_ExecuteUbergraph_Utility_TrashBag_01, EntryPoint) == 0x000000, "Member 'Utility_TrashBag_01_C_ExecuteUbergraph_Utility_TrashBag_01::EntryPoint' has a wrong offset!");
static_assert(offsetof(Utility_TrashBag_01_C_ExecuteUbergraph_Utility_TrashBag_01, Temp_bool_Has_Been_Initd_Variable) == 0x000004, "Member 'Utility_TrashBag_01_C_ExecuteUbergraph_Utility_TrashBag_01::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Utility_TrashBag_01_C_ExecuteUbergraph_Utility_TrashBag_01, Temp_int_Variable) == 0x000008, "Member 'Utility_TrashBag_01_C_ExecuteUbergraph_Utility_TrashBag_01::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Utility_TrashBag_01_C_ExecuteUbergraph_Utility_TrashBag_01, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'Utility_TrashBag_01_C_ExecuteUbergraph_Utility_TrashBag_01::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Utility_TrashBag_01_C_ExecuteUbergraph_Utility_TrashBag_01, Temp_bool_IsClosed_Variable) == 0x000010, "Member 'Utility_TrashBag_01_C_ExecuteUbergraph_Utility_TrashBag_01::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Utility_TrashBag_01_C_ExecuteUbergraph_Utility_TrashBag_01, Temp_object_Variable) == 0x000014, "Member 'Utility_TrashBag_01_C_ExecuteUbergraph_Utility_TrashBag_01::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Utility_TrashBag_01_C_ExecuteUbergraph_Utility_TrashBag_01, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000020, "Member 'Utility_TrashBag_01_C_ExecuteUbergraph_Utility_TrashBag_01::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Utility_TrashBag_01_C_ExecuteUbergraph_Utility_TrashBag_01, CallFunc_BoxOverlapActors_NEW_OutActors) == 0x00002C, "Member 'Utility_TrashBag_01_C_ExecuteUbergraph_Utility_TrashBag_01::CallFunc_BoxOverlapActors_NEW_OutActors' has a wrong offset!");
static_assert(offsetof(Utility_TrashBag_01_C_ExecuteUbergraph_Utility_TrashBag_01, CallFunc_BoxOverlapActors_NEW_ReturnValue) == 0x000038, "Member 'Utility_TrashBag_01_C_ExecuteUbergraph_Utility_TrashBag_01::CallFunc_BoxOverlapActors_NEW_ReturnValue' has a wrong offset!");
static_assert(offsetof(Utility_TrashBag_01_C_ExecuteUbergraph_Utility_TrashBag_01, CallFunc_K2_GetActorLocation_ReturnValue2) == 0x00003C, "Member 'Utility_TrashBag_01_C_ExecuteUbergraph_Utility_TrashBag_01::CallFunc_K2_GetActorLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Utility_TrashBag_01_C_ExecuteUbergraph_Utility_TrashBag_01, CallFunc_Array_Get_Item) == 0x000048, "Member 'Utility_TrashBag_01_C_ExecuteUbergraph_Utility_TrashBag_01::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Utility_TrashBag_01_C_ExecuteUbergraph_Utility_TrashBag_01, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x00004C, "Member 'Utility_TrashBag_01_C_ExecuteUbergraph_Utility_TrashBag_01::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(Utility_TrashBag_01_C_ExecuteUbergraph_Utility_TrashBag_01, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'Utility_TrashBag_01_C_ExecuteUbergraph_Utility_TrashBag_01::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Utility_TrashBag_01_C_ExecuteUbergraph_Utility_TrashBag_01, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000054, "Member 'Utility_TrashBag_01_C_ExecuteUbergraph_Utility_TrashBag_01::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(Utility_TrashBag_01_C_ExecuteUbergraph_Utility_TrashBag_01, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x000058, "Member 'Utility_TrashBag_01_C_ExecuteUbergraph_Utility_TrashBag_01::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(Utility_TrashBag_01_C_ExecuteUbergraph_Utility_TrashBag_01, CallFunc_Array_LastIndex_ReturnValue) == 0x00005C, "Member 'Utility_TrashBag_01_C_ExecuteUbergraph_Utility_TrashBag_01::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(Utility_TrashBag_01_C_ExecuteUbergraph_Utility_TrashBag_01, CallFunc_RandomFloatInRange_ReturnValue) == 0x000060, "Member 'Utility_TrashBag_01_C_ExecuteUbergraph_Utility_TrashBag_01::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Utility_TrashBag_01_C_ExecuteUbergraph_Utility_TrashBag_01, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000064, "Member 'Utility_TrashBag_01_C_ExecuteUbergraph_Utility_TrashBag_01::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Utility_TrashBag_01_C_ExecuteUbergraph_Utility_TrashBag_01, CallFunc_Less_FloatFloat_ReturnValue) == 0x000065, "Member 'Utility_TrashBag_01_C_ExecuteUbergraph_Utility_TrashBag_01::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Utility_TrashBag_01_C_ExecuteUbergraph_Utility_TrashBag_01, K2Node_Event_Damage2) == 0x000068, "Member 'Utility_TrashBag_01_C_ExecuteUbergraph_Utility_TrashBag_01::K2Node_Event_Damage2' has a wrong offset!");
static_assert(offsetof(Utility_TrashBag_01_C_ExecuteUbergraph_Utility_TrashBag_01, K2Node_Event_DamageTags2) == 0x00006C, "Member 'Utility_TrashBag_01_C_ExecuteUbergraph_Utility_TrashBag_01::K2Node_Event_DamageTags2' has a wrong offset!");
static_assert(offsetof(Utility_TrashBag_01_C_ExecuteUbergraph_Utility_TrashBag_01, K2Node_Event_Momentum2) == 0x000084, "Member 'Utility_TrashBag_01_C_ExecuteUbergraph_Utility_TrashBag_01::K2Node_Event_Momentum2' has a wrong offset!");
static_assert(offsetof(Utility_TrashBag_01_C_ExecuteUbergraph_Utility_TrashBag_01, K2Node_Event_HitInfo2) == 0x000090, "Member 'Utility_TrashBag_01_C_ExecuteUbergraph_Utility_TrashBag_01::K2Node_Event_HitInfo2' has a wrong offset!");
static_assert(offsetof(Utility_TrashBag_01_C_ExecuteUbergraph_Utility_TrashBag_01, K2Node_Event_InstigatedBy2) == 0x000110, "Member 'Utility_TrashBag_01_C_ExecuteUbergraph_Utility_TrashBag_01::K2Node_Event_InstigatedBy2' has a wrong offset!");
static_assert(offsetof(Utility_TrashBag_01_C_ExecuteUbergraph_Utility_TrashBag_01, K2Node_Event_DamageCauser2) == 0x000114, "Member 'Utility_TrashBag_01_C_ExecuteUbergraph_Utility_TrashBag_01::K2Node_Event_DamageCauser2' has a wrong offset!");
static_assert(offsetof(Utility_TrashBag_01_C_ExecuteUbergraph_Utility_TrashBag_01, K2Node_Event_EffectContext2) == 0x000118, "Member 'Utility_TrashBag_01_C_ExecuteUbergraph_Utility_TrashBag_01::K2Node_Event_EffectContext2' has a wrong offset!");
static_assert(offsetof(Utility_TrashBag_01_C_ExecuteUbergraph_Utility_TrashBag_01, K2Node_Event_Damage) == 0x000124, "Member 'Utility_TrashBag_01_C_ExecuteUbergraph_Utility_TrashBag_01::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(Utility_TrashBag_01_C_ExecuteUbergraph_Utility_TrashBag_01, K2Node_Event_DamageTags) == 0x000128, "Member 'Utility_TrashBag_01_C_ExecuteUbergraph_Utility_TrashBag_01::K2Node_Event_DamageTags' has a wrong offset!");
static_assert(offsetof(Utility_TrashBag_01_C_ExecuteUbergraph_Utility_TrashBag_01, K2Node_Event_Momentum) == 0x000140, "Member 'Utility_TrashBag_01_C_ExecuteUbergraph_Utility_TrashBag_01::K2Node_Event_Momentum' has a wrong offset!");
static_assert(offsetof(Utility_TrashBag_01_C_ExecuteUbergraph_Utility_TrashBag_01, K2Node_Event_HitInfo) == 0x00014C, "Member 'Utility_TrashBag_01_C_ExecuteUbergraph_Utility_TrashBag_01::K2Node_Event_HitInfo' has a wrong offset!");
static_assert(offsetof(Utility_TrashBag_01_C_ExecuteUbergraph_Utility_TrashBag_01, K2Node_Event_InstigatedBy) == 0x0001CC, "Member 'Utility_TrashBag_01_C_ExecuteUbergraph_Utility_TrashBag_01::K2Node_Event_InstigatedBy' has a wrong offset!");
static_assert(offsetof(Utility_TrashBag_01_C_ExecuteUbergraph_Utility_TrashBag_01, K2Node_Event_DamageCauser) == 0x0001D0, "Member 'Utility_TrashBag_01_C_ExecuteUbergraph_Utility_TrashBag_01::K2Node_Event_DamageCauser' has a wrong offset!");
static_assert(offsetof(Utility_TrashBag_01_C_ExecuteUbergraph_Utility_TrashBag_01, K2Node_Event_EffectContext) == 0x0001D4, "Member 'Utility_TrashBag_01_C_ExecuteUbergraph_Utility_TrashBag_01::K2Node_Event_EffectContext' has a wrong offset!");

// Function Utility_TrashBag_01.Utility_TrashBag_01_C.OnDeathPlayEffects
// 0x00BC (0x00BC - 0x0000)
struct Utility_TrashBag_01_C_OnDeathPlayEffects final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  DamageTags;                                        // 0x0004(0x0018)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FVector                                Momentum;                                          // 0x001C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             HitInfo;                                           // 0x0028(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class AFortPawn*                              InstigatedBy;                                      // 0x00A8(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 DamageCauser;                                      // 0x00AC(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x00B0(0x000C)(Parm)
};
static_assert(alignof(Utility_TrashBag_01_C_OnDeathPlayEffects) == 0x000004, "Wrong alignment on Utility_TrashBag_01_C_OnDeathPlayEffects");
static_assert(sizeof(Utility_TrashBag_01_C_OnDeathPlayEffects) == 0x0000BC, "Wrong size on Utility_TrashBag_01_C_OnDeathPlayEffects");
static_assert(offsetof(Utility_TrashBag_01_C_OnDeathPlayEffects, Damage) == 0x000000, "Member 'Utility_TrashBag_01_C_OnDeathPlayEffects::Damage' has a wrong offset!");
static_assert(offsetof(Utility_TrashBag_01_C_OnDeathPlayEffects, DamageTags) == 0x000004, "Member 'Utility_TrashBag_01_C_OnDeathPlayEffects::DamageTags' has a wrong offset!");
static_assert(offsetof(Utility_TrashBag_01_C_OnDeathPlayEffects, Momentum) == 0x00001C, "Member 'Utility_TrashBag_01_C_OnDeathPlayEffects::Momentum' has a wrong offset!");
static_assert(offsetof(Utility_TrashBag_01_C_OnDeathPlayEffects, HitInfo) == 0x000028, "Member 'Utility_TrashBag_01_C_OnDeathPlayEffects::HitInfo' has a wrong offset!");
static_assert(offsetof(Utility_TrashBag_01_C_OnDeathPlayEffects, InstigatedBy) == 0x0000A8, "Member 'Utility_TrashBag_01_C_OnDeathPlayEffects::InstigatedBy' has a wrong offset!");
static_assert(offsetof(Utility_TrashBag_01_C_OnDeathPlayEffects, DamageCauser) == 0x0000AC, "Member 'Utility_TrashBag_01_C_OnDeathPlayEffects::DamageCauser' has a wrong offset!");
static_assert(offsetof(Utility_TrashBag_01_C_OnDeathPlayEffects, EffectContext) == 0x0000B0, "Member 'Utility_TrashBag_01_C_OnDeathPlayEffects::EffectContext' has a wrong offset!");

// Function Utility_TrashBag_01.Utility_TrashBag_01_C.OnDamagePlayEffects
// 0x00BC (0x00BC - 0x0000)
struct Utility_TrashBag_01_C_OnDamagePlayEffects final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  DamageTags;                                        // 0x0004(0x0018)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FVector                                Momentum;                                          // 0x001C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             HitInfo;                                           // 0x0028(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class AFortPawn*                              InstigatedBy;                                      // 0x00A8(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 DamageCauser;                                      // 0x00AC(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x00B0(0x000C)(Parm)
};
static_assert(alignof(Utility_TrashBag_01_C_OnDamagePlayEffects) == 0x000004, "Wrong alignment on Utility_TrashBag_01_C_OnDamagePlayEffects");
static_assert(sizeof(Utility_TrashBag_01_C_OnDamagePlayEffects) == 0x0000BC, "Wrong size on Utility_TrashBag_01_C_OnDamagePlayEffects");
static_assert(offsetof(Utility_TrashBag_01_C_OnDamagePlayEffects, Damage) == 0x000000, "Member 'Utility_TrashBag_01_C_OnDamagePlayEffects::Damage' has a wrong offset!");
static_assert(offsetof(Utility_TrashBag_01_C_OnDamagePlayEffects, DamageTags) == 0x000004, "Member 'Utility_TrashBag_01_C_OnDamagePlayEffects::DamageTags' has a wrong offset!");
static_assert(offsetof(Utility_TrashBag_01_C_OnDamagePlayEffects, Momentum) == 0x00001C, "Member 'Utility_TrashBag_01_C_OnDamagePlayEffects::Momentum' has a wrong offset!");
static_assert(offsetof(Utility_TrashBag_01_C_OnDamagePlayEffects, HitInfo) == 0x000028, "Member 'Utility_TrashBag_01_C_OnDamagePlayEffects::HitInfo' has a wrong offset!");
static_assert(offsetof(Utility_TrashBag_01_C_OnDamagePlayEffects, InstigatedBy) == 0x0000A8, "Member 'Utility_TrashBag_01_C_OnDamagePlayEffects::InstigatedBy' has a wrong offset!");
static_assert(offsetof(Utility_TrashBag_01_C_OnDamagePlayEffects, DamageCauser) == 0x0000AC, "Member 'Utility_TrashBag_01_C_OnDamagePlayEffects::DamageCauser' has a wrong offset!");
static_assert(offsetof(Utility_TrashBag_01_C_OnDamagePlayEffects, EffectContext) == 0x0000B0, "Member 'Utility_TrashBag_01_C_OnDamagePlayEffects::EffectContext' has a wrong offset!");

}

#pragma pack(pop)
