#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WaterHeater01

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass WaterHeater01.WaterHeater01_C
// 0x0010 (0x0954 - 0x0944)
class AWaterHeater01_C final : public ABuildingProp
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0944(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               Effect_Electric_ON_Hit;                            // 0x0948(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UAudioComponent*                        Audio_Zap;                                         // 0x094C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UParticleSystemComponent*               Effect_Damage_Zap;                                 // 0x0950(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)

public:
	void ExecuteUbergraph_WaterHeater01(int32 EntryPoint);
	void OnDeathPlayEffects(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void OnDamagePlayEffects(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WaterHeater01_C">();
	}
	static class AWaterHeater01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWaterHeater01_C>();
	}
};
static_assert(alignof(AWaterHeater01_C) == 0x000004, "Wrong alignment on AWaterHeater01_C");
static_assert(sizeof(AWaterHeater01_C) == 0x000954, "Wrong size on AWaterHeater01_C");
static_assert(offsetof(AWaterHeater01_C, UberGraphFrame) == 0x000944, "Member 'AWaterHeater01_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AWaterHeater01_C, Effect_Electric_ON_Hit) == 0x000948, "Member 'AWaterHeater01_C::Effect_Electric_ON_Hit' has a wrong offset!");
static_assert(offsetof(AWaterHeater01_C, Audio_Zap) == 0x00094C, "Member 'AWaterHeater01_C::Audio_Zap' has a wrong offset!");
static_assert(offsetof(AWaterHeater01_C, Effect_Damage_Zap) == 0x000950, "Member 'AWaterHeater01_C::Effect_Damage_Zap' has a wrong offset!");

}

#pragma pack(pop)
