#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WerewolfPawn

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function WerewolfPawn.WerewolfPawn_C.ExecuteUbergraph_WerewolfPawn
// 0x005C (0x005C - 0x0000)
struct WerewolfPawn_C_ExecuteUbergraph_WerewolfPawn final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable2;                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable2; // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           CallFunc_LinearColorLerp_ReturnValue;              // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UMaterialInstanceDynamic*               CallFunc_GetPawnMID_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable2;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumGameplayTagsInContainer_ReturnValue; // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetNumGameplayTagsInContainer_ReturnValue2; // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue2;         // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E[0x2];                                       // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumGameplayTagsInContainer_ReturnValue3; // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetNumGameplayTagsInContainer_ReturnValue4; // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue3;         // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue4;         // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumGameplayTagsInContainer_ReturnValue5; // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAllMatchingGameplayTags_ReturnValue;   // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue5;         // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAllMatchingGameplayTags_ReturnValue2;  // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAllMatchingGameplayTags_ReturnValue3;  // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAllMatchingGameplayTags_ReturnValue4;  // 0x0056(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue3;                  // 0x0057(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue4;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAllMatchingGameplayTags_ReturnValue5;  // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue5;                  // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WerewolfPawn_C_ExecuteUbergraph_WerewolfPawn) == 0x000004, "Wrong alignment on WerewolfPawn_C_ExecuteUbergraph_WerewolfPawn");
static_assert(sizeof(WerewolfPawn_C_ExecuteUbergraph_WerewolfPawn) == 0x00005C, "Wrong size on WerewolfPawn_C_ExecuteUbergraph_WerewolfPawn");
static_assert(offsetof(WerewolfPawn_C_ExecuteUbergraph_WerewolfPawn, EntryPoint) == 0x000000, "Member 'WerewolfPawn_C_ExecuteUbergraph_WerewolfPawn::EntryPoint' has a wrong offset!");
static_assert(offsetof(WerewolfPawn_C_ExecuteUbergraph_WerewolfPawn, Temp_bool_Has_Been_Initd_Variable) == 0x000004, "Member 'WerewolfPawn_C_ExecuteUbergraph_WerewolfPawn::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(WerewolfPawn_C_ExecuteUbergraph_WerewolfPawn, Temp_bool_Has_Been_Initd_Variable2) == 0x000005, "Member 'WerewolfPawn_C_ExecuteUbergraph_WerewolfPawn::Temp_bool_Has_Been_Initd_Variable2' has a wrong offset!");
static_assert(offsetof(WerewolfPawn_C_ExecuteUbergraph_WerewolfPawn, Temp_bool_IsClosed_Variable) == 0x000006, "Member 'WerewolfPawn_C_ExecuteUbergraph_WerewolfPawn::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(WerewolfPawn_C_ExecuteUbergraph_WerewolfPawn, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable) == 0x000007, "Member 'WerewolfPawn_C_ExecuteUbergraph_WerewolfPawn::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable' has a wrong offset!");
static_assert(offsetof(WerewolfPawn_C_ExecuteUbergraph_WerewolfPawn, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable2) == 0x000008, "Member 'WerewolfPawn_C_ExecuteUbergraph_WerewolfPawn::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable2' has a wrong offset!");
static_assert(offsetof(WerewolfPawn_C_ExecuteUbergraph_WerewolfPawn, CallFunc_VLerp_ReturnValue) == 0x00000C, "Member 'WerewolfPawn_C_ExecuteUbergraph_WerewolfPawn::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WerewolfPawn_C_ExecuteUbergraph_WerewolfPawn, CallFunc_LinearColorLerp_ReturnValue) == 0x000018, "Member 'WerewolfPawn_C_ExecuteUbergraph_WerewolfPawn::CallFunc_LinearColorLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WerewolfPawn_C_ExecuteUbergraph_WerewolfPawn, CallFunc_GetPawnMID_ReturnValue) == 0x000028, "Member 'WerewolfPawn_C_ExecuteUbergraph_WerewolfPawn::CallFunc_GetPawnMID_ReturnValue' has a wrong offset!");
static_assert(offsetof(WerewolfPawn_C_ExecuteUbergraph_WerewolfPawn, K2Node_Event_DeltaSeconds) == 0x00002C, "Member 'WerewolfPawn_C_ExecuteUbergraph_WerewolfPawn::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(WerewolfPawn_C_ExecuteUbergraph_WerewolfPawn, Temp_bool_IsClosed_Variable2) == 0x000030, "Member 'WerewolfPawn_C_ExecuteUbergraph_WerewolfPawn::Temp_bool_IsClosed_Variable2' has a wrong offset!");
static_assert(offsetof(WerewolfPawn_C_ExecuteUbergraph_WerewolfPawn, CallFunc_GetNumGameplayTagsInContainer_ReturnValue) == 0x000034, "Member 'WerewolfPawn_C_ExecuteUbergraph_WerewolfPawn::CallFunc_GetNumGameplayTagsInContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WerewolfPawn_C_ExecuteUbergraph_WerewolfPawn, CallFunc_GetNumGameplayTagsInContainer_ReturnValue2) == 0x000038, "Member 'WerewolfPawn_C_ExecuteUbergraph_WerewolfPawn::CallFunc_GetNumGameplayTagsInContainer_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WerewolfPawn_C_ExecuteUbergraph_WerewolfPawn, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00003C, "Member 'WerewolfPawn_C_ExecuteUbergraph_WerewolfPawn::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WerewolfPawn_C_ExecuteUbergraph_WerewolfPawn, CallFunc_GreaterEqual_IntInt_ReturnValue2) == 0x00003D, "Member 'WerewolfPawn_C_ExecuteUbergraph_WerewolfPawn::CallFunc_GreaterEqual_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WerewolfPawn_C_ExecuteUbergraph_WerewolfPawn, CallFunc_GetNumGameplayTagsInContainer_ReturnValue3) == 0x000040, "Member 'WerewolfPawn_C_ExecuteUbergraph_WerewolfPawn::CallFunc_GetNumGameplayTagsInContainer_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WerewolfPawn_C_ExecuteUbergraph_WerewolfPawn, CallFunc_GetNumGameplayTagsInContainer_ReturnValue4) == 0x000044, "Member 'WerewolfPawn_C_ExecuteUbergraph_WerewolfPawn::CallFunc_GetNumGameplayTagsInContainer_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WerewolfPawn_C_ExecuteUbergraph_WerewolfPawn, CallFunc_GreaterEqual_IntInt_ReturnValue3) == 0x000048, "Member 'WerewolfPawn_C_ExecuteUbergraph_WerewolfPawn::CallFunc_GreaterEqual_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WerewolfPawn_C_ExecuteUbergraph_WerewolfPawn, CallFunc_GreaterEqual_IntInt_ReturnValue4) == 0x000049, "Member 'WerewolfPawn_C_ExecuteUbergraph_WerewolfPawn::CallFunc_GreaterEqual_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WerewolfPawn_C_ExecuteUbergraph_WerewolfPawn, CallFunc_GetNumGameplayTagsInContainer_ReturnValue5) == 0x00004C, "Member 'WerewolfPawn_C_ExecuteUbergraph_WerewolfPawn::CallFunc_GetNumGameplayTagsInContainer_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WerewolfPawn_C_ExecuteUbergraph_WerewolfPawn, CallFunc_HasAllMatchingGameplayTags_ReturnValue) == 0x000050, "Member 'WerewolfPawn_C_ExecuteUbergraph_WerewolfPawn::CallFunc_HasAllMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(WerewolfPawn_C_ExecuteUbergraph_WerewolfPawn, CallFunc_GreaterEqual_IntInt_ReturnValue5) == 0x000051, "Member 'WerewolfPawn_C_ExecuteUbergraph_WerewolfPawn::CallFunc_GreaterEqual_IntInt_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WerewolfPawn_C_ExecuteUbergraph_WerewolfPawn, CallFunc_BooleanAND_ReturnValue) == 0x000052, "Member 'WerewolfPawn_C_ExecuteUbergraph_WerewolfPawn::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WerewolfPawn_C_ExecuteUbergraph_WerewolfPawn, CallFunc_HasAllMatchingGameplayTags_ReturnValue2) == 0x000053, "Member 'WerewolfPawn_C_ExecuteUbergraph_WerewolfPawn::CallFunc_HasAllMatchingGameplayTags_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WerewolfPawn_C_ExecuteUbergraph_WerewolfPawn, CallFunc_BooleanAND_ReturnValue2) == 0x000054, "Member 'WerewolfPawn_C_ExecuteUbergraph_WerewolfPawn::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WerewolfPawn_C_ExecuteUbergraph_WerewolfPawn, CallFunc_HasAllMatchingGameplayTags_ReturnValue3) == 0x000055, "Member 'WerewolfPawn_C_ExecuteUbergraph_WerewolfPawn::CallFunc_HasAllMatchingGameplayTags_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WerewolfPawn_C_ExecuteUbergraph_WerewolfPawn, CallFunc_HasAllMatchingGameplayTags_ReturnValue4) == 0x000056, "Member 'WerewolfPawn_C_ExecuteUbergraph_WerewolfPawn::CallFunc_HasAllMatchingGameplayTags_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WerewolfPawn_C_ExecuteUbergraph_WerewolfPawn, CallFunc_BooleanAND_ReturnValue3) == 0x000057, "Member 'WerewolfPawn_C_ExecuteUbergraph_WerewolfPawn::CallFunc_BooleanAND_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WerewolfPawn_C_ExecuteUbergraph_WerewolfPawn, CallFunc_BooleanAND_ReturnValue4) == 0x000058, "Member 'WerewolfPawn_C_ExecuteUbergraph_WerewolfPawn::CallFunc_BooleanAND_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WerewolfPawn_C_ExecuteUbergraph_WerewolfPawn, CallFunc_HasAllMatchingGameplayTags_ReturnValue5) == 0x000059, "Member 'WerewolfPawn_C_ExecuteUbergraph_WerewolfPawn::CallFunc_HasAllMatchingGameplayTags_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WerewolfPawn_C_ExecuteUbergraph_WerewolfPawn, CallFunc_BooleanAND_ReturnValue5) == 0x00005A, "Member 'WerewolfPawn_C_ExecuteUbergraph_WerewolfPawn::CallFunc_BooleanAND_ReturnValue5' has a wrong offset!");

// Function WerewolfPawn.WerewolfPawn_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct WerewolfPawn_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WerewolfPawn_C_ReceiveTick) == 0x000004, "Wrong alignment on WerewolfPawn_C_ReceiveTick");
static_assert(sizeof(WerewolfPawn_C_ReceiveTick) == 0x000004, "Wrong size on WerewolfPawn_C_ReceiveTick");
static_assert(offsetof(WerewolfPawn_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'WerewolfPawn_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

#pragma pack(pop)
