#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WerewolfVimBlueprint

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"


#pragma pack(push, 0x4)
namespace SDK::Params
{

// Function WerewolfVimBlueprint.WerewolfVimBlueprint_C.ExecuteUbergraph_WerewolfVimBlueprint
// 0x0228 (0x0228 - 0x0000)
struct WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue2;         // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue2;                   // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F[0x1];                                        // 0x000F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetAnimAssetPlayerTimeFromEnd_ReturnValue; // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue3;                   // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue3;         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue4;         // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue4;                   // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue2;       // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue5;                   // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue6;                   // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue5;         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue6;         // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue7;                   // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue8;                   // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetAnimAssetPlayerTimeFromEnd_ReturnValue2; // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue2;        // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetAnimAssetPlayerTimeFromEnd_ReturnValue3; // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue3;        // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue4;        // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue9;                   // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue10;                  // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue3;                 // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_SelectVector_ReturnValue2;                // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_SelectVector_ReturnValue3;                // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_SelectVector_ReturnValue4;                // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_SelectVector_ReturnValue5;                // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_SelectVector_ReturnValue6;                // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_SelectVector_ReturnValue7;                // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_SelectVector_ReturnValue8;                // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_SelectVector_ReturnValue9;                // 0x0098(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_SelectVector_ReturnValue10;               // 0x00A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_SelectVector_ReturnValue11;               // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_SelectVector_ReturnValue12;               // 0x00BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_SelectVector_ReturnValue13;               // 0x00C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_SelectVector_ReturnValue14;               // 0x00D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_SelectVector_ReturnValue15;               // 0x00E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_SelectVector_ReturnValue16;               // 0x00EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_SelectVector_ReturnValue17;               // 0x00F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_SelectVector_ReturnValue18;               // 0x0104(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_SelectVector_ReturnValue19;               // 0x0110(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_SelectVector_ReturnValue20;               // 0x011C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_SelectVector_ReturnValue21;               // 0x0128(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_SelectVector_ReturnValue22;               // 0x0134(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_SelectVector_ReturnValue23;               // 0x0140(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_SelectVector_ReturnValue24;               // 0x014C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_SelectVector_ReturnValue25;               // 0x0158(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_SelectVector_ReturnValue26;               // 0x0164(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_SelectVector_ReturnValue27;               // 0x0170(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_SelectVector_ReturnValue28;               // 0x017C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue3;       // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortMovementStyle                            CallFunc_MakeMovementStyle_ReturnValue;            // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x018A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_18B[0x1];                                      // 0x018B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue4;       // 0x0194(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue2;          // 0x0195(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue3;                  // 0x0196(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue3;          // 0x0197(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue4;                  // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue4;                 // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue5;       // 0x019A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue5;                  // 0x019B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue5;                 // 0x019C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19D[0x3];                                      // 0x019D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetStateWeight_ReturnValue;               // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortAIPawn*                            K2Node_DynamicCast_AsFort_AIPawn;                  // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B1[0x3];                                      // 0x01B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortAIPawn*                            K2Node_DynamicCast_AsFort_AIPawn2;                 // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x01BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue2;         // 0x01BB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue3;         // 0x01BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue4;         // 0x01BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue5;         // 0x01BE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1BF[0x1];                                      // 0x01BF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UPawnMovementComponent*                 CallFunc_GetMovementComponent_ReturnValue;         // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsFalling_ReturnValue;                    // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C9[0x3];                                      // 0x01C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Percent_IntInt_ReturnValue2;              // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortMovementStyle                            CallFunc_GetMovementStyle_ReturnValue;             // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x01D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D2[0x2];                                      // 0x01D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x01D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X;                            // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Y;                            // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Z;                            // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue2;             // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_VSize2D_ReturnValue;                      // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortAIPawn*                            K2Node_DynamicCast_AsFort_AIPawn3;                 // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0204(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_205[0x3];                                      // 0x0205(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue3;             // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortAIPawn*                            K2Node_DynamicCast_AsFort_AIPawn4;                 // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_211[0x3];                                      // 0x0211(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue4;             // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortAIPawn*                            K2Node_DynamicCast_AsFort_AIPawn5;                 // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess5;                      // 0x021C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue6;                  // 0x021D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21E[0x2];                                      // 0x021E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortAIPawn*                            CallFunc_TryGetFortAIPawn_ReturnValue;             // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0224(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayingRootMotion_ReturnValue;          // 0x0225(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint) == 0x000004, "Wrong alignment on WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint");
static_assert(sizeof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint) == 0x000228, "Wrong size on WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, EntryPoint) == 0x000000, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::EntryPoint' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_FClamp_ReturnValue) == 0x000004, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000008, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x000009, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_BooleanAND_ReturnValue) == 0x00000A, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_NotEqual_FloatFloat_ReturnValue) == 0x00000B, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_NotEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_NotEqual_FloatFloat_ReturnValue2) == 0x00000C, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_NotEqual_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_BooleanOR_ReturnValue) == 0x00000D, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_BooleanOR_ReturnValue2) == 0x00000E, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_BooleanOR_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_GetAnimAssetPlayerTimeFromEnd_ReturnValue) == 0x000010, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_GetAnimAssetPlayerTimeFromEnd_ReturnValue' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000014, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_Not_PreBool_ReturnValue) == 0x000015, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_BooleanOR_ReturnValue3) == 0x000016, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_BooleanOR_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_Not_PreBool_ReturnValue2) == 0x000017, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_Not_PreBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_NotEqual_FloatFloat_ReturnValue3) == 0x000018, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_NotEqual_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_Less_FloatFloat_ReturnValue) == 0x000019, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_NotEqual_FloatFloat_ReturnValue4) == 0x00001A, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_NotEqual_FloatFloat_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_BooleanAND_ReturnValue2) == 0x00001B, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_BooleanOR_ReturnValue4) == 0x00001C, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_BooleanOR_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_EqualEqual_FloatFloat_ReturnValue2) == 0x00001D, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_EqualEqual_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_BooleanOR_ReturnValue5) == 0x00001E, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_BooleanOR_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_BooleanOR_ReturnValue6) == 0x00001F, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_BooleanOR_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_NotEqual_FloatFloat_ReturnValue5) == 0x000020, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_NotEqual_FloatFloat_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_NotEqual_FloatFloat_ReturnValue6) == 0x000021, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_NotEqual_FloatFloat_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_BooleanOR_ReturnValue7) == 0x000022, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_BooleanOR_ReturnValue7' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_BooleanOR_ReturnValue8) == 0x000023, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_BooleanOR_ReturnValue8' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_GetAnimAssetPlayerTimeFromEnd_ReturnValue2) == 0x000024, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_GetAnimAssetPlayerTimeFromEnd_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_LessEqual_FloatFloat_ReturnValue2) == 0x000028, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_LessEqual_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_GetAnimAssetPlayerTimeFromEnd_ReturnValue3) == 0x00002C, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_GetAnimAssetPlayerTimeFromEnd_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_LessEqual_FloatFloat_ReturnValue3) == 0x000030, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_LessEqual_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_LessEqual_FloatFloat_ReturnValue4) == 0x000031, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_LessEqual_FloatFloat_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_BooleanOR_ReturnValue9) == 0x000032, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_BooleanOR_ReturnValue9' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_BooleanOR_ReturnValue10) == 0x000033, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_BooleanOR_ReturnValue10' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_SelectVector_ReturnValue) == 0x000034, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_Not_PreBool_ReturnValue3) == 0x000040, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_Not_PreBool_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_SelectVector_ReturnValue2) == 0x000044, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_SelectVector_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_SelectVector_ReturnValue3) == 0x000050, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_SelectVector_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_SelectVector_ReturnValue4) == 0x00005C, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_SelectVector_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_SelectVector_ReturnValue5) == 0x000068, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_SelectVector_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_SelectVector_ReturnValue6) == 0x000074, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_SelectVector_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_SelectVector_ReturnValue7) == 0x000080, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_SelectVector_ReturnValue7' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_SelectVector_ReturnValue8) == 0x00008C, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_SelectVector_ReturnValue8' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_SelectVector_ReturnValue9) == 0x000098, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_SelectVector_ReturnValue9' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_SelectVector_ReturnValue10) == 0x0000A4, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_SelectVector_ReturnValue10' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_SelectVector_ReturnValue11) == 0x0000B0, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_SelectVector_ReturnValue11' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_SelectVector_ReturnValue12) == 0x0000BC, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_SelectVector_ReturnValue12' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_SelectVector_ReturnValue13) == 0x0000C8, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_SelectVector_ReturnValue13' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_SelectVector_ReturnValue14) == 0x0000D4, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_SelectVector_ReturnValue14' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_SelectVector_ReturnValue15) == 0x0000E0, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_SelectVector_ReturnValue15' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_SelectVector_ReturnValue16) == 0x0000EC, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_SelectVector_ReturnValue16' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_SelectVector_ReturnValue17) == 0x0000F8, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_SelectVector_ReturnValue17' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_SelectVector_ReturnValue18) == 0x000104, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_SelectVector_ReturnValue18' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_SelectVector_ReturnValue19) == 0x000110, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_SelectVector_ReturnValue19' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_SelectVector_ReturnValue20) == 0x00011C, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_SelectVector_ReturnValue20' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_SelectVector_ReturnValue21) == 0x000128, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_SelectVector_ReturnValue21' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_SelectVector_ReturnValue22) == 0x000134, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_SelectVector_ReturnValue22' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_SelectVector_ReturnValue23) == 0x000140, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_SelectVector_ReturnValue23' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_SelectVector_ReturnValue24) == 0x00014C, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_SelectVector_ReturnValue24' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_SelectVector_ReturnValue25) == 0x000158, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_SelectVector_ReturnValue25' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_SelectVector_ReturnValue26) == 0x000164, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_SelectVector_ReturnValue26' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_SelectVector_ReturnValue27) == 0x000170, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_SelectVector_ReturnValue27' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_SelectVector_ReturnValue28) == 0x00017C, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_SelectVector_ReturnValue28' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_EqualEqual_FloatFloat_ReturnValue3) == 0x000188, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_EqualEqual_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_MakeMovementStyle_ReturnValue) == 0x000189, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_MakeMovementStyle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00018A, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00018C, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_SelectInt_ReturnValue) == 0x000190, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_EqualEqual_FloatFloat_ReturnValue4) == 0x000194, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_EqualEqual_FloatFloat_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_Greater_FloatFloat_ReturnValue2) == 0x000195, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_Greater_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_BooleanAND_ReturnValue3) == 0x000196, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_BooleanAND_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_Greater_FloatFloat_ReturnValue3) == 0x000197, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_Greater_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_BooleanAND_ReturnValue4) == 0x000198, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_BooleanAND_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_Not_PreBool_ReturnValue4) == 0x000199, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_Not_PreBool_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_EqualEqual_FloatFloat_ReturnValue5) == 0x00019A, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_EqualEqual_FloatFloat_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_BooleanAND_ReturnValue5) == 0x00019B, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_BooleanAND_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_Not_PreBool_ReturnValue5) == 0x00019C, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_Not_PreBool_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_GetStateWeight_ReturnValue) == 0x0001A0, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_GetStateWeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0001A4, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_TryGetPawnOwner_ReturnValue) == 0x0001A8, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, K2Node_DynamicCast_AsFort_AIPawn) == 0x0001AC, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::K2Node_DynamicCast_AsFort_AIPawn' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, K2Node_DynamicCast_bSuccess) == 0x0001B0, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, K2Node_DynamicCast_AsFort_AIPawn2) == 0x0001B4, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::K2Node_DynamicCast_AsFort_AIPawn2' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, K2Node_DynamicCast_bSuccess2) == 0x0001B8, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_Greater_IntInt_ReturnValue) == 0x0001B9, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_EqualEqual_NameName_ReturnValue) == 0x0001BA, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_EqualEqual_NameName_ReturnValue2) == 0x0001BB, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_EqualEqual_NameName_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_EqualEqual_NameName_ReturnValue3) == 0x0001BC, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_EqualEqual_NameName_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_EqualEqual_NameName_ReturnValue4) == 0x0001BD, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_EqualEqual_NameName_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_EqualEqual_NameName_ReturnValue5) == 0x0001BE, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_EqualEqual_NameName_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_GetMovementComponent_ReturnValue) == 0x0001C0, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_GetMovementComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_Percent_IntInt_ReturnValue) == 0x0001C4, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_IsFalling_ReturnValue) == 0x0001C8, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_IsFalling_ReturnValue' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_Percent_IntInt_ReturnValue2) == 0x0001CC, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_Percent_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_GetMovementStyle_ReturnValue) == 0x0001D0, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_GetMovementStyle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0001D1, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_GetVelocity_ReturnValue) == 0x0001D4, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, K2Node_Event_DeltaTimeX) == 0x0001E0, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_BreakVector_X) == 0x0001E4, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_BreakVector_Y) == 0x0001E8, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_BreakVector_Z) == 0x0001EC, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_MakeVector2D_ReturnValue) == 0x0001F0, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_TryGetPawnOwner_ReturnValue2) == 0x0001F8, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_TryGetPawnOwner_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_VSize2D_ReturnValue) == 0x0001FC, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_VSize2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, K2Node_DynamicCast_AsFort_AIPawn3) == 0x000200, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::K2Node_DynamicCast_AsFort_AIPawn3' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, K2Node_DynamicCast_bSuccess3) == 0x000204, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_TryGetPawnOwner_ReturnValue3) == 0x000208, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_TryGetPawnOwner_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, K2Node_DynamicCast_AsFort_AIPawn4) == 0x00020C, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::K2Node_DynamicCast_AsFort_AIPawn4' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, K2Node_DynamicCast_bSuccess4) == 0x000210, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_TryGetPawnOwner_ReturnValue4) == 0x000214, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_TryGetPawnOwner_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, K2Node_DynamicCast_AsFort_AIPawn5) == 0x000218, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::K2Node_DynamicCast_AsFort_AIPawn5' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, K2Node_DynamicCast_bSuccess5) == 0x00021C, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::K2Node_DynamicCast_bSuccess5' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_BooleanAND_ReturnValue6) == 0x00021D, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_BooleanAND_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_TryGetFortAIPawn_ReturnValue) == 0x000220, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_TryGetFortAIPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000224, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint, CallFunc_IsPlayingRootMotion_ReturnValue) == 0x000225, "Member 'WerewolfVimBlueprint_C_ExecuteUbergraph_WerewolfVimBlueprint::CallFunc_IsPlayingRootMotion_ReturnValue' has a wrong offset!");

// Function WerewolfVimBlueprint.WerewolfVimBlueprint_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct WerewolfVimBlueprint_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WerewolfVimBlueprint_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on WerewolfVimBlueprint_C_BlueprintUpdateAnimation");
static_assert(sizeof(WerewolfVimBlueprint_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on WerewolfVimBlueprint_C_BlueprintUpdateAnimation");
static_assert(offsetof(WerewolfVimBlueprint_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'WerewolfVimBlueprint_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

}

#pragma pack(pop)
