#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WerewolfPawn

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


#pragma pack(push, 0x4)
namespace SDK
{

// BlueprintGeneratedClass WerewolfPawn.WerewolfPawn_C
// 0x0030 (0x0E80 - 0x0E50)
class AWerewolfPawn_C final : public AFortAIPawn
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0E50(0x0004)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         Timeline_0_NewTrack_0_4481FC25408327A90FA05987AC85FE39; // 0x0E54(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ETimelineDirection                            Timeline_0__Direction_4481FC25408327A90FA05987AC85FE39; // 0x0E58(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E59[0x3];                                      // 0x0E59(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0E5C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  TC_AISkillWerewolfBloodFrenzyActive;               // 0x0E60(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_WerewolfPawn(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WerewolfPawn_C">();
	}
	static class AWerewolfPawn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWerewolfPawn_C>();
	}
};
static_assert(alignof(AWerewolfPawn_C) == 0x000010, "Wrong alignment on AWerewolfPawn_C");
static_assert(sizeof(AWerewolfPawn_C) == 0x000E80, "Wrong size on AWerewolfPawn_C");
static_assert(offsetof(AWerewolfPawn_C, UberGraphFrame) == 0x000E50, "Member 'AWerewolfPawn_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AWerewolfPawn_C, Timeline_0_NewTrack_0_4481FC25408327A90FA05987AC85FE39) == 0x000E54, "Member 'AWerewolfPawn_C::Timeline_0_NewTrack_0_4481FC25408327A90FA05987AC85FE39' has a wrong offset!");
static_assert(offsetof(AWerewolfPawn_C, Timeline_0__Direction_4481FC25408327A90FA05987AC85FE39) == 0x000E58, "Member 'AWerewolfPawn_C::Timeline_0__Direction_4481FC25408327A90FA05987AC85FE39' has a wrong offset!");
static_assert(offsetof(AWerewolfPawn_C, Timeline_0) == 0x000E5C, "Member 'AWerewolfPawn_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(AWerewolfPawn_C, TC_AISkillWerewolfBloodFrenzyActive) == 0x000E60, "Member 'AWerewolfPawn_C::TC_AISkillWerewolfBloodFrenzyActive' has a wrong offset!");

}

#pragma pack(pop)
